zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz25/pic32cx1012bz25048-pinctrl.h
#define PA4_EXTINT1_IN   MCHP_PINMUX(a, 4, 0x4, 1, periph)
/* pa4_extint2_in */
#define PA4_EXTINT2_IN   MCHP_PINMUX(a, 4, 0x8, 8, periph)
/* pa4_qcs_out */
#define PA4_QCS_OUT      MCHP_PINMUX(a, 4, 0x224, 24, periph)
/* pa4_qd0_out */
#define PA4_QD0_OUT      MCHP_PINMUX(a, 4, 0x224, 25, periph)
/* pa4_qd1_out */
#define PA4_QD1_OUT      MCHP_PINMUX(a, 4, 0x228, 25, periph)
/* pa4_qd2_in */
#define PA4_QD2_IN       MCHP_PINMUX(a, 4, 0x8c, 1, periph)
/* pa4_qd2_out */
#define PA4_QD2_OUT      MCHP_PINMUX(a, 4, 0x224, 27, periph)
/* pa4_qd3_in */
#define PA4_QD3_IN       MCHP_PINMUX(a, 4, 0x90, 8, periph)
/* pa4_qd3_out */
#define PA4_QD3_OUT      MCHP_PINMUX(a, 4, 0x224, 26, periph)
/* pa4_qsck_out */
#define PA4_QSCK_OUT     MCHP_PINMUX(a, 4, 0x224, 23, periph)
/* pa4_refo2_out */
#define PA4_REFO2_OUT    MCHP_PINMUX(a, 4, 0x224, 19, periph)
/* pa4_refo3_out */
#define PA4_REFO3_OUT    MCHP_PINMUX(a, 4, 0x228, 19, periph)
/* pa4_refo4_out */
#define PA4_REFO4_OUT    MCHP_PINMUX(a, 4, 0x22c, 19, periph)
/* pa4_scom0p0_in */
#define PA4_SCOM0P0_IN   MCHP_PINMUX(a, 4, 0x40, 1, periph)
/* pa4_scom0p0_out */
#define PA4_SCOM0P0_OUT  MCHP_PINMUX(a, 4, 0x224, 1, periph)
/* pa4_scom0p1_in */
#define PA4_SCOM0P1_IN   MCHP_PINMUX(a, 4, 0x44, 8, periph)
/* pa4_scom0p1_out */
#define PA4_SCOM0P1_OUT  MCHP_PINMUX(a, 4, 0x228, 1, periph)
/* pa4_scom0p2_out */
#define PA4_SCOM0P2_OUT  MCHP_PINMUX(a, 4, 0x224, 3, periph)
/* pa4_scom0p3_out */
#define PA4_SCOM0P3_OUT  MCHP_PINMUX(a, 4, 0x224, 2, periph)
/* pa4_scom1p0_in */
#define PA4_SCOM1P0_IN   MCHP_PINMUX(a, 4, 0x50, 8, periph)
/* pa4_scom1p0_out */
#define PA4_SCOM1P0_OUT  MCHP_PINMUX(a, 4, 0x228, 5, periph)
/* pa4_scom1p1_out */
#define PA4_SCOM1P1_OUT  MCHP_PINMUX(a, 4, 0x224, 4, periph)
/* pa4_scom1p2_out */
#define PA4_SCOM1P2_OUT  MCHP_PINMUX(a, 4, 0x224, 6, periph)
/* pa4_scom1p3_in */
#define PA4_SCOM1P3_IN   MCHP_PINMUX(a, 4, 0x5c, 1, periph)
/* pa4_scom1p3_out */
#define PA4_SCOM1P3_OUT  MCHP_PINMUX(a, 4, 0x224, 5, periph)
/* pa4_scom2p0_out */
#define PA4_SCOM2P0_OUT  MCHP_PINMUX(a, 4, 0x22c, 8, periph)
/* pa4_scom2p1_out */
#define PA4_SCOM2P1_OUT  MCHP_PINMUX(a, 4, 0x224, 7, periph)
/* pa4_scom2p2_in */
#define PA4_SCOM2P2_IN   MCHP_PINMUX(a, 4, 0x68, 1, periph)
/* pa4_scom2p2_out */
#define PA4_SCOM2P2_OUT  MCHP_PINMUX(a, 4, 0x224, 8, periph)
/* pa4_scom2p3_in */
#define PA4_SCOM2P3_IN   MCHP_PINMUX(a, 4, 0x6c, 8, periph)
/* pa4_scom2p3_out */
#define PA4_SCOM2P3_OUT  MCHP_PINMUX(a, 4, 0x228, 8, periph)
/* pa4_scom3p0_out */
#define PA4_SCOM3P0_OUT  MCHP_PINMUX(a, 4, 0x224, 10, periph)
/* pa4_scom3p1_in */
#define PA4_SCOM3P1_IN   MCHP_PINMUX(a, 4, 0x74, 1, periph)
/* pa4_scom3p1_out */
#define PA4_SCOM3P1_OUT  MCHP_PINMUX(a, 4, 0x224, 9, periph)
/* pa4_scom3p2_in */
#define PA4_SCOM3P2_IN   MCHP_PINMUX(a, 4, 0x78, 8, periph)
/* pa4_scom3p2_out */
#define PA4_SCOM3P2_OUT  MCHP_PINMUX(a, 4, 0x228, 9, periph)
/* pa4_scom3p3_out */
#define PA4_SCOM3P3_OUT  MCHP_PINMUX(a, 4, 0x22c, 9, periph)
/* pa4_tc0wo0g2_in */
#define PA4_TC0WO0G2_IN  MCHP_PINMUX(a, 4, 0xb4, 1, periph)
/* pa4_tc0wo0_out */
#define PA4_TC0WO0_OUT   MCHP_PINMUX(a, 4, 0x228, 18, periph)
/* pa4_tc0wo1g3_in */
#define PA4_TC0WO1G3_IN  MCHP_PINMUX(a, 4, 0xb8, 8, periph)
/* pa4_tc0wo1_out */
#define PA4_TC0WO1_OUT   MCHP_PINMUX(a, 4, 0x224, 18, periph)
/* pa4_tc1wo0_out */
#define PA4_TC1WO0_OUT   MCHP_PINMUX(a, 4, 0x228, 20, periph)
/* pa4_tc1wo1g2_in */
#define PA4_TC1WO1G2_IN  MCHP_PINMUX(a, 4, 0xc4, 1, periph)
/* pa4_tc1wo1_out */
#define PA4_TC1WO1_OUT   MCHP_PINMUX(a, 4, 0x224, 20, periph)
/* pa4_tc2wo0g3_in */
#define PA4_TC2WO0G3_IN  MCHP_PINMUX(a, 4, 0xcc, 8, periph)
/* pa4_tc2wo0_out */
#define PA4_TC2WO0_OUT   MCHP_PINMUX(a, 4, 0x228, 21, periph)
/* pa4_tc2wo1g2_in */
#define PA4_TC2WO1G2_IN  MCHP_PINMUX(a, 4, 0xd0, 1, periph)
/* pa4_tc2wo1_out */
#define PA4_TC2WO1_OUT   MCHP_PINMUX(a, 4, 0x224, 21, periph)
/* pa4_tc3wo0g3_in */
#define PA4_TC3WO0G3_IN  MCHP_PINMUX(a, 4, 0xdc, 8, periph)
/* pa4_tc3wo0_out */
#define PA4_TC3WO0_OUT   MCHP_PINMUX(a, 4, 0x228, 22, periph)
/* pa4_tc3wo1g2_in */
#define PA4_TC3WO1G2_IN  MCHP_PINMUX(a, 4, 0xe0, 1, periph)
/* pa4_tc3wo1_out */
#define PA4_TC3WO1_OUT   MCHP_PINMUX(a, 4, 0x224, 22, periph)
/* pa4_tcc0wo0_out */
#define PA4_TCC0WO0_OUT  MCHP_PINMUX(a, 4, 0x228, 12, periph)
/* pa4_tcc0wo1_out */
#define PA4_TCC0WO1_OUT  MCHP_PINMUX(a, 4, 0x224, 11, periph)
/* pa4_tcc0wo2_out */
#define PA4_TCC0WO2_OUT  MCHP_PINMUX(a, 4, 0x228, 11, periph)
/* pa4_tcc0wo3_out */
#define PA4_TCC0WO3_OUT  MCHP_PINMUX(a, 4, 0x224, 13, periph)
/* pa4_tcc0wo4_out */
#define PA4_TCC0WO4_OUT  MCHP_PINMUX(a, 4, 0x228, 13, periph)
/* pa4_tcc0wo5_out */
#define PA4_TCC0WO5_OUT  MCHP_PINMUX(a, 4, 0x224, 12, periph)
/* pa4_tcc1wo0_out */
#define PA4_TCC1WO0_OUT  MCHP_PINMUX(a, 4, 0x228, 15, periph)
/* pa4_tcc1wo1_out */
#define PA4_TCC1WO1_OUT  MCHP_PINMUX(a, 4, 0x224, 14, periph)
/* pa4_tcc1wo2_out */
#define PA4_TCC1WO2_OUT  MCHP_PINMUX(a, 4, 0x228, 14, periph)
/* pa4_tcc1wo3_out */
#define PA4_TCC1WO3_OUT  MCHP_PINMUX(a, 4, 0x224, 16, periph)
/* pa4_tcc1wo4_out */
#define PA4_TCC1WO4_OUT  MCHP_PINMUX(a, 4, 0x228, 16, periph)
/* pa4_tcc1wo5_out */
#define PA4_TCC1WO5_OUT  MCHP_PINMUX(a, 4, 0x224, 15, periph)
/* pa4_tcc2wo0_out */
#define PA4_TCC2WO0_OUT  MCHP_PINMUX(a, 4, 0x228, 17, periph)
/* pa4_tcc2wo1_out */
#define PA4_TCC2WO1_OUT  MCHP_PINMUX(a, 4, 0x224, 17, periph)
/* pa5_cclin2_in */
#define PA5_CCLIN2_IN    MCHP_PINMUX(a, 5, 0xa0, 1, periph)
/* pa5_cclin5_in */
#define PA5_CCLIN5_IN    MCHP_PINMUX(a, 5, 0xac, 1, periph)
/* pa5_cclout0_out */
#define PA5_CCLOUT0_OUT  MCHP_PINMUX(a, 5, 0x230, 28, periph)
/* pa5_cclout1_out */
#define PA5_CCLOUT1_OUT  MCHP_PINMUX(a, 5, 0x238, 28, periph)
/* pa5_extint2_in */
#define PA5_EXTINT2_IN   MCHP_PINMUX(a, 5, 0x8, 1, periph)
/* pa5_extint3_in */
#define PA5_EXTINT3_IN   MCHP_PINMUX(a, 5, 0xc, 8, periph)
/* pa5_nmi_in */
#define PA5_NMI_IN       MCHP_PINMUX(a, 5, 0x3c, 8, periph)
/* pa5_qcs_out */
#define PA5_QCS_OUT      MCHP_PINMUX(a, 5, 0x230, 24, periph)
/* pa5_qd0_in */
#define PA5_QD0_IN       MCHP_PINMUX(a, 5, 0x84, 8, periph)
/* pa5_qd0_out */
#define PA5_QD0_OUT      MCHP_PINMUX(a, 5, 0x234, 26, periph)
/* pa5_qd1_out */
#define PA5_QD1_OUT      MCHP_PINMUX(a, 5, 0x230, 27, periph)
/* pa5_qd2_out */
#define PA5_QD2_OUT      MCHP_PINMUX(a, 5, 0x230, 26, periph)
/* pa5_qd3_in */
#define PA5_QD3_IN       MCHP_PINMUX(a, 5, 0x90, 1, periph)
/* pa5_qd3_out */
#define PA5_QD3_OUT      MCHP_PINMUX(a, 5, 0x230, 25, periph)
/* pa5_qsck_out */
#define PA5_QSCK_OUT     MCHP_PINMUX(a, 5, 0x230, 23, periph)
/* pa5_refo1_out */
#define PA5_REFO1_OUT    MCHP_PINMUX(a, 5, 0x230, 19, periph)
/* pa5_refo3_out */
#define PA5_REFO3_OUT    MCHP_PINMUX(a, 5, 0x234, 19, periph)
/* pa5_refo4_out */
#define PA5_REFO4_OUT    MCHP_PINMUX(a, 5, 0x238, 19, periph)
/* pa5_scom0p0_out */
#define PA5_SCOM0P0_OUT  MCHP_PINMUX(a, 5, 0x234, 2, periph)
/* pa5_scom0p1_in */
#define PA5_SCOM0P1_IN   MCHP_PINMUX(a, 5, 0x44, 1, periph)
/* pa5_scom0p1_out */
#define PA5_SCOM0P1_OUT  MCHP_PINMUX(a, 5, 0x230, 3, periph)
/* pa5_scom0p2_in */
#define PA5_SCOM0P2_IN   MCHP_PINMUX(a, 5, 0x48, 8, periph)
/* pa5_scom0p2_out */
#define PA5_SCOM0P2_OUT  MCHP_PINMUX(a, 5, 0x230, 2, periph)
/* pa5_scom0p3_out */
#define PA5_SCOM0P3_OUT  MCHP_PINMUX(a, 5, 0x230, 1, periph)
/* pa5_scom1p0_in */
#define PA5_SCOM1P0_IN   MCHP_PINMUX(a, 5, 0x50, 1, periph)
/* pa5_scom1p0_out */
#define PA5_SCOM1P0_OUT  MCHP_PINMUX(a, 5, 0x230, 4, periph)
/* pa5_scom1p1_in */
#define PA5_SCOM1P1_IN   MCHP_PINMUX(a, 5, 0x54, 8, periph)
/* pa5_scom1p1_out */
#define PA5_SCOM1P1_OUT  MCHP_PINMUX(a, 5, 0x230, 6, periph)
/* pa5_scom1p2_out */
#define PA5_SCOM1P2_OUT  MCHP_PINMUX(a, 5, 0x230, 5, periph)
/* pa5_scom1p3_out */
#define PA5_SCOM1P3_OUT  MCHP_PINMUX(a, 5, 0x234, 6, periph)
/* pa5_scom2p0_in */
#define PA5_SCOM2P0_IN   MCHP_PINMUX(a, 5, 0x60, 8, periph)
/* pa5_scom2p0_out */
#define PA5_SCOM2P0_OUT  MCHP_PINMUX(a, 5, 0x230, 7, periph)
/* pa5_scom2p1_out */
#define PA5_SCOM2P1_OUT  MCHP_PINMUX(a, 5, 0x230, 8, periph)
/* pa5_scom2p2_out */
#define PA5_SCOM2P2_OUT  MCHP_PINMUX(a, 5, 0x234, 7, periph)
/* pa5_scom2p3_in */
#define PA5_SCOM2P3_IN   MCHP_PINMUX(a, 5, 0x6c, 1, periph)
/* pa5_scom2p3_out */
#define PA5_SCOM2P3_OUT  MCHP_PINMUX(a, 5, 0x234, 8, periph)
/* pa5_scom3p0_out */
#define PA5_SCOM3P0_OUT  MCHP_PINMUX(a, 5, 0x230, 9, periph)
/* pa5_scom3p1_out */
#define PA5_SCOM3P1_OUT  MCHP_PINMUX(a, 5, 0x234, 10, periph)
/* pa5_scom3p2_in */
#define PA5_SCOM3P2_IN   MCHP_PINMUX(a, 5, 0x78, 1, periph)
/* pa5_scom3p2_out */
#define PA5_SCOM3P2_OUT  MCHP_PINMUX(a, 5, 0x234, 9, periph)
/* pa5_scom3p3_in */
#define PA5_SCOM3P3_IN   MCHP_PINMUX(a, 5, 0x7c, 8, periph)
/* pa5_scom3p3_out */
#define PA5_SCOM3P3_OUT  MCHP_PINMUX(a, 5, 0x230, 10, periph)
/* pa5_tc0wo0_out */
#define PA5_TC0WO0_OUT   MCHP_PINMUX(a, 5, 0x234, 18, periph)
/* pa5_tc0wo1g3_in */
#define PA5_TC0WO1G3_IN  MCHP_PINMUX(a, 5, 0xb8, 1, periph)
/* pa5_tc0wo1g4_in */
#define PA5_TC0WO1G4_IN  MCHP_PINMUX(a, 5, 0xbc, 8, periph)
/* pa5_tc0wo1_out */
#define PA5_TC0WO1_OUT   MCHP_PINMUX(a, 5, 0x230, 18, periph)
/* pa5_tc1wo0_out */
#define PA5_TC1WO0_OUT   MCHP_PINMUX(a, 5, 0x230, 20, periph)
/* pa5_tc1wo1_out */
#define PA5_TC1WO1_OUT   MCHP_PINMUX(a, 5, 0x238, 20, periph)
/* pa5_tc2wo0g3_in */
#define PA5_TC2WO0G3_IN  MCHP_PINMUX(a, 5, 0xcc, 1, periph)
/* pa5_tc2wo0_out */
#define PA5_TC2WO0_OUT   MCHP_PINMUX(a, 5, 0x230, 21, periph)
/* pa5_tc2wo1g4_in */
#define PA5_TC2WO1G4_IN  MCHP_PINMUX(a, 5, 0xd4, 8, periph)
/* pa5_tc2wo1_out */
#define PA5_TC2WO1_OUT   MCHP_PINMUX(a, 5, 0x238, 21, periph)
/* pa5_tc3wo0g3_in */
#define PA5_TC3WO0G3_IN  MCHP_PINMUX(a, 5, 0xdc, 1, periph)
/* pa5_tc3wo0_out */
#define PA5_TC3WO0_OUT   MCHP_PINMUX(a, 5, 0x230, 22, periph)
/* pa5_tc3wo1g4_in */
#define PA5_TC3WO1G4_IN  MCHP_PINMUX(a, 5, 0xe4, 8, periph)
/* pa5_tc3wo1_out */
#define PA5_TC3WO1_OUT   MCHP_PINMUX(a, 5, 0x238, 22, periph)
/* pa5_tcc0wo0_out */
#define PA5_TCC0WO0_OUT  MCHP_PINMUX(a, 5, 0x230, 11, periph)
/* pa5_tcc0wo1_out */
#define PA5_TCC0WO1_OUT  MCHP_PINMUX(a, 5, 0x238, 12, periph)
/* pa5_tcc0wo2_out */
#define PA5_TCC0WO2_OUT  MCHP_PINMUX(a, 5, 0x230, 13, periph)
/* pa5_tcc0wo3_out */
#define PA5_TCC0WO3_OUT  MCHP_PINMUX(a, 5, 0x238, 11, periph)
/* pa5_tcc0wo4_out */
#define PA5_TCC0WO4_OUT  MCHP_PINMUX(a, 5, 0x230, 12, periph)
/* pa5_tcc0wo5_out */
#define PA5_TCC0WO5_OUT  MCHP_PINMUX(a, 5, 0x238, 13, periph)
/* pa5_tcc1wo0_out */
#define PA5_TCC1WO0_OUT  MCHP_PINMUX(a, 5, 0x230, 14, periph)
/* pa5_tcc1wo1_out */
#define PA5_TCC1WO1_OUT  MCHP_PINMUX(a, 5, 0x238, 15, periph)
/* pa5_tcc1wo2_out */
#define PA5_TCC1WO2_OUT  MCHP_PINMUX(a, 5, 0x230, 16, periph)
/* pa5_tcc1wo3_out */
#define PA5_TCC1WO3_OUT  MCHP_PINMUX(a, 5, 0x238, 14, periph)
/* pa5_tcc1wo4_out */
#define PA5_TCC1WO4_OUT  MCHP_PINMUX(a, 5, 0x230, 15, periph)
/* pa5_tcc1wo5_out */
#define PA5_TCC1WO5_OUT  MCHP_PINMUX(a, 5, 0x238, 16, periph)
/* pa5_tcc2wo0_out */
#define PA5_TCC2WO0_OUT  MCHP_PINMUX(a, 5, 0x230, 17, periph)
/* pa5_tcc2wo1_out */
#define PA5_TCC2WO1_OUT  MCHP_PINMUX(a, 5, 0x238, 17, periph)
/* pa6_cclin0_in */
#define PA6_CCLIN0_IN    MCHP_PINMUX(a, 6, 0x98, 9, periph)
/* pa6_cclin3_in */
#define PA6_CCLIN3_IN    MCHP_PINMUX(a, 6, 0xa4, 9, periph)
/* pa6_cclout0_out */
#define PA6_CCLOUT0_OUT  MCHP_PINMUX(a, 6, 0x23c, 28, periph)
/* pa6_cclout1_out */
#define PA6_CCLOUT1_OUT  MCHP_PINMUX(a, 6, 0x240, 28, periph)
/* pa6_extint0_in */
#define PA6_EXTINT0_IN   MCHP_PINMUX(a, 6, 0x0, 9, periph)
/* pa6_extint3_in */
#define PA6_EXTINT3_IN   MCHP_PINMUX(a, 6, 0xc, 1, periph)
/* pa6_nmi_in */
#define PA6_NMI_IN       MCHP_PINMUX(a, 6, 0x3c, 1, periph)
/* pa6_qcs_out */
#define PA6_QCS_OUT      MCHP_PINMUX(a, 6, 0x23c, 24, periph)
/* pa6_qd0_in */
#define PA6_QD0_IN       MCHP_PINMUX(a, 6, 0x84, 1, periph)
/* pa6_qd0_out */
#define PA6_QD0_OUT      MCHP_PINMUX(a, 6, 0x240, 25, periph)
/* pa6_qd1_in */
#define PA6_QD1_IN       MCHP_PINMUX(a, 6, 0x88, 9, periph)
/* pa6_qd1_out */
#define PA6_QD1_OUT      MCHP_PINMUX(a, 6, 0x23c, 27, periph)
/* pa6_qd2_out */
#define PA6_QD2_OUT      MCHP_PINMUX(a, 6, 0x23c, 26, periph)
/* pa6_qd3_out */
#define PA6_QD3_OUT      MCHP_PINMUX(a, 6, 0x23c, 25, periph)
/* pa6_qsck_in */
#define PA6_QSCK_IN      MCHP_PINMUX(a, 6, 0x80, 9, periph)
/* pa6_qsck_out */
#define PA6_QSCK_OUT     MCHP_PINMUX(a, 6, 0x23c, 23, periph)
/* pa6_refi_in */
#define PA6_REFI_IN      MCHP_PINMUX(a, 6, 0x94, 9, periph)
/* pa6_refo1_out */
#define PA6_REFO1_OUT    MCHP_PINMUX(a, 6, 0x23c, 19, periph)
/* pa6_refo2_out */
#define PA6_REFO2_OUT    MCHP_PINMUX(a, 6, 0x240, 19, periph)
/* pa6_refo4_out */
#define PA6_REFO4_OUT    MCHP_PINMUX(a, 6, 0x244, 19, periph)
/* pa6_scom0p0_out */
#define PA6_SCOM0P0_OUT  MCHP_PINMUX(a, 6, 0x240, 1, periph)
/* pa6_scom0p1_out */
#define PA6_SCOM0P1_OUT  MCHP_PINMUX(a, 6, 0x23c, 3, periph)
/* pa6_scom0p2_in */
#define PA6_SCOM0P2_IN   MCHP_PINMUX(a, 6, 0x48, 1, periph)
/* pa6_scom0p2_out */
#define PA6_SCOM0P2_OUT  MCHP_PINMUX(a, 6, 0x23c, 2, periph)
/* pa6_scom0p3_in */
#define PA6_SCOM0P3_IN   MCHP_PINMUX(a, 6, 0x4c, 9, periph)
/* pa6_scom0p3_out */
#define PA6_SCOM0P3_OUT  MCHP_PINMUX(a, 6, 0x23c, 1, periph)
/* pa6_scom1p0_out */
#define PA6_SCOM1P0_OUT  MCHP_PINMUX(a, 6, 0x23c, 4, periph)
/* pa6_scom1p1_in */
#define PA6_SCOM1P1_IN   MCHP_PINMUX(a, 6, 0x54, 1, periph)
/* pa6_scom1p1_out */
#define PA6_SCOM1P1_OUT  MCHP_PINMUX(a, 6, 0x23c, 6, periph)
/* pa6_scom1p2_in */
#define PA6_SCOM1P2_IN   MCHP_PINMUX(a, 6, 0x58, 9, periph)
/* pa6_scom1p2_out */
#define PA6_SCOM1P2_OUT  MCHP_PINMUX(a, 6, 0x23c, 5, periph)
/* pa6_scom1p3_out */
#define PA6_SCOM1P3_OUT  MCHP_PINMUX(a, 6, 0x240, 5, periph)
/* pa6_scom2p0_in */
#define PA6_SCOM2P0_IN   MCHP_PINMUX(a, 6, 0x60, 1, periph)
/* pa6_scom2p0_out */
#define PA6_SCOM2P0_OUT  MCHP_PINMUX(a, 6, 0x23c, 7, periph)
/* pa6_scom2p1_in */
#define PA6_SCOM2P1_IN   MCHP_PINMUX(a, 6, 0x64, 9, periph)
/* pa6_scom2p1_out */
#define PA6_SCOM2P1_OUT  MCHP_PINMUX(a, 6, 0x23c, 8, periph)
/* pa6_scom2p2_out */
#define PA6_SCOM2P2_OUT  MCHP_PINMUX(a, 6, 0x240, 8, periph)
/* pa6_scom2p3_out */
#define PA6_SCOM2P3_OUT  MCHP_PINMUX(a, 6, 0x244, 7, periph)
/* pa6_scom3p0_in */
#define PA6_SCOM3P0_IN   MCHP_PINMUX(a, 6, 0x70, 9, periph)
/* pa6_scom3p0_out */
#define PA6_SCOM3P0_OUT  MCHP_PINMUX(a, 6, 0x23c, 9, periph)
/* pa6_scom3p1_out */
#define PA6_SCOM3P1_OUT  MCHP_PINMUX(a, 6, 0x240, 9, periph)
/* pa6_scom3p2_out */
#define PA6_SCOM3P2_OUT  MCHP_PINMUX(a, 6, 0x244, 10, periph)
/* pa6_scom3p3_in */
#define PA6_SCOM3P3_IN   MCHP_PINMUX(a, 6, 0x7c, 1, periph)
/* pa6_scom3p3_out */
#define PA6_SCOM3P3_OUT  MCHP_PINMUX(a, 6, 0x23c, 10, periph)
/* pa6_tc0wo0g1_in */
#define PA6_TC0WO0G1_IN  MCHP_PINMUX(a, 6, 0xb0, 9, periph)
/* pa6_tc0wo0_out */
#define PA6_TC0WO0_OUT   MCHP_PINMUX(a, 6, 0x244, 18, periph)
/* pa6_tc0wo1g4_in */
#define PA6_TC0WO1G4_IN  MCHP_PINMUX(a, 6, 0xbc, 1, periph)
/* pa6_tc0wo1_out */
#define PA6_TC0WO1_OUT   MCHP_PINMUX(a, 6, 0x23c, 18, periph)
/* pa6_tc1wo0g1_in */
#define PA6_TC1WO0G1_IN  MCHP_PINMUX(a, 6, 0xc0, 9, periph)
/* pa6_tc1wo0_out */
#define PA6_TC1WO0_OUT   MCHP_PINMUX(a, 6, 0x23c, 20, periph)
/* pa6_tc1wo1_out */
#define PA6_TC1WO1_OUT   MCHP_PINMUX(a, 6, 0x240, 20, periph)
/* pa6_tc2wo0g1_in */
#define PA6_TC2WO0G1_IN  MCHP_PINMUX(a, 6, 0xc8, 9, periph)
/* pa6_tc2wo0_out */
#define PA6_TC2WO0_OUT   MCHP_PINMUX(a, 6, 0x23c, 21, periph)
/* pa6_tc2wo1g4_in */
#define PA6_TC2WO1G4_IN  MCHP_PINMUX(a, 6, 0xd4, 1, periph)
/* pa6_tc2wo1_out */
#define PA6_TC2WO1_OUT   MCHP_PINMUX(a, 6, 0x240, 21, periph)
/* pa6_tc3wo0g1_in */
#define PA6_TC3WO0G1_IN  MCHP_PINMUX(a, 6, 0xd8, 9, periph)
/* pa6_tc3wo0_out */
#define PA6_TC3WO0_OUT   MCHP_PINMUX(a, 6, 0x23c, 22, periph)
/* pa6_tc3wo1g4_in */
#define PA6_TC3WO1G4_IN  MCHP_PINMUX(a, 6, 0xe4, 1, periph)
/* pa6_tc3wo1_out */
#define PA6_TC3WO1_OUT   MCHP_PINMUX(a, 6, 0x240, 22, periph)
/* pa6_tcc0wo0_out */
#define PA6_TCC0WO0_OUT  MCHP_PINMUX(a, 6, 0x23c, 11, periph)
/* pa6_tcc0wo1_out */
#define PA6_TCC0WO1_OUT  MCHP_PINMUX(a, 6, 0x240, 11, periph)
/* pa6_tcc0wo2_out */
#define PA6_TCC0WO2_OUT  MCHP_PINMUX(a, 6, 0x23c, 13, periph)
/* pa6_tcc0wo3_out */
#define PA6_TCC0WO3_OUT  MCHP_PINMUX(a, 6, 0x240, 13, periph)
/* pa6_tcc0wo4_out */
#define PA6_TCC0WO4_OUT  MCHP_PINMUX(a, 6, 0x23c, 12, periph)
/* pa6_tcc0wo5_out */
#define PA6_TCC0WO5_OUT  MCHP_PINMUX(a, 6, 0x240, 12, periph)
/* pa6_tcc1wo0_out */
#define PA6_TCC1WO0_OUT  MCHP_PINMUX(a, 6, 0x23c, 14, periph)
/* pa6_tcc1wo1_out */
#define PA6_TCC1WO1_OUT  MCHP_PINMUX(a, 6, 0x240, 14, periph)
/* pa6_tcc1wo2_out */
#define PA6_TCC1WO2_OUT  MCHP_PINMUX(a, 6, 0x23c, 16, periph)
/* pa6_tcc1wo3_out */
#define PA6_TCC1WO3_OUT  MCHP_PINMUX(a, 6, 0x240, 16, periph)
/* pa6_tcc1wo4_out */
#define PA6_TCC1WO4_OUT  MCHP_PINMUX(a, 6, 0x23c, 15, periph)
/* pa6_tcc1wo5_out */
#define PA6_TCC1WO5_OUT  MCHP_PINMUX(a, 6, 0x240, 15, periph)
/* pa6_tcc2wo0_out */
#define PA6_TCC2WO0_OUT  MCHP_PINMUX(a, 6, 0x23c, 17, periph)
/* pa6_tcc2wo1_out */
#define PA6_TCC2WO1_OUT  MCHP_PINMUX(a, 6, 0x240, 17, periph)
/* pa7_cclin0_in */
#define PA7_CCLIN0_IN    MCHP_PINMUX(a, 7, 0x98, 2, periph)
/* pa7_cclin1_in */
#define PA7_CCLIN1_IN    MCHP_PINMUX(a, 7, 0x9c, 9, periph)
/* pa7_cclin3_in */
#define PA7_CCLIN3_IN    MCHP_PINMUX(a, 7, 0xa4, 2, periph)
/* pa7_cclin4_in */
#define PA7_CCLIN4_IN    MCHP_PINMUX(a, 7, 0xa8, 9, periph)
/* pa7_cclout0_out */
#define PA7_CCLOUT0_OUT  MCHP_PINMUX(a, 7, 0x248, 28, periph)
/* pa7_cclout1_out */
#define PA7_CCLOUT1_OUT  MCHP_PINMUX(a, 7, 0x24c, 28, periph)
/* pa7_extint0_in */
#define PA7_EXTINT0_IN   MCHP_PINMUX(a, 7, 0x0, 2, periph)
/* pa7_extint1_in */
#define PA7_EXTINT1_IN   MCHP_PINMUX(a, 7, 0x4, 9, periph)
/* pa7_qcs_out */
#define PA7_QCS_OUT      MCHP_PINMUX(a, 7, 0x248, 24, periph)
/* pa7_qd0_out */
#define PA7_QD0_OUT      MCHP_PINMUX(a, 7, 0x24c, 25, periph)
/* pa7_qd1_in */
#define PA7_QD1_IN       MCHP_PINMUX(a, 7, 0x88, 2, periph)
/* pa7_qd1_out */
#define PA7_QD1_OUT      MCHP_PINMUX(a, 7, 0x248, 27, periph)
/* pa7_qd2_in */
#define PA7_QD2_IN       MCHP_PINMUX(a, 7, 0x8c, 9, periph)
/* pa7_qd2_out */
#define PA7_QD2_OUT      MCHP_PINMUX(a, 7, 0x248, 26, periph)
/* pa7_qd3_out */
#define PA7_QD3_OUT      MCHP_PINMUX(a, 7, 0x248, 25, periph)
/* pa7_qsck_in */
#define PA7_QSCK_IN      MCHP_PINMUX(a, 7, 0x80, 2, periph)
/* pa7_qsck_out */
#define PA7_QSCK_OUT     MCHP_PINMUX(a, 7, 0x248, 23, periph)
/* pa7_refi_in */
#define PA7_REFI_IN      MCHP_PINMUX(a, 7, 0x94, 2, periph)
/* pa7_refo1_out */
#define PA7_REFO1_OUT    MCHP_PINMUX(a, 7, 0x248, 19, periph)
/* pa7_refo2_out */
#define PA7_REFO2_OUT    MCHP_PINMUX(a, 7, 0x24c, 19, periph)
/* pa7_scom0p0_in */
#define PA7_SCOM0P0_IN   MCHP_PINMUX(a, 7, 0x40, 9, periph)
/* pa7_scom0p0_out */
#define PA7_SCOM0P0_OUT  MCHP_PINMUX(a, 7, 0x24c, 1, periph)
/* pa7_scom0p1_out */
#define PA7_SCOM0P1_OUT  MCHP_PINMUX(a, 7, 0x248, 3, periph)
/* pa7_scom0p2_out */
#define PA7_SCOM0P2_OUT  MCHP_PINMUX(a, 7, 0x248, 2, periph)
/* pa7_scom0p3_in */
#define PA7_SCOM0P3_IN   MCHP_PINMUX(a, 7, 0x4c, 2, periph)
/* pa7_scom0p3_out */
#define PA7_SCOM0P3_OUT  MCHP_PINMUX(a, 7, 0x248, 1, periph)
/* pa7_scom1p0_out */
#define PA7_SCOM1P0_OUT  MCHP_PINMUX(a, 7, 0x248, 4, periph)
/* pa7_scom1p1_out */
#define PA7_SCOM1P1_OUT  MCHP_PINMUX(a, 7, 0x248, 6, periph)
/* pa7_scom1p2_in */
#define PA7_SCOM1P2_IN   MCHP_PINMUX(a, 7, 0x58, 2, periph)
/* pa7_scom1p2_out */
#define PA7_SCOM1P2_OUT  MCHP_PINMUX(a, 7, 0x248, 5, periph)
/* pa7_scom1p3_in */
#define PA7_SCOM1P3_IN   MCHP_PINMUX(a, 7, 0x5c, 9, periph)
/* pa7_scom1p3_out */
#define PA7_SCOM1P3_OUT  MCHP_PINMUX(a, 7, 0x24c, 5, periph)
/* pa7_scom2p0_out */
#define PA7_SCOM2P0_OUT  MCHP_PINMUX(a, 7, 0x248, 7, periph)
/* pa7_scom2p1_in */
#define PA7_SCOM2P1_IN   MCHP_PINMUX(a, 7, 0x64, 2, periph)
/* pa7_scom2p1_out */
#define PA7_SCOM2P1_OUT  MCHP_PINMUX(a, 7, 0x248, 8, periph)
/* pa7_scom2p2_in */
#define PA7_SCOM2P2_IN   MCHP_PINMUX(a, 7, 0x68, 9, periph)
/* pa7_scom2p2_out */
#define PA7_SCOM2P2_OUT  MCHP_PINMUX(a, 7, 0x24c, 8, periph)
/* pa7_scom3p0_in */
#define PA7_SCOM3P0_IN   MCHP_PINMUX(a, 7, 0x70, 2, periph)
/* pa7_scom3p0_out */
#define PA7_SCOM3P0_OUT  MCHP_PINMUX(a, 7, 0x248, 9, periph)
/* pa7_scom3p1_in */
#define PA7_SCOM3P1_IN   MCHP_PINMUX(a, 7, 0x74, 9, periph)
/* pa7_scom3p1_out */
#define PA7_SCOM3P1_OUT  MCHP_PINMUX(a, 7, 0x24c, 9, periph)
/* pa7_scom3p3_out */
#define PA7_SCOM3P3_OUT  MCHP_PINMUX(a, 7, 0x248, 10, periph)
/* pa7_tc0wo0g1_in */
#define PA7_TC0WO0G1_IN  MCHP_PINMUX(a, 7, 0xb0, 2, periph)
/* pa7_tc0wo0g2_in */
#define PA7_TC0WO0G2_IN  MCHP_PINMUX(a, 7, 0xb4, 9, periph)
/* pa7_tc0wo1_out */
#define PA7_TC0WO1_OUT   MCHP_PINMUX(a, 7, 0x248, 18, periph)
/* pa7_tc1wo0g1_in */
#define PA7_TC1WO0G1_IN  MCHP_PINMUX(a, 7, 0xc0, 2, periph)
/* pa7_tc1wo0_out */
#define PA7_TC1WO0_OUT   MCHP_PINMUX(a, 7, 0x248, 20, periph)
/* pa7_tc1wo1g2_in */
#define PA7_TC1WO1G2_IN  MCHP_PINMUX(a, 7, 0xc4, 9, periph)
/* pa7_tc1wo1_out */
#define PA7_TC1WO1_OUT   MCHP_PINMUX(a, 7, 0x24c, 20, periph)
/* pa7_tc2wo0g1_in */
#define PA7_TC2WO0G1_IN  MCHP_PINMUX(a, 7, 0xc8, 2, periph)
/* pa7_tc2wo0_out */
#define PA7_TC2WO0_OUT   MCHP_PINMUX(a, 7, 0x248, 21, periph)
/* pa7_tc2wo1g2_in */
#define PA7_TC2WO1G2_IN  MCHP_PINMUX(a, 7, 0xd0, 9, periph)
/* pa7_tc2wo1_out */
#define PA7_TC2WO1_OUT   MCHP_PINMUX(a, 7, 0x24c, 21, periph)
/* pa7_tc3wo0g1_in */
#define PA7_TC3WO0G1_IN  MCHP_PINMUX(a, 7, 0xd8, 2, periph)
/* pa7_tc3wo0_out */
#define PA7_TC3WO0_OUT   MCHP_PINMUX(a, 7, 0x248, 22, periph)
/* pa7_tc3wo1g2_in */
#define PA7_TC3WO1G2_IN  MCHP_PINMUX(a, 7, 0xe0, 9, periph)
/* pa7_tc3wo1_out */
#define PA7_TC3WO1_OUT   MCHP_PINMUX(a, 7, 0x24c, 22, periph)
/* pa7_tcc0wo0_out */
#define PA7_TCC0WO0_OUT  MCHP_PINMUX(a, 7, 0x248, 11, periph)
/* pa7_tcc0wo1_out */
#define PA7_TCC0WO1_OUT  MCHP_PINMUX(a, 7, 0x24c, 11, periph)
/* pa7_tcc0wo2_out */
#define PA7_TCC0WO2_OUT  MCHP_PINMUX(a, 7, 0x248, 13, periph)
/* pa7_tcc0wo3_out */
#define PA7_TCC0WO3_OUT  MCHP_PINMUX(a, 7, 0x24c, 13, periph)
/* pa7_tcc0wo4_out */
#define PA7_TCC0WO4_OUT  MCHP_PINMUX(a, 7, 0x248, 12, periph)
/* pa7_tcc0wo5_out */
#define PA7_TCC0WO5_OUT  MCHP_PINMUX(a, 7, 0x24c, 12, periph)
/* pa7_tcc1wo0_out */
#define PA7_TCC1WO0_OUT  MCHP_PINMUX(a, 7, 0x248, 14, periph)
/* pa7_tcc1wo1_out */
#define PA7_TCC1WO1_OUT  MCHP_PINMUX(a, 7, 0x24c, 14, periph)
/* pa7_tcc1wo2_out */
#define PA7_TCC1WO2_OUT  MCHP_PINMUX(a, 7, 0x248, 16, periph)
/* pa7_tcc1wo3_out */
#define PA7_TCC1WO3_OUT  MCHP_PINMUX(a, 7, 0x24c, 16, periph)
/* pa7_tcc1wo4_out */
#define PA7_TCC1WO4_OUT  MCHP_PINMUX(a, 7, 0x248, 15, periph)
/* pa7_tcc1wo5_out */
#define PA7_TCC1WO5_OUT  MCHP_PINMUX(a, 7, 0x24c, 15, periph)
/* pa7_tcc2wo0_out */
#define PA7_TCC2WO0_OUT  MCHP_PINMUX(a, 7, 0x248, 17, periph)
/* pa7_tcc2wo1_out */
#define PA7_TCC2WO1_OUT  MCHP_PINMUX(a, 7, 0x24c, 17, periph)
/* pa8_cclin1_in */
#define PA8_CCLIN1_IN    MCHP_PINMUX(a, 8, 0x9c, 2, periph)
/* pa8_cclin2_in */
#define PA8_CCLIN2_IN    MCHP_PINMUX(a, 8, 0xa0, 9, periph)
/* pa8_cclin4_in */
#define PA8_CCLIN4_IN    MCHP_PINMUX(a, 8, 0xa8, 2, periph)
/* pa8_cclin5_in */
#define PA8_CCLIN5_IN    MCHP_PINMUX(a, 8, 0xac, 9, periph)
/* pa8_cclout0_out */
#define PA8_CCLOUT0_OUT  MCHP_PINMUX(a, 8, 0x254, 28, periph)
/* pa8_cclout1_out */
#define PA8_CCLOUT1_OUT  MCHP_PINMUX(a, 8, 0x250, 28, periph)
/* pa8_extint1_in */
#define PA8_EXTINT1_IN   MCHP_PINMUX(a, 8, 0x4, 2, periph)
/* pa8_extint2_in */
#define PA8_EXTINT2_IN   MCHP_PINMUX(a, 8, 0x8, 9, periph)
/* pa8_extint3_in */
#define PA8_EXTINT3_IN   MCHP_PINMUX(a, 8, 0xc, 14, periph)
/* pa8_nmi_in */
#define PA8_NMI_IN       MCHP_PINMUX(a, 8, 0x3c, 14, periph)
/* pa8_qcs_out */
#define PA8_QCS_OUT      MCHP_PINMUX(a, 8, 0x250, 24, periph)
/* pa8_qd0_in */
#define PA8_QD0_IN       MCHP_PINMUX(a, 8, 0x84, 14, periph)
/* pa8_qd0_out */
