zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz25/pic32cx1012bz25048-pinctrl.h
#define PA13_REFO4_OUT   MCHP_PINMUX(a, 13, 0x27c, 19, periph)
/* pa13_scom0p0_out */
#define PA13_SCOM0P0_OUT MCHP_PINMUX(a, 13, 0x278, 2, periph)
/* pa13_scom0p1_in */
#define PA13_SCOM0P1_IN  MCHP_PINMUX(a, 13, 0x44, 3, periph)
/* pa13_scom0p1_out */
#define PA13_SCOM0P1_OUT MCHP_PINMUX(a, 13, 0x278, 1, periph)
/* pa13_scom0p2_in */
#define PA13_SCOM0P2_IN  MCHP_PINMUX(a, 13, 0x48, 10, periph)
/* pa13_scom0p2_out */
#define PA13_SCOM0P2_OUT MCHP_PINMUX(a, 13, 0x27c, 1, periph)
/* pa13_scom0p3_out */
#define PA13_SCOM0P3_OUT MCHP_PINMUX(a, 13, 0x278, 3, periph)
/* pa13_scom1p0_in */
#define PA13_SCOM1P0_IN  MCHP_PINMUX(a, 13, 0x50, 3, periph)
/* pa13_scom1p0_out */
#define PA13_SCOM1P0_OUT MCHP_PINMUX(a, 13, 0x278, 5, periph)
/* pa13_scom1p1_in */
#define PA13_SCOM1P1_IN  MCHP_PINMUX(a, 13, 0x54, 10, periph)
/* pa13_scom1p1_out */
#define PA13_SCOM1P1_OUT MCHP_PINMUX(a, 13, 0x27c, 5, periph)
/* pa13_scom1p2_out */
#define PA13_SCOM1P2_OUT MCHP_PINMUX(a, 13, 0x278, 4, periph)
/* pa13_scom1p3_out */
#define PA13_SCOM1P3_OUT MCHP_PINMUX(a, 13, 0x278, 6, periph)
/* pa13_scom2p0_in */
#define PA13_SCOM2P0_IN  MCHP_PINMUX(a, 13, 0x60, 10, periph)
/* pa13_scom2p0_out */
#define PA13_SCOM2P0_OUT MCHP_PINMUX(a, 13, 0x27c, 8, periph)
/* pa13_scom2p2_out */
#define PA13_SCOM2P2_OUT MCHP_PINMUX(a, 13, 0x278, 7, periph)
/* pa13_scom2p3_in */
#define PA13_SCOM2P3_IN  MCHP_PINMUX(a, 13, 0x6c, 3, periph)
/* pa13_scom2p3_out */
#define PA13_SCOM2P3_OUT MCHP_PINMUX(a, 13, 0x278, 8, periph)
/* pa13_scom3p1_out */
#define PA13_SCOM3P1_OUT MCHP_PINMUX(a, 13, 0x278, 10, periph)
/* pa13_scom3p2_in */
#define PA13_SCOM3P2_IN  MCHP_PINMUX(a, 13, 0x78, 3, periph)
/* pa13_scom3p2_out */
#define PA13_SCOM3P2_OUT MCHP_PINMUX(a, 13, 0x278, 9, periph)
/* pa13_scom3p3_in */
#define PA13_SCOM3P3_IN  MCHP_PINMUX(a, 13, 0x7c, 10, periph)
/* pa13_scom3p3_out */
#define PA13_SCOM3P3_OUT MCHP_PINMUX(a, 13, 0x27c, 9, periph)
/* pa13_tc0wo0_out */
#define PA13_TC0WO0_OUT  MCHP_PINMUX(a, 13, 0x278, 18, periph)
/* pa13_tc0wo1g3_in */
#define PA13_TC0WO1G3_IN MCHP_PINMUX(a, 13, 0xb8, 3, periph)
/* pa13_tc0wo1g4_in */
#define PA13_TC0WO1G4_IN MCHP_PINMUX(a, 13, 0xbc, 10, periph)
/* pa13_tc1wo0_out */
#define PA13_TC1WO0_OUT  MCHP_PINMUX(a, 13, 0x278, 20, periph)
/* pa13_tc1wo1_out */
#define PA13_TC1WO1_OUT  MCHP_PINMUX(a, 13, 0x27c, 20, periph)
/* pa13_tc2wo0g3_in */
#define PA13_TC2WO0G3_IN MCHP_PINMUX(a, 13, 0xcc, 3, periph)
/* pa13_tc2wo0_out */
#define PA13_TC2WO0_OUT  MCHP_PINMUX(a, 13, 0x278, 21, periph)
/* pa13_tc2wo1g4_in */
#define PA13_TC2WO1G4_IN MCHP_PINMUX(a, 13, 0xd4, 10, periph)
/* pa13_tc2wo1_out */
#define PA13_TC2WO1_OUT  MCHP_PINMUX(a, 13, 0x27c, 21, periph)
/* pa13_tc3wo0g3_in */
#define PA13_TC3WO0G3_IN MCHP_PINMUX(a, 13, 0xdc, 3, periph)
/* pa13_tc3wo0_out */
#define PA13_TC3WO0_OUT  MCHP_PINMUX(a, 13, 0x278, 22, periph)
/* pa13_tc3wo1g4_in */
#define PA13_TC3WO1G4_IN MCHP_PINMUX(a, 13, 0xe4, 10, periph)
/* pa13_tc3wo1_out */
#define PA13_TC3WO1_OUT  MCHP_PINMUX(a, 13, 0x27c, 22, periph)
/* pa13_tcc0wo0_out */
#define PA13_TCC0WO0_OUT MCHP_PINMUX(a, 13, 0x278, 12, periph)
/* pa13_tcc0wo1_out */
#define PA13_TCC0WO1_OUT MCHP_PINMUX(a, 13, 0x27c, 12, periph)
/* pa13_tcc0wo2_out */
#define PA13_TCC0WO2_OUT MCHP_PINMUX(a, 13, 0x278, 11, periph)
/* pa13_tcc0wo3_out */
#define PA13_TCC0WO3_OUT MCHP_PINMUX(a, 13, 0x27c, 11, periph)
/* pa13_tcc0wo4_out */
#define PA13_TCC0WO4_OUT MCHP_PINMUX(a, 13, 0x278, 13, periph)
/* pa13_tcc0wo5_out */
#define PA13_TCC0WO5_OUT MCHP_PINMUX(a, 13, 0x27c, 13, periph)
/* pa13_tcc1wo0_out */
#define PA13_TCC1WO0_OUT MCHP_PINMUX(a, 13, 0x278, 15, periph)
/* pa13_tcc1wo1_out */
#define PA13_TCC1WO1_OUT MCHP_PINMUX(a, 13, 0x27c, 15, periph)
/* pa13_tcc1wo2_out */
#define PA13_TCC1WO2_OUT MCHP_PINMUX(a, 13, 0x278, 14, periph)
/* pa13_tcc1wo3_out */
#define PA13_TCC1WO3_OUT MCHP_PINMUX(a, 13, 0x27c, 14, periph)
/* pa13_tcc1wo4_out */
#define PA13_TCC1WO4_OUT MCHP_PINMUX(a, 13, 0x278, 16, periph)
/* pa13_tcc1wo5_out */
#define PA13_TCC1WO5_OUT MCHP_PINMUX(a, 13, 0x27c, 16, periph)
/* pa13_tcc2wo0_out */
#define PA13_TCC2WO0_OUT MCHP_PINMUX(a, 13, 0x278, 17, periph)
/* pa13_tcc2wo1_out */
#define PA13_TCC2WO1_OUT MCHP_PINMUX(a, 13, 0x27c, 17, periph)
/* pa14_cclin0_in */
#define PA14_CCLIN0_IN   MCHP_PINMUX(a, 14, 0x98, 11, periph)
/* pa14_cclin3_in */
#define PA14_CCLIN3_IN   MCHP_PINMUX(a, 14, 0xa4, 11, periph)
/* pa14_cclout0_out */
#define PA14_CCLOUT0_OUT MCHP_PINMUX(a, 14, 0x280, 28, periph)
/* pa14_cclout1_out */
#define PA14_CCLOUT1_OUT MCHP_PINMUX(a, 14, 0x284, 28, periph)
/* pa14_extint0_in */
#define PA14_EXTINT0_IN  MCHP_PINMUX(a, 14, 0x0, 11, periph)
/* pa14_extint3_in */
#define PA14_EXTINT3_IN  MCHP_PINMUX(a, 14, 0xc, 3, periph)
/* pa14_nmi_in */
#define PA14_NMI_IN      MCHP_PINMUX(a, 14, 0x3c, 3, periph)
/* pa14_qcs_out */
#define PA14_QCS_OUT     MCHP_PINMUX(a, 14, 0x280, 24, periph)
/* pa14_qd0_in */
#define PA14_QD0_IN      MCHP_PINMUX(a, 14, 0x84, 3, periph)
/* pa14_qd0_out */
#define PA14_QD0_OUT     MCHP_PINMUX(a, 14, 0x284, 27, periph)
/* pa14_qd1_in */
#define PA14_QD1_IN      MCHP_PINMUX(a, 14, 0x88, 11, periph)
/* pa14_qd1_out */
#define PA14_QD1_OUT     MCHP_PINMUX(a, 14, 0x280, 27, periph)
/* pa14_qd2_out */
#define PA14_QD2_OUT     MCHP_PINMUX(a, 14, 0x280, 26, periph)
/* pa14_qd3_out */
#define PA14_QD3_OUT     MCHP_PINMUX(a, 14, 0x280, 25, periph)
/* pa14_qsck_in */
#define PA14_QSCK_IN     MCHP_PINMUX(a, 14, 0x80, 11, periph)
/* pa14_qsck_out */
#define PA14_QSCK_OUT    MCHP_PINMUX(a, 14, 0x280, 23, periph)
/* pa14_refi_in */
#define PA14_REFI_IN     MCHP_PINMUX(a, 14, 0x94, 11, periph)
/* pa14_refo1_out */
#define PA14_REFO1_OUT   MCHP_PINMUX(a, 14, 0x280, 19, periph)
/* pa14_refo4_out */
#define PA14_REFO4_OUT   MCHP_PINMUX(a, 14, 0x284, 19, periph)
/* pa14_scom0p0_out */
#define PA14_SCOM0P0_OUT MCHP_PINMUX(a, 14, 0x284, 3, periph)
/* pa14_scom0p1_out */
#define PA14_SCOM0P1_OUT MCHP_PINMUX(a, 14, 0x280, 3, periph)
/* pa14_scom0p2_in */
#define PA14_SCOM0P2_IN  MCHP_PINMUX(a, 14, 0x48, 3, periph)
/* pa14_scom0p2_out */
#define PA14_SCOM0P2_OUT MCHP_PINMUX(a, 14, 0x280, 2, periph)
/* pa14_scom0p3_in */
#define PA14_SCOM0P3_IN  MCHP_PINMUX(a, 14, 0x4c, 11, periph)
/* pa14_scom0p3_out */
#define PA14_SCOM0P3_OUT MCHP_PINMUX(a, 14, 0x280, 1, periph)
/* pa14_scom1p0_out */
#define PA14_SCOM1P0_OUT MCHP_PINMUX(a, 14, 0x280, 4, periph)
/* pa14_scom1p1_in */
#define PA14_SCOM1P1_IN  MCHP_PINMUX(a, 14, 0x54, 3, periph)
/* pa14_scom1p1_out */
#define PA14_SCOM1P1_OUT MCHP_PINMUX(a, 14, 0x280, 6, periph)
/* pa14_scom1p2_in */
#define PA14_SCOM1P2_IN  MCHP_PINMUX(a, 14, 0x58, 11, periph)
/* pa14_scom1p2_out */
#define PA14_SCOM1P2_OUT MCHP_PINMUX(a, 14, 0x280, 5, periph)
/* pa14_scom1p3_out */
#define PA14_SCOM1P3_OUT MCHP_PINMUX(a, 14, 0x284, 4, periph)
/* pa14_scom2p0_in */
#define PA14_SCOM2P0_IN  MCHP_PINMUX(a, 14, 0x60, 3, periph)
/* pa14_scom2p0_out */
#define PA14_SCOM2P0_OUT MCHP_PINMUX(a, 14, 0x280, 7, periph)
/* pa14_scom2p1_in */
#define PA14_SCOM2P1_IN  MCHP_PINMUX(a, 14, 0x64, 11, periph)
/* pa14_scom2p1_out */
#define PA14_SCOM2P1_OUT MCHP_PINMUX(a, 14, 0x280, 8, periph)
/* pa14_scom2p3_out */
#define PA14_SCOM2P3_OUT MCHP_PINMUX(a, 14, 0x284, 7, periph)
/* pa14_scom3p0_in */
#define PA14_SCOM3P0_IN  MCHP_PINMUX(a, 14, 0x70, 11, periph)
/* pa14_scom3p0_out */
#define PA14_SCOM3P0_OUT MCHP_PINMUX(a, 14, 0x280, 9, periph)
/* pa14_scom3p2_out */
#define PA14_SCOM3P2_OUT MCHP_PINMUX(a, 14, 0x284, 10, periph)
/* pa14_scom3p3_in */
#define PA14_SCOM3P3_IN  MCHP_PINMUX(a, 14, 0x7c, 3, periph)
/* pa14_scom3p3_out */
#define PA14_SCOM3P3_OUT MCHP_PINMUX(a, 14, 0x280, 10, periph)
/* pa14_tc0wo0g1_in */
#define PA14_TC0WO0G1_IN MCHP_PINMUX(a, 14, 0xb0, 11, periph)
/* pa14_tc0wo0_out */
#define PA14_TC0WO0_OUT  MCHP_PINMUX(a, 14, 0x284, 18, periph)
/* pa14_tc0wo1g4_in */
#define PA14_TC0WO1G4_IN MCHP_PINMUX(a, 14, 0xbc, 3, periph)
/* pa14_tc0wo1_out */
#define PA14_TC0WO1_OUT  MCHP_PINMUX(a, 14, 0x280, 18, periph)
/* pa14_tc1wo0g1_in */
#define PA14_TC1WO0G1_IN MCHP_PINMUX(a, 14, 0xc0, 11, periph)
/* pa14_tc1wo0_out */
#define PA14_TC1WO0_OUT  MCHP_PINMUX(a, 14, 0x280, 20, periph)
/* pa14_tc1wo1_out */
#define PA14_TC1WO1_OUT  MCHP_PINMUX(a, 14, 0x284, 20, periph)
/* pa14_tc2wo0g1_in */
#define PA14_TC2WO0G1_IN MCHP_PINMUX(a, 14, 0xc8, 11, periph)
/* pa14_tc2wo0_out */
#define PA14_TC2WO0_OUT  MCHP_PINMUX(a, 14, 0x280, 21, periph)
/* pa14_tc2wo1g4_in */
#define PA14_TC2WO1G4_IN MCHP_PINMUX(a, 14, 0xd4, 3, periph)
/* pa14_tc2wo1_out */
#define PA14_TC2WO1_OUT  MCHP_PINMUX(a, 14, 0x284, 21, periph)
/* pa14_tc3wo0g1_in */
#define PA14_TC3WO0G1_IN MCHP_PINMUX(a, 14, 0xd8, 11, periph)
/* pa14_tc3wo0_out */
#define PA14_TC3WO0_OUT  MCHP_PINMUX(a, 14, 0x280, 22, periph)
/* pa14_tc3wo1g4_in */
#define PA14_TC3WO1G4_IN MCHP_PINMUX(a, 14, 0xe4, 3, periph)
/* pa14_tc3wo1_out */
#define PA14_TC3WO1_OUT  MCHP_PINMUX(a, 14, 0x284, 22, periph)
/* pa14_tcc0wo0_out */
#define PA14_TCC0WO0_OUT MCHP_PINMUX(a, 14, 0x280, 11, periph)
/* pa14_tcc0wo1_out */
#define PA14_TCC0WO1_OUT MCHP_PINMUX(a, 14, 0x284, 12, periph)
/* pa14_tcc0wo2_out */
#define PA14_TCC0WO2_OUT MCHP_PINMUX(a, 14, 0x280, 13, periph)
/* pa14_tcc0wo3_out */
#define PA14_TCC0WO3_OUT MCHP_PINMUX(a, 14, 0x284, 11, periph)
/* pa14_tcc0wo4_out */
#define PA14_TCC0WO4_OUT MCHP_PINMUX(a, 14, 0x280, 12, periph)
/* pa14_tcc0wo5_out */
#define PA14_TCC0WO5_OUT MCHP_PINMUX(a, 14, 0x284, 13, periph)
/* pa14_tcc1wo0_out */
#define PA14_TCC1WO0_OUT MCHP_PINMUX(a, 14, 0x280, 14, periph)
/* pa14_tcc1wo1_out */
#define PA14_TCC1WO1_OUT MCHP_PINMUX(a, 14, 0x284, 15, periph)
/* pa14_tcc1wo2_out */
#define PA14_TCC1WO2_OUT MCHP_PINMUX(a, 14, 0x280, 16, periph)
/* pa14_tcc1wo3_out */
#define PA14_TCC1WO3_OUT MCHP_PINMUX(a, 14, 0x284, 14, periph)
/* pa14_tcc1wo4_out */
#define PA14_TCC1WO4_OUT MCHP_PINMUX(a, 14, 0x280, 15, periph)
/* pa14_tcc1wo5_out */
#define PA14_TCC1WO5_OUT MCHP_PINMUX(a, 14, 0x284, 16, periph)
/* pa14_tcc2wo0_out */
#define PA14_TCC2WO0_OUT MCHP_PINMUX(a, 14, 0x280, 17, periph)
/* pa14_tcc2wo1_out */
#define PA14_TCC2WO1_OUT MCHP_PINMUX(a, 14, 0x284, 17, periph)
/* pb0_cclin0_in */
#define PB0_CCLIN0_IN    MCHP_PINMUX(b, 0, 0x98, 4, periph)
/* pb0_cclin1_in */
#define PB0_CCLIN1_IN    MCHP_PINMUX(b, 0, 0x9c, 11, periph)
/* pb0_cclin3_in */
#define PB0_CCLIN3_IN    MCHP_PINMUX(b, 0, 0xa4, 4, periph)
/* pb0_cclin4_in */
#define PB0_CCLIN4_IN    MCHP_PINMUX(b, 0, 0xa8, 11, periph)
/* pb0_cclout0_out */
#define PB0_CCLOUT0_OUT  MCHP_PINMUX(b, 0, 0x28c, 28, periph)
/* pb0_cclout1_out */
#define PB0_CCLOUT1_OUT  MCHP_PINMUX(b, 0, 0x290, 28, periph)
/* pb0_extint0_in */
#define PB0_EXTINT0_IN   MCHP_PINMUX(b, 0, 0x0, 4, periph)
/* pb0_extint1_in */
#define PB0_EXTINT1_IN   MCHP_PINMUX(b, 0, 0x4, 11, periph)
/* pb0_qcs_out */
#define PB0_QCS_OUT      MCHP_PINMUX(b, 0, 0x28c, 24, periph)
/* pb0_qd0_out */
#define PB0_QD0_OUT      MCHP_PINMUX(b, 0, 0x290, 25, periph)
/* pb0_qd1_in */
#define PB0_QD1_IN       MCHP_PINMUX(b, 0, 0x88, 4, periph)
/* pb0_qd1_out */
#define PB0_QD1_OUT      MCHP_PINMUX(b, 0, 0x28c, 27, periph)
/* pb0_qd2_in */
#define PB0_QD2_IN       MCHP_PINMUX(b, 0, 0x8c, 11, periph)
/* pb0_qd2_out */
#define PB0_QD2_OUT      MCHP_PINMUX(b, 0, 0x28c, 26, periph)
/* pb0_qd3_out */
#define PB0_QD3_OUT      MCHP_PINMUX(b, 0, 0x28c, 25, periph)
/* pb0_qsck_in */
#define PB0_QSCK_IN      MCHP_PINMUX(b, 0, 0x80, 4, periph)
/* pb0_qsck_out */
#define PB0_QSCK_OUT     MCHP_PINMUX(b, 0, 0x28c, 23, periph)
/* pb0_refi_in */
#define PB0_REFI_IN      MCHP_PINMUX(b, 0, 0x94, 4, periph)
/* pb0_refo1_out */
#define PB0_REFO1_OUT    MCHP_PINMUX(b, 0, 0x28c, 19, periph)
/* pb0_refo2_out */
#define PB0_REFO2_OUT    MCHP_PINMUX(b, 0, 0x290, 19, periph)
/* pb0_scom0p0_in */
#define PB0_SCOM0P0_IN   MCHP_PINMUX(b, 0, 0x40, 11, periph)
/* pb0_scom0p0_out */
#define PB0_SCOM0P0_OUT  MCHP_PINMUX(b, 0, 0x290, 1, periph)
/* pb0_scom0p1_out */
#define PB0_SCOM0P1_OUT  MCHP_PINMUX(b, 0, 0x28c, 3, periph)
/* pb0_scom0p2_out */
#define PB0_SCOM0P2_OUT  MCHP_PINMUX(b, 0, 0x28c, 2, periph)
/* pb0_scom0p3_in */
#define PB0_SCOM0P3_IN   MCHP_PINMUX(b, 0, 0x4c, 4, periph)
/* pb0_scom0p3_out */
#define PB0_SCOM0P3_OUT  MCHP_PINMUX(b, 0, 0x28c, 1, periph)
/* pb0_scom1p0_out */
#define PB0_SCOM1P0_OUT  MCHP_PINMUX(b, 0, 0x28c, 4, periph)
/* pb0_scom1p1_out */
#define PB0_SCOM1P1_OUT  MCHP_PINMUX(b, 0, 0x28c, 6, periph)
/* pb0_scom1p2_in */
#define PB0_SCOM1P2_IN   MCHP_PINMUX(b, 0, 0x58, 4, periph)
/* pb0_scom1p2_out */
#define PB0_SCOM1P2_OUT  MCHP_PINMUX(b, 0, 0x28c, 5, periph)
/* pb0_scom1p3_in */
#define PB0_SCOM1P3_IN   MCHP_PINMUX(b, 0, 0x5c, 11, periph)
/* pb0_scom1p3_out */
#define PB0_SCOM1P3_OUT  MCHP_PINMUX(b, 0, 0x290, 5, periph)
/* pb0_scom2p0_out */
#define PB0_SCOM2P0_OUT  MCHP_PINMUX(b, 0, 0x28c, 7, periph)
/* pb0_scom2p1_in */
#define PB0_SCOM2P1_IN   MCHP_PINMUX(b, 0, 0x64, 4, periph)
/* pb0_scom2p1_out */
#define PB0_SCOM2P1_OUT  MCHP_PINMUX(b, 0, 0x28c, 8, periph)
/* pb0_scom2p2_in */
#define PB0_SCOM2P2_IN   MCHP_PINMUX(b, 0, 0x68, 11, periph)
/* pb0_scom2p2_out */
#define PB0_SCOM2P2_OUT  MCHP_PINMUX(b, 0, 0x290, 8, periph)
/* pb0_scom3p0_in */
#define PB0_SCOM3P0_IN   MCHP_PINMUX(b, 0, 0x70, 4, periph)
/* pb0_scom3p0_out */
#define PB0_SCOM3P0_OUT  MCHP_PINMUX(b, 0, 0x28c, 9, periph)
/* pb0_scom3p1_in */
#define PB0_SCOM3P1_IN   MCHP_PINMUX(b, 0, 0x74, 11, periph)
/* pb0_scom3p1_out */
#define PB0_SCOM3P1_OUT  MCHP_PINMUX(b, 0, 0x290, 9, periph)
/* pb0_scom3p3_out */
#define PB0_SCOM3P3_OUT  MCHP_PINMUX(b, 0, 0x28c, 10, periph)
/* pb0_tc0wo0g1_in */
#define PB0_TC0WO0G1_IN  MCHP_PINMUX(b, 0, 0xb0, 4, periph)
/* pb0_tc0wo0g2_in */
#define PB0_TC0WO0G2_IN  MCHP_PINMUX(b, 0, 0xb4, 11, periph)
/* pb0_tc0wo1_out */
#define PB0_TC0WO1_OUT   MCHP_PINMUX(b, 0, 0x28c, 18, periph)
/* pb0_tc1wo0g1_in */
#define PB0_TC1WO0G1_IN  MCHP_PINMUX(b, 0, 0xc0, 4, periph)
/* pb0_tc1wo0_out */
#define PB0_TC1WO0_OUT   MCHP_PINMUX(b, 0, 0x28c, 20, periph)
/* pb0_tc1wo1g2_in */
#define PB0_TC1WO1G2_IN  MCHP_PINMUX(b, 0, 0xc4, 11, periph)
/* pb0_tc1wo1_out */
#define PB0_TC1WO1_OUT   MCHP_PINMUX(b, 0, 0x290, 20, periph)
/* pb0_tc2wo0g1_in */
#define PB0_TC2WO0G1_IN  MCHP_PINMUX(b, 0, 0xc8, 4, periph)
/* pb0_tc2wo0_out */
#define PB0_TC2WO0_OUT   MCHP_PINMUX(b, 0, 0x28c, 21, periph)
/* pb0_tc2wo1g2_in */
#define PB0_TC2WO1G2_IN  MCHP_PINMUX(b, 0, 0xd0, 11, periph)
/* pb0_tc2wo1_out */
#define PB0_TC2WO1_OUT   MCHP_PINMUX(b, 0, 0x290, 21, periph)
/* pb0_tc3wo0g1_in */
#define PB0_TC3WO0G1_IN  MCHP_PINMUX(b, 0, 0xd8, 4, periph)
/* pb0_tc3wo0_out */
#define PB0_TC3WO0_OUT   MCHP_PINMUX(b, 0, 0x28c, 22, periph)
/* pb0_tc3wo1g2_in */
#define PB0_TC3WO1G2_IN  MCHP_PINMUX(b, 0, 0xe0, 11, periph)
/* pb0_tc3wo1_out */
#define PB0_TC3WO1_OUT   MCHP_PINMUX(b, 0, 0x290, 22, periph)
/* pb0_tcc0wo0_out */
#define PB0_TCC0WO0_OUT  MCHP_PINMUX(b, 0, 0x28c, 11, periph)
/* pb0_tcc0wo1_out */
#define PB0_TCC0WO1_OUT  MCHP_PINMUX(b, 0, 0x290, 11, periph)
/* pb0_tcc0wo2_out */
#define PB0_TCC0WO2_OUT  MCHP_PINMUX(b, 0, 0x28c, 13, periph)
/* pb0_tcc0wo3_out */
#define PB0_TCC0WO3_OUT  MCHP_PINMUX(b, 0, 0x290, 13, periph)
/* pb0_tcc0wo4_out */
#define PB0_TCC0WO4_OUT  MCHP_PINMUX(b, 0, 0x28c, 12, periph)
/* pb0_tcc0wo5_out */
#define PB0_TCC0WO5_OUT  MCHP_PINMUX(b, 0, 0x290, 12, periph)
/* pb0_tcc1wo0_out */
#define PB0_TCC1WO0_OUT  MCHP_PINMUX(b, 0, 0x28c, 14, periph)
/* pb0_tcc1wo1_out */
#define PB0_TCC1WO1_OUT  MCHP_PINMUX(b, 0, 0x290, 14, periph)
/* pb0_tcc1wo2_out */
#define PB0_TCC1WO2_OUT  MCHP_PINMUX(b, 0, 0x28c, 16, periph)
/* pb0_tcc1wo3_out */
#define PB0_TCC1WO3_OUT  MCHP_PINMUX(b, 0, 0x290, 16, periph)
/* pb0_tcc1wo4_out */
#define PB0_TCC1WO4_OUT  MCHP_PINMUX(b, 0, 0x28c, 15, periph)
/* pb0_tcc1wo5_out */
#define PB0_TCC1WO5_OUT  MCHP_PINMUX(b, 0, 0x290, 15, periph)
/* pb0_tcc2wo0_out */
#define PB0_TCC2WO0_OUT  MCHP_PINMUX(b, 0, 0x28c, 17, periph)
/* pb0_tcc2wo1_out */
#define PB0_TCC2WO1_OUT  MCHP_PINMUX(b, 0, 0x290, 17, periph)
/* pb1_cclin1_in */
#define PB1_CCLIN1_IN    MCHP_PINMUX(b, 1, 0x9c, 4, periph)
/* pb1_cclin2_in */
#define PB1_CCLIN2_IN    MCHP_PINMUX(b, 1, 0xa0, 11, periph)
/* pb1_cclin4_in */
#define PB1_CCLIN4_IN    MCHP_PINMUX(b, 1, 0xa8, 4, periph)
/* pb1_cclin5_in */
#define PB1_CCLIN5_IN    MCHP_PINMUX(b, 1, 0xac, 11, periph)
/* pb1_cclout0_out */
#define PB1_CCLOUT0_OUT  MCHP_PINMUX(b, 1, 0x298, 28, periph)
/* pb1_cclout1_out */
#define PB1_CCLOUT1_OUT  MCHP_PINMUX(b, 1, 0x294, 28, periph)
/* pb1_extint1_in */
#define PB1_EXTINT1_IN   MCHP_PINMUX(b, 1, 0x4, 4, periph)
/* pb1_extint2_in */
#define PB1_EXTINT2_IN   MCHP_PINMUX(b, 1, 0x8, 11, periph)
/* pb1_qcs_out */
#define PB1_QCS_OUT      MCHP_PINMUX(b, 1, 0x294, 24, periph)
/* pb1_qd0_out */
#define PB1_QD0_OUT      MCHP_PINMUX(b, 1, 0x294, 25, periph)
/* pb1_qd1_out */
#define PB1_QD1_OUT      MCHP_PINMUX(b, 1, 0x298, 25, periph)
/* pb1_qd2_in */
#define PB1_QD2_IN       MCHP_PINMUX(b, 1, 0x8c, 4, periph)
/* pb1_qd2_out */
#define PB1_QD2_OUT      MCHP_PINMUX(b, 1, 0x294, 27, periph)
/* pb1_qd3_in */
#define PB1_QD3_IN       MCHP_PINMUX(b, 1, 0x90, 11, periph)
/* pb1_qd3_out */
#define PB1_QD3_OUT      MCHP_PINMUX(b, 1, 0x294, 26, periph)
/* pb1_qsck_out */
#define PB1_QSCK_OUT     MCHP_PINMUX(b, 1, 0x294, 23, periph)
/* pb1_refo2_out */
#define PB1_REFO2_OUT    MCHP_PINMUX(b, 1, 0x294, 19, periph)
/* pb1_refo3_out */
#define PB1_REFO3_OUT    MCHP_PINMUX(b, 1, 0x298, 19, periph)
/* pb1_scom0p0_in */
#define PB1_SCOM0P0_IN   MCHP_PINMUX(b, 1, 0x40, 4, periph)
/* pb1_scom0p0_out */
#define PB1_SCOM0P0_OUT  MCHP_PINMUX(b, 1, 0x294, 1, periph)
/* pb1_scom0p1_in */
#define PB1_SCOM0P1_IN   MCHP_PINMUX(b, 1, 0x44, 11, periph)
/* pb1_scom0p1_out */
#define PB1_SCOM0P1_OUT  MCHP_PINMUX(b, 1, 0x298, 1, periph)
/* pb1_scom0p2_out */
#define PB1_SCOM0P2_OUT  MCHP_PINMUX(b, 1, 0x294, 3, periph)
/* pb1_scom0p3_out */
#define PB1_SCOM0P3_OUT  MCHP_PINMUX(b, 1, 0x294, 2, periph)
/* pb1_scom1p0_in */
#define PB1_SCOM1P0_IN   MCHP_PINMUX(b, 1, 0x50, 11, periph)
/* pb1_scom1p0_out */
#define PB1_SCOM1P0_OUT  MCHP_PINMUX(b, 1, 0x298, 5, periph)
/* pb1_scom1p1_out */
#define PB1_SCOM1P1_OUT  MCHP_PINMUX(b, 1, 0x294, 4, periph)
/* pb1_scom1p2_out */
#define PB1_SCOM1P2_OUT  MCHP_PINMUX(b, 1, 0x294, 6, periph)
/* pb1_scom1p3_in */
#define PB1_SCOM1P3_IN   MCHP_PINMUX(b, 1, 0x5c, 4, periph)
/* pb1_scom1p3_out */
#define PB1_SCOM1P3_OUT  MCHP_PINMUX(b, 1, 0x294, 5, periph)
/* pb1_scom2p1_out */
#define PB1_SCOM2P1_OUT  MCHP_PINMUX(b, 1, 0x294, 7, periph)
/* pb1_scom2p2_in */
#define PB1_SCOM2P2_IN   MCHP_PINMUX(b, 1, 0x68, 4, periph)
/* pb1_scom2p2_out */
#define PB1_SCOM2P2_OUT  MCHP_PINMUX(b, 1, 0x294, 8, periph)
/* pb1_scom2p3_in */
#define PB1_SCOM2P3_IN   MCHP_PINMUX(b, 1, 0x6c, 11, periph)
/* pb1_scom2p3_out */
#define PB1_SCOM2P3_OUT  MCHP_PINMUX(b, 1, 0x298, 8, periph)
/* pb1_scom3p0_out */
#define PB1_SCOM3P0_OUT  MCHP_PINMUX(b, 1, 0x294, 10, periph)
/* pb1_scom3p1_in */
#define PB1_SCOM3P1_IN   MCHP_PINMUX(b, 1, 0x74, 4, periph)
/* pb1_scom3p1_out */
#define PB1_SCOM3P1_OUT  MCHP_PINMUX(b, 1, 0x294, 9, periph)
/* pb1_scom3p2_in */
#define PB1_SCOM3P2_IN   MCHP_PINMUX(b, 1, 0x78, 11, periph)
/* pb1_scom3p2_out */
#define PB1_SCOM3P2_OUT  MCHP_PINMUX(b, 1, 0x298, 9, periph)
/* pb1_tc0wo0g2_in */
#define PB1_TC0WO0G2_IN  MCHP_PINMUX(b, 1, 0xb4, 4, periph)
/* pb1_tc0wo0_out */
#define PB1_TC0WO0_OUT   MCHP_PINMUX(b, 1, 0x298, 18, periph)
/* pb1_tc0wo1g3_in */
#define PB1_TC0WO1G3_IN  MCHP_PINMUX(b, 1, 0xb8, 11, periph)
/* pb1_tc0wo1_out */
#define PB1_TC0WO1_OUT   MCHP_PINMUX(b, 1, 0x294, 18, periph)
/* pb1_tc1wo0_out */
#define PB1_TC1WO0_OUT   MCHP_PINMUX(b, 1, 0x298, 20, periph)
/* pb1_tc1wo1g2_in */
#define PB1_TC1WO1G2_IN  MCHP_PINMUX(b, 1, 0xc4, 4, periph)
/* pb1_tc1wo1_out */
#define PB1_TC1WO1_OUT   MCHP_PINMUX(b, 1, 0x294, 20, periph)
/* pb1_tc2wo0g3_in */
#define PB1_TC2WO0G3_IN  MCHP_PINMUX(b, 1, 0xcc, 11, periph)
/* pb1_tc2wo0_out */
#define PB1_TC2WO0_OUT   MCHP_PINMUX(b, 1, 0x298, 21, periph)
/* pb1_tc2wo1g2_in */
#define PB1_TC2WO1G2_IN  MCHP_PINMUX(b, 1, 0xd0, 4, periph)
/* pb1_tc2wo1_out */
#define PB1_TC2WO1_OUT   MCHP_PINMUX(b, 1, 0x294, 21, periph)
/* pb1_tc3wo0g3_in */
#define PB1_TC3WO0G3_IN  MCHP_PINMUX(b, 1, 0xdc, 11, periph)
/* pb1_tc3wo0_out */
#define PB1_TC3WO0_OUT   MCHP_PINMUX(b, 1, 0x298, 22, periph)
/* pb1_tc3wo1g2_in */
#define PB1_TC3WO1G2_IN  MCHP_PINMUX(b, 1, 0xe0, 4, periph)
/* pb1_tc3wo1_out */
#define PB1_TC3WO1_OUT   MCHP_PINMUX(b, 1, 0x294, 22, periph)
/* pb1_tcc0wo0_out */
#define PB1_TCC0WO0_OUT  MCHP_PINMUX(b, 1, 0x298, 12, periph)
/* pb1_tcc0wo1_out */
#define PB1_TCC0WO1_OUT  MCHP_PINMUX(b, 1, 0x294, 11, periph)
/* pb1_tcc0wo2_out */
#define PB1_TCC0WO2_OUT  MCHP_PINMUX(b, 1, 0x298, 11, periph)
/* pb1_tcc0wo3_out */
#define PB1_TCC0WO3_OUT  MCHP_PINMUX(b, 1, 0x294, 13, periph)
/* pb1_tcc0wo4_out */
#define PB1_TCC0WO4_OUT  MCHP_PINMUX(b, 1, 0x298, 13, periph)
/* pb1_tcc0wo5_out */
#define PB1_TCC0WO5_OUT  MCHP_PINMUX(b, 1, 0x294, 12, periph)
/* pb1_tcc1wo0_out */
#define PB1_TCC1WO0_OUT  MCHP_PINMUX(b, 1, 0x298, 15, periph)
/* pb1_tcc1wo1_out */
#define PB1_TCC1WO1_OUT  MCHP_PINMUX(b, 1, 0x294, 14, periph)
/* pb1_tcc1wo2_out */
#define PB1_TCC1WO2_OUT  MCHP_PINMUX(b, 1, 0x298, 14, periph)
/* pb1_tcc1wo3_out */
#define PB1_TCC1WO3_OUT  MCHP_PINMUX(b, 1, 0x294, 16, periph)
/* pb1_tcc1wo4_out */
#define PB1_TCC1WO4_OUT  MCHP_PINMUX(b, 1, 0x298, 16, periph)
/* pb1_tcc1wo5_out */
#define PB1_TCC1WO5_OUT  MCHP_PINMUX(b, 1, 0x294, 15, periph)
/* pb1_tcc2wo0_out */
#define PB1_TCC2WO0_OUT  MCHP_PINMUX(b, 1, 0x298, 17, periph)
/* pb1_tcc2wo1_out */
#define PB1_TCC2WO1_OUT  MCHP_PINMUX(b, 1, 0x294, 17, periph)
/* pb2_cclin2_in */
#define PB2_CCLIN2_IN    MCHP_PINMUX(b, 2, 0xa0, 4, periph)
/* pb2_cclin5_in */
#define PB2_CCLIN5_IN    MCHP_PINMUX(b, 2, 0xac, 4, periph)
/* pb2_cclout0_out */
#define PB2_CCLOUT0_OUT  MCHP_PINMUX(b, 2, 0x29c, 28, periph)
/* pb2_cclout1_out */
#define PB2_CCLOUT1_OUT  MCHP_PINMUX(b, 2, 0x2a0, 28, periph)
/* pb2_extint2_in */
#define PB2_EXTINT2_IN   MCHP_PINMUX(b, 2, 0x8, 4, periph)
/* pb2_extint3_in */
#define PB2_EXTINT3_IN   MCHP_PINMUX(b, 2, 0xc, 11, periph)
/* pb2_nmi_in */
#define PB2_NMI_IN       MCHP_PINMUX(b, 2, 0x3c, 11, periph)
/* pb2_qcs_out */
#define PB2_QCS_OUT      MCHP_PINMUX(b, 2, 0x29c, 24, periph)
/* pb2_qd0_in */
#define PB2_QD0_IN       MCHP_PINMUX(b, 2, 0x84, 11, periph)
/* pb2_qd0_out */
#define PB2_QD0_OUT      MCHP_PINMUX(b, 2, 0x29c, 26, periph)
/* pb2_qd1_out */
#define PB2_QD1_OUT      MCHP_PINMUX(b, 2, 0x29c, 25, periph)
/* pb2_qd2_out */
#define PB2_QD2_OUT      MCHP_PINMUX(b, 2, 0x2a0, 25, periph)
/* pb2_qd3_in */
#define PB2_QD3_IN       MCHP_PINMUX(b, 2, 0x90, 4, periph)
/* pb2_qd3_out */
#define PB2_QD3_OUT      MCHP_PINMUX(b, 2, 0x29c, 27, periph)
/* pb2_qsck_out */
#define PB2_QSCK_OUT     MCHP_PINMUX(b, 2, 0x29c, 23, periph)
/* pb2_refo3_out */
#define PB2_REFO3_OUT    MCHP_PINMUX(b, 2, 0x29c, 19, periph)
/* pb2_refo4_out */
#define PB2_REFO4_OUT    MCHP_PINMUX(b, 2, 0x2a0, 19, periph)
/* pb2_scom0p0_out */
#define PB2_SCOM0P0_OUT  MCHP_PINMUX(b, 2, 0x29c, 2, periph)
/* pb2_scom0p1_in */
#define PB2_SCOM0P1_IN   MCHP_PINMUX(b, 2, 0x44, 4, periph)
/* pb2_scom0p1_out */
#define PB2_SCOM0P1_OUT  MCHP_PINMUX(b, 2, 0x29c, 1, periph)
/* pb2_scom0p2_in */
#define PB2_SCOM0P2_IN   MCHP_PINMUX(b, 2, 0x48, 11, periph)
/* pb2_scom0p2_out */
#define PB2_SCOM0P2_OUT  MCHP_PINMUX(b, 2, 0x2a0, 1, periph)
/* pb2_scom0p3_out */
#define PB2_SCOM0P3_OUT  MCHP_PINMUX(b, 2, 0x29c, 3, periph)
/* pb2_scom1p0_in */
#define PB2_SCOM1P0_IN   MCHP_PINMUX(b, 2, 0x50, 4, periph)
/* pb2_scom1p0_out */
#define PB2_SCOM1P0_OUT  MCHP_PINMUX(b, 2, 0x29c, 5, periph)
/* pb2_scom1p1_in */
#define PB2_SCOM1P1_IN   MCHP_PINMUX(b, 2, 0x54, 11, periph)
/* pb2_scom1p1_out */
#define PB2_SCOM1P1_OUT  MCHP_PINMUX(b, 2, 0x2a0, 5, periph)
/* pb2_scom1p2_out */
#define PB2_SCOM1P2_OUT  MCHP_PINMUX(b, 2, 0x29c, 4, periph)
/* pb2_scom1p3_out */
