zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz25/pic32cx1012bz25048-pinctrl.h
#define PB2_SCOM1P3_OUT  MCHP_PINMUX(b, 2, 0x29c, 6, periph)
/* pb2_scom2p0_in */
#define PB2_SCOM2P0_IN   MCHP_PINMUX(b, 2, 0x60, 11, periph)
/* pb2_scom2p0_out */
#define PB2_SCOM2P0_OUT  MCHP_PINMUX(b, 2, 0x2a0, 8, periph)
/* pb2_scom2p2_out */
#define PB2_SCOM2P2_OUT  MCHP_PINMUX(b, 2, 0x29c, 7, periph)
/* pb2_scom2p3_in */
#define PB2_SCOM2P3_IN   MCHP_PINMUX(b, 2, 0x6c, 4, periph)
/* pb2_scom2p3_out */
#define PB2_SCOM2P3_OUT  MCHP_PINMUX(b, 2, 0x29c, 8, periph)
/* pb2_scom3p1_out */
#define PB2_SCOM3P1_OUT  MCHP_PINMUX(b, 2, 0x29c, 10, periph)
/* pb2_scom3p2_in */
#define PB2_SCOM3P2_IN   MCHP_PINMUX(b, 2, 0x78, 4, periph)
/* pb2_scom3p2_out */
#define PB2_SCOM3P2_OUT  MCHP_PINMUX(b, 2, 0x29c, 9, periph)
/* pb2_scom3p3_in */
#define PB2_SCOM3P3_IN   MCHP_PINMUX(b, 2, 0x7c, 11, periph)
/* pb2_scom3p3_out */
#define PB2_SCOM3P3_OUT  MCHP_PINMUX(b, 2, 0x2a0, 9, periph)
/* pb2_tc0wo0_out */
#define PB2_TC0WO0_OUT   MCHP_PINMUX(b, 2, 0x29c, 18, periph)
/* pb2_tc0wo1g3_in */
#define PB2_TC0WO1G3_IN  MCHP_PINMUX(b, 2, 0xb8, 4, periph)
/* pb2_tc0wo1g4_in */
#define PB2_TC0WO1G4_IN  MCHP_PINMUX(b, 2, 0xbc, 11, periph)
/* pb2_tc1wo0_out */
#define PB2_TC1WO0_OUT   MCHP_PINMUX(b, 2, 0x29c, 20, periph)
/* pb2_tc1wo1_out */
#define PB2_TC1WO1_OUT   MCHP_PINMUX(b, 2, 0x2a0, 20, periph)
/* pb2_tc2wo0g3_in */
#define PB2_TC2WO0G3_IN  MCHP_PINMUX(b, 2, 0xcc, 4, periph)
/* pb2_tc2wo0_out */
#define PB2_TC2WO0_OUT   MCHP_PINMUX(b, 2, 0x29c, 21, periph)
/* pb2_tc2wo1g4_in */
#define PB2_TC2WO1G4_IN  MCHP_PINMUX(b, 2, 0xd4, 11, periph)
/* pb2_tc2wo1_out */
#define PB2_TC2WO1_OUT   MCHP_PINMUX(b, 2, 0x2a0, 21, periph)
/* pb2_tc3wo0g3_in */
#define PB2_TC3WO0G3_IN  MCHP_PINMUX(b, 2, 0xdc, 4, periph)
/* pb2_tc3wo0_out */
#define PB2_TC3WO0_OUT   MCHP_PINMUX(b, 2, 0x29c, 22, periph)
/* pb2_tc3wo1g4_in */
#define PB2_TC3WO1G4_IN  MCHP_PINMUX(b, 2, 0xe4, 11, periph)
/* pb2_tc3wo1_out */
#define PB2_TC3WO1_OUT   MCHP_PINMUX(b, 2, 0x2a0, 22, periph)
/* pb2_tcc0wo0_out */
#define PB2_TCC0WO0_OUT  MCHP_PINMUX(b, 2, 0x29c, 12, periph)
/* pb2_tcc0wo1_out */
#define PB2_TCC0WO1_OUT  MCHP_PINMUX(b, 2, 0x2a0, 12, periph)
/* pb2_tcc0wo2_out */
#define PB2_TCC0WO2_OUT  MCHP_PINMUX(b, 2, 0x29c, 11, periph)
/* pb2_tcc0wo3_out */
#define PB2_TCC0WO3_OUT  MCHP_PINMUX(b, 2, 0x2a0, 11, periph)
/* pb2_tcc0wo4_out */
#define PB2_TCC0WO4_OUT  MCHP_PINMUX(b, 2, 0x29c, 13, periph)
/* pb2_tcc0wo5_out */
#define PB2_TCC0WO5_OUT  MCHP_PINMUX(b, 2, 0x2a0, 13, periph)
/* pb2_tcc1wo0_out */
#define PB2_TCC1WO0_OUT  MCHP_PINMUX(b, 2, 0x29c, 15, periph)
/* pb2_tcc1wo1_out */
#define PB2_TCC1WO1_OUT  MCHP_PINMUX(b, 2, 0x2a0, 15, periph)
/* pb2_tcc1wo2_out */
#define PB2_TCC1WO2_OUT  MCHP_PINMUX(b, 2, 0x29c, 14, periph)
/* pb2_tcc1wo3_out */
#define PB2_TCC1WO3_OUT  MCHP_PINMUX(b, 2, 0x2a0, 14, periph)
/* pb2_tcc1wo4_out */
#define PB2_TCC1WO4_OUT  MCHP_PINMUX(b, 2, 0x29c, 16, periph)
/* pb2_tcc1wo5_out */
#define PB2_TCC1WO5_OUT  MCHP_PINMUX(b, 2, 0x2a0, 16, periph)
/* pb2_tcc2wo0_out */
#define PB2_TCC2WO0_OUT  MCHP_PINMUX(b, 2, 0x29c, 17, periph)
/* pb2_tcc2wo1_out */
#define PB2_TCC2WO1_OUT  MCHP_PINMUX(b, 2, 0x2a0, 17, periph)
/* pb3_cclin0_in */
#define PB3_CCLIN0_IN    MCHP_PINMUX(b, 3, 0x98, 12, periph)
/* pb3_cclin3_in */
#define PB3_CCLIN3_IN    MCHP_PINMUX(b, 3, 0xa4, 12, periph)
/* pb3_cclout0_out */
#define PB3_CCLOUT0_OUT  MCHP_PINMUX(b, 3, 0x2a4, 28, periph)
/* pb3_cclout1_out */
#define PB3_CCLOUT1_OUT  MCHP_PINMUX(b, 3, 0x2a8, 28, periph)
/* pb3_extint0_in */
#define PB3_EXTINT0_IN   MCHP_PINMUX(b, 3, 0x0, 12, periph)
/* pb3_extint3_in */
#define PB3_EXTINT3_IN   MCHP_PINMUX(b, 3, 0xc, 4, periph)
/* pb3_nmi_in */
#define PB3_NMI_IN       MCHP_PINMUX(b, 3, 0x3c, 4, periph)
/* pb3_qcs_out */
#define PB3_QCS_OUT      MCHP_PINMUX(b, 3, 0x2a4, 24, periph)
/* pb3_qd0_in */
#define PB3_QD0_IN       MCHP_PINMUX(b, 3, 0x84, 4, periph)
/* pb3_qd0_out */
#define PB3_QD0_OUT      MCHP_PINMUX(b, 3, 0x2a8, 27, periph)
/* pb3_qd1_in */
#define PB3_QD1_IN       MCHP_PINMUX(b, 3, 0x88, 12, periph)
/* pb3_qd1_out */
#define PB3_QD1_OUT      MCHP_PINMUX(b, 3, 0x2a4, 27, periph)
/* pb3_qd2_out */
#define PB3_QD2_OUT      MCHP_PINMUX(b, 3, 0x2a4, 26, periph)
/* pb3_qd3_out */
#define PB3_QD3_OUT      MCHP_PINMUX(b, 3, 0x2a4, 25, periph)
/* pb3_qsck_in */
#define PB3_QSCK_IN      MCHP_PINMUX(b, 3, 0x80, 12, periph)
/* pb3_qsck_out */
#define PB3_QSCK_OUT     MCHP_PINMUX(b, 3, 0x2a4, 23, periph)
/* pb3_refi_in */
#define PB3_REFI_IN      MCHP_PINMUX(b, 3, 0x94, 12, periph)
/* pb3_refo1_out */
#define PB3_REFO1_OUT    MCHP_PINMUX(b, 3, 0x2a4, 19, periph)
/* pb3_refo4_out */
#define PB3_REFO4_OUT    MCHP_PINMUX(b, 3, 0x2a8, 19, periph)
/* pb3_scom0p0_out */
#define PB3_SCOM0P0_OUT  MCHP_PINMUX(b, 3, 0x2a8, 3, periph)
/* pb3_scom0p1_out */
#define PB3_SCOM0P1_OUT  MCHP_PINMUX(b, 3, 0x2a4, 3, periph)
/* pb3_scom0p2_in */
#define PB3_SCOM0P2_IN   MCHP_PINMUX(b, 3, 0x48, 4, periph)
/* pb3_scom0p2_out */
#define PB3_SCOM0P2_OUT  MCHP_PINMUX(b, 3, 0x2a4, 2, periph)
/* pb3_scom0p3_in */
#define PB3_SCOM0P3_IN   MCHP_PINMUX(b, 3, 0x4c, 12, periph)
/* pb3_scom0p3_out */
#define PB3_SCOM0P3_OUT  MCHP_PINMUX(b, 3, 0x2a4, 1, periph)
/* pb3_scom1p0_out */
#define PB3_SCOM1P0_OUT  MCHP_PINMUX(b, 3, 0x2a4, 4, periph)
/* pb3_scom1p1_in */
#define PB3_SCOM1P1_IN   MCHP_PINMUX(b, 3, 0x54, 4, periph)
/* pb3_scom1p1_out */
#define PB3_SCOM1P1_OUT  MCHP_PINMUX(b, 3, 0x2a4, 6, periph)
/* pb3_scom1p2_in */
#define PB3_SCOM1P2_IN   MCHP_PINMUX(b, 3, 0x58, 12, periph)
/* pb3_scom1p2_out */
#define PB3_SCOM1P2_OUT  MCHP_PINMUX(b, 3, 0x2a4, 5, periph)
/* pb3_scom1p3_out */
#define PB3_SCOM1P3_OUT  MCHP_PINMUX(b, 3, 0x2a8, 4, periph)
/* pb3_scom2p0_in */
#define PB3_SCOM2P0_IN   MCHP_PINMUX(b, 3, 0x60, 4, periph)
/* pb3_scom2p0_out */
#define PB3_SCOM2P0_OUT  MCHP_PINMUX(b, 3, 0x2a4, 7, periph)
/* pb3_scom2p1_in */
#define PB3_SCOM2P1_IN   MCHP_PINMUX(b, 3, 0x64, 12, periph)
/* pb3_scom2p1_out */
#define PB3_SCOM2P1_OUT  MCHP_PINMUX(b, 3, 0x2a4, 8, periph)
/* pb3_scom2p3_out */
#define PB3_SCOM2P3_OUT  MCHP_PINMUX(b, 3, 0x2a8, 7, periph)
/* pb3_scom3p0_in */
#define PB3_SCOM3P0_IN   MCHP_PINMUX(b, 3, 0x70, 12, periph)
/* pb3_scom3p0_out */
#define PB3_SCOM3P0_OUT  MCHP_PINMUX(b, 3, 0x2a4, 9, periph)
/* pb3_scom3p2_out */
#define PB3_SCOM3P2_OUT  MCHP_PINMUX(b, 3, 0x2a8, 10, periph)
/* pb3_scom3p3_in */
#define PB3_SCOM3P3_IN   MCHP_PINMUX(b, 3, 0x7c, 4, periph)
/* pb3_scom3p3_out */
#define PB3_SCOM3P3_OUT  MCHP_PINMUX(b, 3, 0x2a4, 10, periph)
/* pb3_tc0wo0g1_in */
#define PB3_TC0WO0G1_IN  MCHP_PINMUX(b, 3, 0xb0, 12, periph)
/* pb3_tc0wo0_out */
#define PB3_TC0WO0_OUT   MCHP_PINMUX(b, 3, 0x2a8, 18, periph)
/* pb3_tc0wo1g4_in */
#define PB3_TC0WO1G4_IN  MCHP_PINMUX(b, 3, 0xbc, 4, periph)
/* pb3_tc0wo1_out */
#define PB3_TC0WO1_OUT   MCHP_PINMUX(b, 3, 0x2a4, 18, periph)
/* pb3_tc1wo0g1_in */
#define PB3_TC1WO0G1_IN  MCHP_PINMUX(b, 3, 0xc0, 12, periph)
/* pb3_tc1wo0_out */
#define PB3_TC1WO0_OUT   MCHP_PINMUX(b, 3, 0x2a4, 20, periph)
/* pb3_tc1wo1_out */
#define PB3_TC1WO1_OUT   MCHP_PINMUX(b, 3, 0x2a8, 20, periph)
/* pb3_tc2wo0g1_in */
#define PB3_TC2WO0G1_IN  MCHP_PINMUX(b, 3, 0xc8, 12, periph)
/* pb3_tc2wo0_out */
#define PB3_TC2WO0_OUT   MCHP_PINMUX(b, 3, 0x2a4, 21, periph)
/* pb3_tc2wo1g4_in */
#define PB3_TC2WO1G4_IN  MCHP_PINMUX(b, 3, 0xd4, 4, periph)
/* pb3_tc2wo1_out */
#define PB3_TC2WO1_OUT   MCHP_PINMUX(b, 3, 0x2a8, 21, periph)
/* pb3_tc3wo0g1_in */
#define PB3_TC3WO0G1_IN  MCHP_PINMUX(b, 3, 0xd8, 12, periph)
/* pb3_tc3wo0_out */
#define PB3_TC3WO0_OUT   MCHP_PINMUX(b, 3, 0x2a4, 22, periph)
/* pb3_tc3wo1g4_in */
#define PB3_TC3WO1G4_IN  MCHP_PINMUX(b, 3, 0xe4, 4, periph)
/* pb3_tc3wo1_out */
#define PB3_TC3WO1_OUT   MCHP_PINMUX(b, 3, 0x2a8, 22, periph)
/* pb3_tcc0wo0_out */
#define PB3_TCC0WO0_OUT  MCHP_PINMUX(b, 3, 0x2a4, 11, periph)
/* pb3_tcc0wo1_out */
#define PB3_TCC0WO1_OUT  MCHP_PINMUX(b, 3, 0x2a8, 12, periph)
/* pb3_tcc0wo2_out */
#define PB3_TCC0WO2_OUT  MCHP_PINMUX(b, 3, 0x2a4, 13, periph)
/* pb3_tcc0wo3_out */
#define PB3_TCC0WO3_OUT  MCHP_PINMUX(b, 3, 0x2a8, 11, periph)
/* pb3_tcc0wo4_out */
#define PB3_TCC0WO4_OUT  MCHP_PINMUX(b, 3, 0x2a4, 12, periph)
/* pb3_tcc0wo5_out */
#define PB3_TCC0WO5_OUT  MCHP_PINMUX(b, 3, 0x2a8, 13, periph)
/* pb3_tcc1wo0_out */
#define PB3_TCC1WO0_OUT  MCHP_PINMUX(b, 3, 0x2a4, 14, periph)
/* pb3_tcc1wo1_out */
#define PB3_TCC1WO1_OUT  MCHP_PINMUX(b, 3, 0x2a8, 15, periph)
/* pb3_tcc1wo2_out */
#define PB3_TCC1WO2_OUT  MCHP_PINMUX(b, 3, 0x2a4, 16, periph)
/* pb3_tcc1wo3_out */
#define PB3_TCC1WO3_OUT  MCHP_PINMUX(b, 3, 0x2a8, 14, periph)
/* pb3_tcc1wo4_out */
#define PB3_TCC1WO4_OUT  MCHP_PINMUX(b, 3, 0x2a4, 15, periph)
/* pb3_tcc1wo5_out */
#define PB3_TCC1WO5_OUT  MCHP_PINMUX(b, 3, 0x2a8, 16, periph)
/* pb3_tcc2wo0_out */
#define PB3_TCC2WO0_OUT  MCHP_PINMUX(b, 3, 0x2a4, 17, periph)
/* pb3_tcc2wo1_out */
#define PB3_TCC2WO1_OUT  MCHP_PINMUX(b, 3, 0x2a8, 17, periph)
/* pb4_cclin0_in */
#define PB4_CCLIN0_IN    MCHP_PINMUX(b, 4, 0x98, 5, periph)
/* pb4_cclin1_in */
#define PB4_CCLIN1_IN    MCHP_PINMUX(b, 4, 0x9c, 12, periph)
/* pb4_cclin3_in */
#define PB4_CCLIN3_IN    MCHP_PINMUX(b, 4, 0xa4, 5, periph)
/* pb4_cclin4_in */
#define PB4_CCLIN4_IN    MCHP_PINMUX(b, 4, 0xa8, 12, periph)
/* pb4_cclout0_out */
#define PB4_CCLOUT0_OUT  MCHP_PINMUX(b, 4, 0x2ac, 28, periph)
/* pb4_cclout1_out */
#define PB4_CCLOUT1_OUT  MCHP_PINMUX(b, 4, 0x2b0, 28, periph)
/* pb4_extint0_in */
#define PB4_EXTINT0_IN   MCHP_PINMUX(b, 4, 0x0, 5, periph)
/* pb4_extint1_in */
#define PB4_EXTINT1_IN   MCHP_PINMUX(b, 4, 0x4, 12, periph)
/* pb4_qcs_out */
#define PB4_QCS_OUT      MCHP_PINMUX(b, 4, 0x2ac, 24, periph)
/* pb4_qd0_out */
#define PB4_QD0_OUT      MCHP_PINMUX(b, 4, 0x2b0, 25, periph)
/* pb4_qd1_in */
#define PB4_QD1_IN       MCHP_PINMUX(b, 4, 0x88, 5, periph)
/* pb4_qd1_out */
#define PB4_QD1_OUT      MCHP_PINMUX(b, 4, 0x2ac, 27, periph)
/* pb4_qd2_in */
#define PB4_QD2_IN       MCHP_PINMUX(b, 4, 0x8c, 12, periph)
/* pb4_qd2_out */
#define PB4_QD2_OUT      MCHP_PINMUX(b, 4, 0x2ac, 26, periph)
/* pb4_qd3_out */
#define PB4_QD3_OUT      MCHP_PINMUX(b, 4, 0x2ac, 25, periph)
/* pb4_qsck_in */
#define PB4_QSCK_IN      MCHP_PINMUX(b, 4, 0x80, 5, periph)
/* pb4_qsck_out */
#define PB4_QSCK_OUT     MCHP_PINMUX(b, 4, 0x2ac, 23, periph)
/* pb4_refi_in */
#define PB4_REFI_IN      MCHP_PINMUX(b, 4, 0x94, 5, periph)
/* pb4_refo1_out */
#define PB4_REFO1_OUT    MCHP_PINMUX(b, 4, 0x2ac, 19, periph)
/* pb4_refo2_out */
#define PB4_REFO2_OUT    MCHP_PINMUX(b, 4, 0x2b0, 19, periph)
/* pb4_scom0p0_in */
#define PB4_SCOM0P0_IN   MCHP_PINMUX(b, 4, 0x40, 12, periph)
/* pb4_scom0p0_out */
#define PB4_SCOM0P0_OUT  MCHP_PINMUX(b, 4, 0x2b0, 1, periph)
/* pb4_scom0p1_out */
#define PB4_SCOM0P1_OUT  MCHP_PINMUX(b, 4, 0x2ac, 3, periph)
/* pb4_scom0p2_out */
#define PB4_SCOM0P2_OUT  MCHP_PINMUX(b, 4, 0x2ac, 2, periph)
/* pb4_scom0p3_in */
#define PB4_SCOM0P3_IN   MCHP_PINMUX(b, 4, 0x4c, 5, periph)
/* pb4_scom0p3_out */
#define PB4_SCOM0P3_OUT  MCHP_PINMUX(b, 4, 0x2ac, 1, periph)
/* pb4_scom1p0_out */
#define PB4_SCOM1P0_OUT  MCHP_PINMUX(b, 4, 0x2ac, 4, periph)
/* pb4_scom1p1_out */
#define PB4_SCOM1P1_OUT  MCHP_PINMUX(b, 4, 0x2ac, 6, periph)
/* pb4_scom1p2_in */
#define PB4_SCOM1P2_IN   MCHP_PINMUX(b, 4, 0x58, 5, periph)
/* pb4_scom1p2_out */
#define PB4_SCOM1P2_OUT  MCHP_PINMUX(b, 4, 0x2ac, 5, periph)
/* pb4_scom1p3_in */
#define PB4_SCOM1P3_IN   MCHP_PINMUX(b, 4, 0x5c, 12, periph)
/* pb4_scom1p3_out */
#define PB4_SCOM1P3_OUT  MCHP_PINMUX(b, 4, 0x2b0, 5, periph)
/* pb4_scom2p0_out */
#define PB4_SCOM2P0_OUT  MCHP_PINMUX(b, 4, 0x2ac, 7, periph)
/* pb4_scom2p1_in */
#define PB4_SCOM2P1_IN   MCHP_PINMUX(b, 4, 0x64, 5, periph)
/* pb4_scom2p1_out */
#define PB4_SCOM2P1_OUT  MCHP_PINMUX(b, 4, 0x2ac, 8, periph)
/* pb4_scom2p2_in */
#define PB4_SCOM2P2_IN   MCHP_PINMUX(b, 4, 0x68, 12, periph)
/* pb4_scom2p2_out */
#define PB4_SCOM2P2_OUT  MCHP_PINMUX(b, 4, 0x2b0, 8, periph)
/* pb4_scom3p0_in */
#define PB4_SCOM3P0_IN   MCHP_PINMUX(b, 4, 0x70, 5, periph)
/* pb4_scom3p0_out */
#define PB4_SCOM3P0_OUT  MCHP_PINMUX(b, 4, 0x2ac, 9, periph)
/* pb4_scom3p1_in */
#define PB4_SCOM3P1_IN   MCHP_PINMUX(b, 4, 0x74, 12, periph)
/* pb4_scom3p1_out */
#define PB4_SCOM3P1_OUT  MCHP_PINMUX(b, 4, 0x2b0, 9, periph)
/* pb4_scom3p3_out */
#define PB4_SCOM3P3_OUT  MCHP_PINMUX(b, 4, 0x2ac, 10, periph)
/* pb4_tc0wo0g1_in */
#define PB4_TC0WO0G1_IN  MCHP_PINMUX(b, 4, 0xb0, 5, periph)
/* pb4_tc0wo0g2_in */
#define PB4_TC0WO0G2_IN  MCHP_PINMUX(b, 4, 0xb4, 12, periph)
/* pb4_tc0wo1_out */
#define PB4_TC0WO1_OUT   MCHP_PINMUX(b, 4, 0x2ac, 18, periph)
/* pb4_tc1wo0g1_in */
#define PB4_TC1WO0G1_IN  MCHP_PINMUX(b, 4, 0xc0, 5, periph)
/* pb4_tc1wo0_out */
#define PB4_TC1WO0_OUT   MCHP_PINMUX(b, 4, 0x2ac, 20, periph)
/* pb4_tc1wo1g2_in */
#define PB4_TC1WO1G2_IN  MCHP_PINMUX(b, 4, 0xc4, 12, periph)
/* pb4_tc1wo1_out */
#define PB4_TC1WO1_OUT   MCHP_PINMUX(b, 4, 0x2b0, 20, periph)
/* pb4_tc2wo0g1_in */
#define PB4_TC2WO0G1_IN  MCHP_PINMUX(b, 4, 0xc8, 5, periph)
/* pb4_tc2wo0_out */
#define PB4_TC2WO0_OUT   MCHP_PINMUX(b, 4, 0x2ac, 21, periph)
/* pb4_tc2wo1g2_in */
#define PB4_TC2WO1G2_IN  MCHP_PINMUX(b, 4, 0xd0, 12, periph)
/* pb4_tc2wo1_out */
#define PB4_TC2WO1_OUT   MCHP_PINMUX(b, 4, 0x2b0, 21, periph)
/* pb4_tc3wo0g1_in */
#define PB4_TC3WO0G1_IN  MCHP_PINMUX(b, 4, 0xd8, 5, periph)
/* pb4_tc3wo0_out */
#define PB4_TC3WO0_OUT   MCHP_PINMUX(b, 4, 0x2ac, 22, periph)
/* pb4_tc3wo1g2_in */
#define PB4_TC3WO1G2_IN  MCHP_PINMUX(b, 4, 0xe0, 12, periph)
/* pb4_tc3wo1_out */
#define PB4_TC3WO1_OUT   MCHP_PINMUX(b, 4, 0x2b0, 22, periph)
/* pb4_tcc0wo0_out */
#define PB4_TCC0WO0_OUT  MCHP_PINMUX(b, 4, 0x2ac, 11, periph)
/* pb4_tcc0wo1_out */
#define PB4_TCC0WO1_OUT  MCHP_PINMUX(b, 4, 0x2b0, 11, periph)
/* pb4_tcc0wo2_out */
#define PB4_TCC0WO2_OUT  MCHP_PINMUX(b, 4, 0x2ac, 13, periph)
/* pb4_tcc0wo3_out */
#define PB4_TCC0WO3_OUT  MCHP_PINMUX(b, 4, 0x2b0, 13, periph)
/* pb4_tcc0wo4_out */
#define PB4_TCC0WO4_OUT  MCHP_PINMUX(b, 4, 0x2ac, 12, periph)
/* pb4_tcc0wo5_out */
#define PB4_TCC0WO5_OUT  MCHP_PINMUX(b, 4, 0x2b0, 12, periph)
/* pb4_tcc1wo0_out */
#define PB4_TCC1WO0_OUT  MCHP_PINMUX(b, 4, 0x2ac, 14, periph)
/* pb4_tcc1wo1_out */
#define PB4_TCC1WO1_OUT  MCHP_PINMUX(b, 4, 0x2b0, 14, periph)
/* pb4_tcc1wo2_out */
#define PB4_TCC1WO2_OUT  MCHP_PINMUX(b, 4, 0x2ac, 16, periph)
/* pb4_tcc1wo3_out */
#define PB4_TCC1WO3_OUT  MCHP_PINMUX(b, 4, 0x2b0, 16, periph)
/* pb4_tcc1wo4_out */
#define PB4_TCC1WO4_OUT  MCHP_PINMUX(b, 4, 0x2ac, 15, periph)
/* pb4_tcc1wo5_out */
#define PB4_TCC1WO5_OUT  MCHP_PINMUX(b, 4, 0x2b0, 15, periph)
/* pb4_tcc2wo0_out */
#define PB4_TCC2WO0_OUT  MCHP_PINMUX(b, 4, 0x2ac, 17, periph)
/* pb4_tcc2wo1_out */
#define PB4_TCC2WO1_OUT  MCHP_PINMUX(b, 4, 0x2b0, 17, periph)
/* pb5_cclin1_in */
#define PB5_CCLIN1_IN    MCHP_PINMUX(b, 5, 0x9c, 5, periph)
/* pb5_cclin2_in */
#define PB5_CCLIN2_IN    MCHP_PINMUX(b, 5, 0xa0, 12, periph)
/* pb5_cclin4_in */
#define PB5_CCLIN4_IN    MCHP_PINMUX(b, 5, 0xa8, 5, periph)
/* pb5_cclin5_in */
#define PB5_CCLIN5_IN    MCHP_PINMUX(b, 5, 0xac, 12, periph)
/* pb5_cclout0_out */
#define PB5_CCLOUT0_OUT  MCHP_PINMUX(b, 5, 0x2b8, 28, periph)
/* pb5_cclout1_out */
#define PB5_CCLOUT1_OUT  MCHP_PINMUX(b, 5, 0x2b4, 28, periph)
/* pb5_extint1_in */
#define PB5_EXTINT1_IN   MCHP_PINMUX(b, 5, 0x4, 5, periph)
/* pb5_extint2_in */
#define PB5_EXTINT2_IN   MCHP_PINMUX(b, 5, 0x8, 12, periph)
/* pb5_qcs_out */
#define PB5_QCS_OUT      MCHP_PINMUX(b, 5, 0x2b4, 24, periph)
/* pb5_qd0_out */
#define PB5_QD0_OUT      MCHP_PINMUX(b, 5, 0x2b4, 25, periph)
/* pb5_qd1_out */
#define PB5_QD1_OUT      MCHP_PINMUX(b, 5, 0x2b8, 25, periph)
/* pb5_qd2_in */
#define PB5_QD2_IN       MCHP_PINMUX(b, 5, 0x8c, 5, periph)
/* pb5_qd2_out */
#define PB5_QD2_OUT      MCHP_PINMUX(b, 5, 0x2b4, 27, periph)
/* pb5_qd3_in */
#define PB5_QD3_IN       MCHP_PINMUX(b, 5, 0x90, 12, periph)
/* pb5_qd3_out */
#define PB5_QD3_OUT      MCHP_PINMUX(b, 5, 0x2b4, 26, periph)
/* pb5_qsck_out */
#define PB5_QSCK_OUT     MCHP_PINMUX(b, 5, 0x2b4, 23, periph)
/* pb5_refo2_out */
#define PB5_REFO2_OUT    MCHP_PINMUX(b, 5, 0x2b4, 19, periph)
/* pb5_refo3_out */
#define PB5_REFO3_OUT    MCHP_PINMUX(b, 5, 0x2b8, 19, periph)
/* pb5_scom0p0_in */
#define PB5_SCOM0P0_IN   MCHP_PINMUX(b, 5, 0x40, 5, periph)
/* pb5_scom0p0_out */
#define PB5_SCOM0P0_OUT  MCHP_PINMUX(b, 5, 0x2b4, 1, periph)
/* pb5_scom0p1_in */
#define PB5_SCOM0P1_IN   MCHP_PINMUX(b, 5, 0x44, 12, periph)
/* pb5_scom0p1_out */
#define PB5_SCOM0P1_OUT  MCHP_PINMUX(b, 5, 0x2b8, 1, periph)
/* pb5_scom0p2_out */
#define PB5_SCOM0P2_OUT  MCHP_PINMUX(b, 5, 0x2b4, 3, periph)
/* pb5_scom0p3_out */
#define PB5_SCOM0P3_OUT  MCHP_PINMUX(b, 5, 0x2b4, 2, periph)
/* pb5_scom1p0_in */
#define PB5_SCOM1P0_IN   MCHP_PINMUX(b, 5, 0x50, 12, periph)
/* pb5_scom1p0_out */
#define PB5_SCOM1P0_OUT  MCHP_PINMUX(b, 5, 0x2b8, 5, periph)
/* pb5_scom1p1_out */
#define PB5_SCOM1P1_OUT  MCHP_PINMUX(b, 5, 0x2b4, 4, periph)
/* pb5_scom1p2_out */
#define PB5_SCOM1P2_OUT  MCHP_PINMUX(b, 5, 0x2b4, 6, periph)
/* pb5_scom1p3_in */
#define PB5_SCOM1P3_IN   MCHP_PINMUX(b, 5, 0x5c, 5, periph)
/* pb5_scom1p3_out */
#define PB5_SCOM1P3_OUT  MCHP_PINMUX(b, 5, 0x2b4, 5, periph)
/* pb5_scom2p1_out */
#define PB5_SCOM2P1_OUT  MCHP_PINMUX(b, 5, 0x2b4, 7, periph)
/* pb5_scom2p2_in */
#define PB5_SCOM2P2_IN   MCHP_PINMUX(b, 5, 0x68, 5, periph)
/* pb5_scom2p2_out */
#define PB5_SCOM2P2_OUT  MCHP_PINMUX(b, 5, 0x2b4, 8, periph)
/* pb5_scom2p3_in */
#define PB5_SCOM2P3_IN   MCHP_PINMUX(b, 5, 0x6c, 12, periph)
/* pb5_scom2p3_out */
#define PB5_SCOM2P3_OUT  MCHP_PINMUX(b, 5, 0x2b8, 8, periph)
/* pb5_scom3p0_out */
#define PB5_SCOM3P0_OUT  MCHP_PINMUX(b, 5, 0x2b4, 10, periph)
/* pb5_scom3p1_in */
#define PB5_SCOM3P1_IN   MCHP_PINMUX(b, 5, 0x74, 5, periph)
/* pb5_scom3p1_out */
#define PB5_SCOM3P1_OUT  MCHP_PINMUX(b, 5, 0x2b4, 9, periph)
/* pb5_scom3p2_in */
#define PB5_SCOM3P2_IN   MCHP_PINMUX(b, 5, 0x78, 12, periph)
/* pb5_scom3p2_out */
#define PB5_SCOM3P2_OUT  MCHP_PINMUX(b, 5, 0x2b8, 9, periph)
/* pb5_tc0wo0g2_in */
#define PB5_TC0WO0G2_IN  MCHP_PINMUX(b, 5, 0xb4, 5, periph)
/* pb5_tc0wo0_out */
#define PB5_TC0WO0_OUT   MCHP_PINMUX(b, 5, 0x2b8, 18, periph)
/* pb5_tc0wo1g3_in */
#define PB5_TC0WO1G3_IN  MCHP_PINMUX(b, 5, 0xb8, 12, periph)
/* pb5_tc0wo1_out */
#define PB5_TC0WO1_OUT   MCHP_PINMUX(b, 5, 0x2b4, 18, periph)
/* pb5_tc1wo0_out */
#define PB5_TC1WO0_OUT   MCHP_PINMUX(b, 5, 0x2b8, 20, periph)
/* pb5_tc1wo1g2_in */
#define PB5_TC1WO1G2_IN  MCHP_PINMUX(b, 5, 0xc4, 5, periph)
/* pb5_tc1wo1_out */
#define PB5_TC1WO1_OUT   MCHP_PINMUX(b, 5, 0x2b4, 20, periph)
/* pb5_tc2wo0g3_in */
#define PB5_TC2WO0G3_IN  MCHP_PINMUX(b, 5, 0xcc, 12, periph)
/* pb5_tc2wo0_out */
#define PB5_TC2WO0_OUT   MCHP_PINMUX(b, 5, 0x2b8, 21, periph)
/* pb5_tc2wo1g2_in */
#define PB5_TC2WO1G2_IN  MCHP_PINMUX(b, 5, 0xd0, 5, periph)
/* pb5_tc2wo1_out */
#define PB5_TC2WO1_OUT   MCHP_PINMUX(b, 5, 0x2b4, 21, periph)
/* pb5_tc3wo0g3_in */
#define PB5_TC3WO0G3_IN  MCHP_PINMUX(b, 5, 0xdc, 12, periph)
/* pb5_tc3wo0_out */
#define PB5_TC3WO0_OUT   MCHP_PINMUX(b, 5, 0x2b8, 22, periph)
/* pb5_tc3wo1g2_in */
#define PB5_TC3WO1G2_IN  MCHP_PINMUX(b, 5, 0xe0, 5, periph)
/* pb5_tc3wo1_out */
#define PB5_TC3WO1_OUT   MCHP_PINMUX(b, 5, 0x2b4, 22, periph)
/* pb5_tcc0wo0_out */
#define PB5_TCC0WO0_OUT  MCHP_PINMUX(b, 5, 0x2b8, 12, periph)
/* pb5_tcc0wo1_out */
#define PB5_TCC0WO1_OUT  MCHP_PINMUX(b, 5, 0x2b4, 11, periph)
/* pb5_tcc0wo2_out */
#define PB5_TCC0WO2_OUT  MCHP_PINMUX(b, 5, 0x2b8, 11, periph)
/* pb5_tcc0wo3_out */
#define PB5_TCC0WO3_OUT  MCHP_PINMUX(b, 5, 0x2b4, 13, periph)
/* pb5_tcc0wo4_out */
#define PB5_TCC0WO4_OUT  MCHP_PINMUX(b, 5, 0x2b8, 13, periph)
/* pb5_tcc0wo5_out */
#define PB5_TCC0WO5_OUT  MCHP_PINMUX(b, 5, 0x2b4, 12, periph)
/* pb5_tcc1wo0_out */
#define PB5_TCC1WO0_OUT  MCHP_PINMUX(b, 5, 0x2b8, 15, periph)
/* pb5_tcc1wo1_out */
#define PB5_TCC1WO1_OUT  MCHP_PINMUX(b, 5, 0x2b4, 14, periph)
/* pb5_tcc1wo2_out */
#define PB5_TCC1WO2_OUT  MCHP_PINMUX(b, 5, 0x2b8, 14, periph)
/* pb5_tcc1wo3_out */
#define PB5_TCC1WO3_OUT  MCHP_PINMUX(b, 5, 0x2b4, 16, periph)
/* pb5_tcc1wo4_out */
#define PB5_TCC1WO4_OUT  MCHP_PINMUX(b, 5, 0x2b8, 16, periph)
/* pb5_tcc1wo5_out */
#define PB5_TCC1WO5_OUT  MCHP_PINMUX(b, 5, 0x2b4, 15, periph)
/* pb5_tcc2wo0_out */
#define PB5_TCC2WO0_OUT  MCHP_PINMUX(b, 5, 0x2b8, 17, periph)
/* pb5_tcc2wo1_out */
#define PB5_TCC2WO1_OUT  MCHP_PINMUX(b, 5, 0x2b4, 17, periph)
/* pb6_cclin2_in */
#define PB6_CCLIN2_IN    MCHP_PINMUX(b, 6, 0xa0, 5, periph)
/* pb6_cclin5_in */
#define PB6_CCLIN5_IN    MCHP_PINMUX(b, 6, 0xac, 5, periph)
/* pb6_cclout0_out */
#define PB6_CCLOUT0_OUT  MCHP_PINMUX(b, 6, 0x2bc, 28, periph)
/* pb6_cclout1_out */
#define PB6_CCLOUT1_OUT  MCHP_PINMUX(b, 6, 0x2c0, 28, periph)
/* pb6_extint2_in */
#define PB6_EXTINT2_IN   MCHP_PINMUX(b, 6, 0x8, 5, periph)
/* pb6_extint3_in */
#define PB6_EXTINT3_IN   MCHP_PINMUX(b, 6, 0xc, 12, periph)
/* pb6_nmi_in */
#define PB6_NMI_IN       MCHP_PINMUX(b, 6, 0x3c, 12, periph)
/* pb6_qcs_out */
#define PB6_QCS_OUT      MCHP_PINMUX(b, 6, 0x2bc, 24, periph)
/* pb6_qd0_in */
#define PB6_QD0_IN       MCHP_PINMUX(b, 6, 0x84, 12, periph)
/* pb6_qd0_out */
#define PB6_QD0_OUT      MCHP_PINMUX(b, 6, 0x2bc, 26, periph)
/* pb6_qd1_out */
#define PB6_QD1_OUT      MCHP_PINMUX(b, 6, 0x2bc, 25, periph)
/* pb6_qd2_out */
#define PB6_QD2_OUT      MCHP_PINMUX(b, 6, 0x2c0, 25, periph)
/* pb6_qd3_in */
#define PB6_QD3_IN       MCHP_PINMUX(b, 6, 0x90, 5, periph)
/* pb6_qd3_out */
#define PB6_QD3_OUT      MCHP_PINMUX(b, 6, 0x2bc, 27, periph)
/* pb6_qsck_out */
#define PB6_QSCK_OUT     MCHP_PINMUX(b, 6, 0x2bc, 23, periph)
/* pb6_refo3_out */
#define PB6_REFO3_OUT    MCHP_PINMUX(b, 6, 0x2bc, 19, periph)
/* pb6_refo4_out */
#define PB6_REFO4_OUT    MCHP_PINMUX(b, 6, 0x2c0, 19, periph)
/* pb6_scom0p0_out */
#define PB6_SCOM0P0_OUT  MCHP_PINMUX(b, 6, 0x2bc, 2, periph)
/* pb6_scom0p1_in */
#define PB6_SCOM0P1_IN   MCHP_PINMUX(b, 6, 0x44, 5, periph)
/* pb6_scom0p1_out */
#define PB6_SCOM0P1_OUT  MCHP_PINMUX(b, 6, 0x2bc, 1, periph)
/* pb6_scom0p2_in */
#define PB6_SCOM0P2_IN   MCHP_PINMUX(b, 6, 0x48, 12, periph)
/* pb6_scom0p2_out */
#define PB6_SCOM0P2_OUT  MCHP_PINMUX(b, 6, 0x2c0, 1, periph)
/* pb6_scom0p3_out */
#define PB6_SCOM0P3_OUT  MCHP_PINMUX(b, 6, 0x2bc, 3, periph)
/* pb6_scom1p0_in */
#define PB6_SCOM1P0_IN   MCHP_PINMUX(b, 6, 0x50, 5, periph)
/* pb6_scom1p0_out */
#define PB6_SCOM1P0_OUT  MCHP_PINMUX(b, 6, 0x2bc, 5, periph)
/* pb6_scom1p1_in */
#define PB6_SCOM1P1_IN   MCHP_PINMUX(b, 6, 0x54, 12, periph)
/* pb6_scom1p1_out */
#define PB6_SCOM1P1_OUT  MCHP_PINMUX(b, 6, 0x2c0, 5, periph)
/* pb6_scom1p2_out */
#define PB6_SCOM1P2_OUT  MCHP_PINMUX(b, 6, 0x2bc, 4, periph)
/* pb6_scom1p3_out */
#define PB6_SCOM1P3_OUT  MCHP_PINMUX(b, 6, 0x2bc, 6, periph)
/* pb6_scom2p0_in */
#define PB6_SCOM2P0_IN   MCHP_PINMUX(b, 6, 0x60, 12, periph)
/* pb6_scom2p0_out */
#define PB6_SCOM2P0_OUT  MCHP_PINMUX(b, 6, 0x2c0, 8, periph)
/* pb6_scom2p2_out */
#define PB6_SCOM2P2_OUT  MCHP_PINMUX(b, 6, 0x2bc, 7, periph)
/* pb6_scom2p3_in */
#define PB6_SCOM2P3_IN   MCHP_PINMUX(b, 6, 0x6c, 5, periph)
/* pb6_scom2p3_out */
#define PB6_SCOM2P3_OUT  MCHP_PINMUX(b, 6, 0x2bc, 8, periph)
/* pb6_scom3p1_out */
#define PB6_SCOM3P1_OUT  MCHP_PINMUX(b, 6, 0x2bc, 10, periph)
/* pb6_scom3p2_in */
#define PB6_SCOM3P2_IN   MCHP_PINMUX(b, 6, 0x78, 5, periph)
/* pb6_scom3p2_out */
#define PB6_SCOM3P2_OUT  MCHP_PINMUX(b, 6, 0x2bc, 9, periph)
/* pb6_scom3p3_in */
#define PB6_SCOM3P3_IN   MCHP_PINMUX(b, 6, 0x7c, 12, periph)
/* pb6_scom3p3_out */
#define PB6_SCOM3P3_OUT  MCHP_PINMUX(b, 6, 0x2c0, 9, periph)
/* pb6_tc0wo0_out */
#define PB6_TC0WO0_OUT   MCHP_PINMUX(b, 6, 0x2bc, 18, periph)
/* pb6_tc0wo1g3_in */
#define PB6_TC0WO1G3_IN  MCHP_PINMUX(b, 6, 0xb8, 5, periph)
/* pb6_tc0wo1g4_in */
#define PB6_TC0WO1G4_IN  MCHP_PINMUX(b, 6, 0xbc, 12, periph)
/* pb6_tc1wo0_out */
#define PB6_TC1WO0_OUT   MCHP_PINMUX(b, 6, 0x2bc, 20, periph)
/* pb6_tc1wo1_out */
