zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz25/pic32cx1012bz25048-pinctrl.h
#define PB6_TC1WO1_OUT   MCHP_PINMUX(b, 6, 0x2c0, 20, periph)
/* pb6_tc2wo0g3_in */
#define PB6_TC2WO0G3_IN  MCHP_PINMUX(b, 6, 0xcc, 5, periph)
/* pb6_tc2wo0_out */
#define PB6_TC2WO0_OUT   MCHP_PINMUX(b, 6, 0x2bc, 21, periph)
/* pb6_tc2wo1g4_in */
#define PB6_TC2WO1G4_IN  MCHP_PINMUX(b, 6, 0xd4, 12, periph)
/* pb6_tc2wo1_out */
#define PB6_TC2WO1_OUT   MCHP_PINMUX(b, 6, 0x2c0, 21, periph)
/* pb6_tc3wo0g3_in */
#define PB6_TC3WO0G3_IN  MCHP_PINMUX(b, 6, 0xdc, 5, periph)
/* pb6_tc3wo0_out */
#define PB6_TC3WO0_OUT   MCHP_PINMUX(b, 6, 0x2bc, 22, periph)
/* pb6_tc3wo1g4_in */
#define PB6_TC3WO1G4_IN  MCHP_PINMUX(b, 6, 0xe4, 12, periph)
/* pb6_tc3wo1_out */
#define PB6_TC3WO1_OUT   MCHP_PINMUX(b, 6, 0x2c0, 22, periph)
/* pb6_tcc0wo0_out */
#define PB6_TCC0WO0_OUT  MCHP_PINMUX(b, 6, 0x2bc, 12, periph)
/* pb6_tcc0wo1_out */
#define PB6_TCC0WO1_OUT  MCHP_PINMUX(b, 6, 0x2c0, 12, periph)
/* pb6_tcc0wo2_out */
#define PB6_TCC0WO2_OUT  MCHP_PINMUX(b, 6, 0x2bc, 11, periph)
/* pb6_tcc0wo3_out */
#define PB6_TCC0WO3_OUT  MCHP_PINMUX(b, 6, 0x2c0, 11, periph)
/* pb6_tcc0wo4_out */
#define PB6_TCC0WO4_OUT  MCHP_PINMUX(b, 6, 0x2bc, 13, periph)
/* pb6_tcc0wo5_out */
#define PB6_TCC0WO5_OUT  MCHP_PINMUX(b, 6, 0x2c0, 13, periph)
/* pb6_tcc1wo0_out */
#define PB6_TCC1WO0_OUT  MCHP_PINMUX(b, 6, 0x2bc, 15, periph)
/* pb6_tcc1wo1_out */
#define PB6_TCC1WO1_OUT  MCHP_PINMUX(b, 6, 0x2c0, 15, periph)
/* pb6_tcc1wo2_out */
#define PB6_TCC1WO2_OUT  MCHP_PINMUX(b, 6, 0x2bc, 14, periph)
/* pb6_tcc1wo3_out */
#define PB6_TCC1WO3_OUT  MCHP_PINMUX(b, 6, 0x2c0, 14, periph)
/* pb6_tcc1wo4_out */
#define PB6_TCC1WO4_OUT  MCHP_PINMUX(b, 6, 0x2bc, 16, periph)
/* pb6_tcc1wo5_out */
#define PB6_TCC1WO5_OUT  MCHP_PINMUX(b, 6, 0x2c0, 16, periph)
/* pb6_tcc2wo0_out */
#define PB6_TCC2WO0_OUT  MCHP_PINMUX(b, 6, 0x2bc, 17, periph)
/* pb6_tcc2wo1_out */
#define PB6_TCC2WO1_OUT  MCHP_PINMUX(b, 6, 0x2c0, 17, periph)
/* pb7_cclin0_in */
#define PB7_CCLIN0_IN    MCHP_PINMUX(b, 7, 0x98, 13, periph)
/* pb7_cclin3_in */
#define PB7_CCLIN3_IN    MCHP_PINMUX(b, 7, 0xa4, 13, periph)
/* pb7_cclout0_out */
#define PB7_CCLOUT0_OUT  MCHP_PINMUX(b, 7, 0x2c4, 28, periph)
/* pb7_cclout1_out */
#define PB7_CCLOUT1_OUT  MCHP_PINMUX(b, 7, 0x2c8, 28, periph)
/* pb7_extint0_in */
#define PB7_EXTINT0_IN   MCHP_PINMUX(b, 7, 0x0, 13, periph)
/* pb7_extint3_in */
#define PB7_EXTINT3_IN   MCHP_PINMUX(b, 7, 0xc, 5, periph)
/* pb7_nmi_in */
#define PB7_NMI_IN       MCHP_PINMUX(b, 7, 0x3c, 5, periph)
/* pb7_qcs_out */
#define PB7_QCS_OUT      MCHP_PINMUX(b, 7, 0x2c4, 24, periph)
/* pb7_qd0_in */
#define PB7_QD0_IN       MCHP_PINMUX(b, 7, 0x84, 5, periph)
/* pb7_qd0_out */
#define PB7_QD0_OUT      MCHP_PINMUX(b, 7, 0x2c8, 27, periph)
/* pb7_qd1_in */
#define PB7_QD1_IN       MCHP_PINMUX(b, 7, 0x88, 13, periph)
/* pb7_qd1_out */
#define PB7_QD1_OUT      MCHP_PINMUX(b, 7, 0x2c4, 27, periph)
/* pb7_qd2_out */
#define PB7_QD2_OUT      MCHP_PINMUX(b, 7, 0x2c4, 26, periph)
/* pb7_qd3_out */
#define PB7_QD3_OUT      MCHP_PINMUX(b, 7, 0x2c4, 25, periph)
/* pb7_qsck_in */
#define PB7_QSCK_IN      MCHP_PINMUX(b, 7, 0x80, 13, periph)
/* pb7_qsck_out */
#define PB7_QSCK_OUT     MCHP_PINMUX(b, 7, 0x2c4, 23, periph)
/* pb7_refi_in */
#define PB7_REFI_IN      MCHP_PINMUX(b, 7, 0x94, 13, periph)
/* pb7_refo1_out */
#define PB7_REFO1_OUT    MCHP_PINMUX(b, 7, 0x2c4, 19, periph)
/* pb7_refo4_out */
#define PB7_REFO4_OUT    MCHP_PINMUX(b, 7, 0x2c8, 19, periph)
/* pb7_scom0p0_out */
#define PB7_SCOM0P0_OUT  MCHP_PINMUX(b, 7, 0x2c8, 3, periph)
/* pb7_scom0p1_out */
#define PB7_SCOM0P1_OUT  MCHP_PINMUX(b, 7, 0x2c4, 3, periph)
/* pb7_scom0p2_in */
#define PB7_SCOM0P2_IN   MCHP_PINMUX(b, 7, 0x48, 5, periph)
/* pb7_scom0p2_out */
#define PB7_SCOM0P2_OUT  MCHP_PINMUX(b, 7, 0x2c4, 2, periph)
/* pb7_scom0p3_in */
#define PB7_SCOM0P3_IN   MCHP_PINMUX(b, 7, 0x4c, 13, periph)
/* pb7_scom0p3_out */
#define PB7_SCOM0P3_OUT  MCHP_PINMUX(b, 7, 0x2c4, 1, periph)
/* pb7_scom1p0_out */
#define PB7_SCOM1P0_OUT  MCHP_PINMUX(b, 7, 0x2c4, 4, periph)
/* pb7_scom1p1_in */
#define PB7_SCOM1P1_IN   MCHP_PINMUX(b, 7, 0x54, 5, periph)
/* pb7_scom1p1_out */
#define PB7_SCOM1P1_OUT  MCHP_PINMUX(b, 7, 0x2c4, 6, periph)
/* pb7_scom1p2_in */
#define PB7_SCOM1P2_IN   MCHP_PINMUX(b, 7, 0x58, 13, periph)
/* pb7_scom1p2_out */
#define PB7_SCOM1P2_OUT  MCHP_PINMUX(b, 7, 0x2c4, 5, periph)
/* pb7_scom1p3_out */
#define PB7_SCOM1P3_OUT  MCHP_PINMUX(b, 7, 0x2c8, 4, periph)
/* pb7_scom2p0_in */
#define PB7_SCOM2P0_IN   MCHP_PINMUX(b, 7, 0x60, 5, periph)
/* pb7_scom2p0_out */
#define PB7_SCOM2P0_OUT  MCHP_PINMUX(b, 7, 0x2c4, 7, periph)
/* pb7_scom2p1_in */
#define PB7_SCOM2P1_IN   MCHP_PINMUX(b, 7, 0x64, 13, periph)
/* pb7_scom2p1_out */
#define PB7_SCOM2P1_OUT  MCHP_PINMUX(b, 7, 0x2c4, 8, periph)
/* pb7_scom2p3_out */
#define PB7_SCOM2P3_OUT  MCHP_PINMUX(b, 7, 0x2c8, 7, periph)
/* pb7_scom3p0_in */
#define PB7_SCOM3P0_IN   MCHP_PINMUX(b, 7, 0x70, 13, periph)
/* pb7_scom3p0_out */
#define PB7_SCOM3P0_OUT  MCHP_PINMUX(b, 7, 0x2c4, 9, periph)
/* pb7_scom3p2_out */
#define PB7_SCOM3P2_OUT  MCHP_PINMUX(b, 7, 0x2c8, 10, periph)
/* pb7_scom3p3_in */
#define PB7_SCOM3P3_IN   MCHP_PINMUX(b, 7, 0x7c, 5, periph)
/* pb7_scom3p3_out */
#define PB7_SCOM3P3_OUT  MCHP_PINMUX(b, 7, 0x2c4, 10, periph)
/* pb7_tc0wo0g1_in */
#define PB7_TC0WO0G1_IN  MCHP_PINMUX(b, 7, 0xb0, 13, periph)
/* pb7_tc0wo0_out */
#define PB7_TC0WO0_OUT   MCHP_PINMUX(b, 7, 0x2c8, 18, periph)
/* pb7_tc0wo1g4_in */
#define PB7_TC0WO1G4_IN  MCHP_PINMUX(b, 7, 0xbc, 5, periph)
/* pb7_tc0wo1_out */
#define PB7_TC0WO1_OUT   MCHP_PINMUX(b, 7, 0x2c4, 18, periph)
/* pb7_tc1wo0g1_in */
#define PB7_TC1WO0G1_IN  MCHP_PINMUX(b, 7, 0xc0, 13, periph)
/* pb7_tc1wo0_out */
#define PB7_TC1WO0_OUT   MCHP_PINMUX(b, 7, 0x2c4, 20, periph)
/* pb7_tc1wo1_out */
#define PB7_TC1WO1_OUT   MCHP_PINMUX(b, 7, 0x2c8, 20, periph)
/* pb7_tc2wo0g1_in */
#define PB7_TC2WO0G1_IN  MCHP_PINMUX(b, 7, 0xc8, 13, periph)
/* pb7_tc2wo0_out */
#define PB7_TC2WO0_OUT   MCHP_PINMUX(b, 7, 0x2c4, 21, periph)
/* pb7_tc2wo1g4_in */
#define PB7_TC2WO1G4_IN  MCHP_PINMUX(b, 7, 0xd4, 5, periph)
/* pb7_tc2wo1_out */
#define PB7_TC2WO1_OUT   MCHP_PINMUX(b, 7, 0x2c8, 21, periph)
/* pb7_tc3wo0g1_in */
#define PB7_TC3WO0G1_IN  MCHP_PINMUX(b, 7, 0xd8, 13, periph)
/* pb7_tc3wo0_out */
#define PB7_TC3WO0_OUT   MCHP_PINMUX(b, 7, 0x2c4, 22, periph)
/* pb7_tc3wo1g4_in */
#define PB7_TC3WO1G4_IN  MCHP_PINMUX(b, 7, 0xe4, 5, periph)
/* pb7_tc3wo1_out */
#define PB7_TC3WO1_OUT   MCHP_PINMUX(b, 7, 0x2c8, 22, periph)
/* pb7_tcc0wo0_out */
#define PB7_TCC0WO0_OUT  MCHP_PINMUX(b, 7, 0x2c4, 11, periph)
/* pb7_tcc0wo1_out */
#define PB7_TCC0WO1_OUT  MCHP_PINMUX(b, 7, 0x2c8, 12, periph)
/* pb7_tcc0wo2_out */
#define PB7_TCC0WO2_OUT  MCHP_PINMUX(b, 7, 0x2c4, 13, periph)
/* pb7_tcc0wo3_out */
#define PB7_TCC0WO3_OUT  MCHP_PINMUX(b, 7, 0x2c8, 11, periph)
/* pb7_tcc0wo4_out */
#define PB7_TCC0WO4_OUT  MCHP_PINMUX(b, 7, 0x2c4, 12, periph)
/* pb7_tcc0wo5_out */
#define PB7_TCC0WO5_OUT  MCHP_PINMUX(b, 7, 0x2c8, 13, periph)
/* pb7_tcc1wo0_out */
#define PB7_TCC1WO0_OUT  MCHP_PINMUX(b, 7, 0x2c4, 14, periph)
/* pb7_tcc1wo1_out */
#define PB7_TCC1WO1_OUT  MCHP_PINMUX(b, 7, 0x2c8, 15, periph)
/* pb7_tcc1wo2_out */
#define PB7_TCC1WO2_OUT  MCHP_PINMUX(b, 7, 0x2c4, 16, periph)
/* pb7_tcc1wo3_out */
#define PB7_TCC1WO3_OUT  MCHP_PINMUX(b, 7, 0x2c8, 14, periph)
/* pb7_tcc1wo4_out */
#define PB7_TCC1WO4_OUT  MCHP_PINMUX(b, 7, 0x2c4, 15, periph)
/* pb7_tcc1wo5_out */
#define PB7_TCC1WO5_OUT  MCHP_PINMUX(b, 7, 0x2c8, 16, periph)
/* pb7_tcc2wo0_out */
#define PB7_TCC2WO0_OUT  MCHP_PINMUX(b, 7, 0x2c4, 17, periph)
/* pb7_tcc2wo1_out */
#define PB7_TCC2WO1_OUT  MCHP_PINMUX(b, 7, 0x2c8, 17, periph)
/* pb8_cclin0_in */
#define PB8_CCLIN0_IN    MCHP_PINMUX(b, 8, 0x98, 6, periph)
/* pb8_cclin1_in */
#define PB8_CCLIN1_IN    MCHP_PINMUX(b, 8, 0x9c, 13, periph)
/* pb8_cclin3_in */
#define PB8_CCLIN3_IN    MCHP_PINMUX(b, 8, 0xa4, 6, periph)
/* pb8_cclin4_in */
#define PB8_CCLIN4_IN    MCHP_PINMUX(b, 8, 0xa8, 13, periph)
/* pb8_cclout0_out */
#define PB8_CCLOUT0_OUT  MCHP_PINMUX(b, 8, 0x2cc, 28, periph)
/* pb8_cclout1_out */
#define PB8_CCLOUT1_OUT  MCHP_PINMUX(b, 8, 0x2d0, 28, periph)
/* pb8_extint0_in */
#define PB8_EXTINT0_IN   MCHP_PINMUX(b, 8, 0x0, 6, periph)
/* pb8_extint1_in */
#define PB8_EXTINT1_IN   MCHP_PINMUX(b, 8, 0x4, 13, periph)
/* pb8_qcs_out */
#define PB8_QCS_OUT      MCHP_PINMUX(b, 8, 0x2cc, 24, periph)
/* pb8_qd0_out */
#define PB8_QD0_OUT      MCHP_PINMUX(b, 8, 0x2d0, 25, periph)
/* pb8_qd1_in */
#define PB8_QD1_IN       MCHP_PINMUX(b, 8, 0x88, 6, periph)
/* pb8_qd1_out */
#define PB8_QD1_OUT      MCHP_PINMUX(b, 8, 0x2cc, 27, periph)
/* pb8_qd2_in */
#define PB8_QD2_IN       MCHP_PINMUX(b, 8, 0x8c, 13, periph)
/* pb8_qd2_out */
#define PB8_QD2_OUT      MCHP_PINMUX(b, 8, 0x2cc, 26, periph)
/* pb8_qd3_out */
#define PB8_QD3_OUT      MCHP_PINMUX(b, 8, 0x2cc, 25, periph)
/* pb8_qsck_in */
#define PB8_QSCK_IN      MCHP_PINMUX(b, 8, 0x80, 6, periph)
/* pb8_qsck_out */
#define PB8_QSCK_OUT     MCHP_PINMUX(b, 8, 0x2cc, 23, periph)
/* pb8_refi_in */
#define PB8_REFI_IN      MCHP_PINMUX(b, 8, 0x94, 6, periph)
/* pb8_refo1_out */
#define PB8_REFO1_OUT    MCHP_PINMUX(b, 8, 0x2cc, 19, periph)
/* pb8_refo2_out */
#define PB8_REFO2_OUT    MCHP_PINMUX(b, 8, 0x2d0, 19, periph)
/* pb8_scom0p0_in */
#define PB8_SCOM0P0_IN   MCHP_PINMUX(b, 8, 0x40, 13, periph)
/* pb8_scom0p0_out */
#define PB8_SCOM0P0_OUT  MCHP_PINMUX(b, 8, 0x2d0, 1, periph)
/* pb8_scom0p1_out */
#define PB8_SCOM0P1_OUT  MCHP_PINMUX(b, 8, 0x2cc, 3, periph)
/* pb8_scom0p2_out */
#define PB8_SCOM0P2_OUT  MCHP_PINMUX(b, 8, 0x2cc, 2, periph)
/* pb8_scom0p3_in */
#define PB8_SCOM0P3_IN   MCHP_PINMUX(b, 8, 0x4c, 6, periph)
/* pb8_scom0p3_out */
#define PB8_SCOM0P3_OUT  MCHP_PINMUX(b, 8, 0x2cc, 1, periph)
/* pb8_scom1p0_out */
#define PB8_SCOM1P0_OUT  MCHP_PINMUX(b, 8, 0x2cc, 4, periph)
/* pb8_scom1p1_out */
#define PB8_SCOM1P1_OUT  MCHP_PINMUX(b, 8, 0x2cc, 6, periph)
/* pb8_scom1p2_in */
#define PB8_SCOM1P2_IN   MCHP_PINMUX(b, 8, 0x58, 6, periph)
/* pb8_scom1p2_out */
#define PB8_SCOM1P2_OUT  MCHP_PINMUX(b, 8, 0x2cc, 5, periph)
/* pb8_scom1p3_in */
#define PB8_SCOM1P3_IN   MCHP_PINMUX(b, 8, 0x5c, 13, periph)
/* pb8_scom1p3_out */
#define PB8_SCOM1P3_OUT  MCHP_PINMUX(b, 8, 0x2d0, 5, periph)
/* pb8_scom2p0_out */
#define PB8_SCOM2P0_OUT  MCHP_PINMUX(b, 8, 0x2cc, 7, periph)
/* pb8_scom2p1_in */
#define PB8_SCOM2P1_IN   MCHP_PINMUX(b, 8, 0x64, 6, periph)
/* pb8_scom2p1_out */
#define PB8_SCOM2P1_OUT  MCHP_PINMUX(b, 8, 0x2cc, 8, periph)
/* pb8_scom2p2_in */
#define PB8_SCOM2P2_IN   MCHP_PINMUX(b, 8, 0x68, 13, periph)
/* pb8_scom2p2_out */
#define PB8_SCOM2P2_OUT  MCHP_PINMUX(b, 8, 0x2d0, 8, periph)
/* pb8_scom3p0_in */
#define PB8_SCOM3P0_IN   MCHP_PINMUX(b, 8, 0x70, 6, periph)
/* pb8_scom3p0_out */
#define PB8_SCOM3P0_OUT  MCHP_PINMUX(b, 8, 0x2cc, 9, periph)
/* pb8_scom3p1_in */
#define PB8_SCOM3P1_IN   MCHP_PINMUX(b, 8, 0x74, 13, periph)
/* pb8_scom3p1_out */
#define PB8_SCOM3P1_OUT  MCHP_PINMUX(b, 8, 0x2d0, 9, periph)
/* pb8_scom3p3_out */
#define PB8_SCOM3P3_OUT  MCHP_PINMUX(b, 8, 0x2cc, 10, periph)
/* pb8_tc0wo0g1_in */
#define PB8_TC0WO0G1_IN  MCHP_PINMUX(b, 8, 0xb0, 6, periph)
/* pb8_tc0wo0g2_in */
#define PB8_TC0WO0G2_IN  MCHP_PINMUX(b, 8, 0xb4, 13, periph)
/* pb8_tc0wo1_out */
#define PB8_TC0WO1_OUT   MCHP_PINMUX(b, 8, 0x2cc, 18, periph)
/* pb8_tc1wo0g1_in */
#define PB8_TC1WO0G1_IN  MCHP_PINMUX(b, 8, 0xc0, 6, periph)
/* pb8_tc1wo0_out */
#define PB8_TC1WO0_OUT   MCHP_PINMUX(b, 8, 0x2cc, 20, periph)
/* pb8_tc1wo1g2_in */
#define PB8_TC1WO1G2_IN  MCHP_PINMUX(b, 8, 0xc4, 13, periph)
/* pb8_tc1wo1_out */
#define PB8_TC1WO1_OUT   MCHP_PINMUX(b, 8, 0x2d0, 20, periph)
/* pb8_tc2wo0g1_in */
#define PB8_TC2WO0G1_IN  MCHP_PINMUX(b, 8, 0xc8, 6, periph)
/* pb8_tc2wo0_out */
#define PB8_TC2WO0_OUT   MCHP_PINMUX(b, 8, 0x2cc, 21, periph)
/* pb8_tc2wo1g2_in */
#define PB8_TC2WO1G2_IN  MCHP_PINMUX(b, 8, 0xd0, 13, periph)
/* pb8_tc2wo1_out */
#define PB8_TC2WO1_OUT   MCHP_PINMUX(b, 8, 0x2d0, 21, periph)
/* pb8_tc3wo0g1_in */
#define PB8_TC3WO0G1_IN  MCHP_PINMUX(b, 8, 0xd8, 6, periph)
/* pb8_tc3wo0_out */
#define PB8_TC3WO0_OUT   MCHP_PINMUX(b, 8, 0x2cc, 22, periph)
/* pb8_tc3wo1g2_in */
#define PB8_TC3WO1G2_IN  MCHP_PINMUX(b, 8, 0xe0, 13, periph)
/* pb8_tc3wo1_out */
#define PB8_TC3WO1_OUT   MCHP_PINMUX(b, 8, 0x2d0, 22, periph)
/* pb8_tcc0wo0_out */
#define PB8_TCC0WO0_OUT  MCHP_PINMUX(b, 8, 0x2cc, 11, periph)
/* pb8_tcc0wo1_out */
#define PB8_TCC0WO1_OUT  MCHP_PINMUX(b, 8, 0x2d0, 11, periph)
/* pb8_tcc0wo2_out */
#define PB8_TCC0WO2_OUT  MCHP_PINMUX(b, 8, 0x2cc, 13, periph)
/* pb8_tcc0wo3_out */
#define PB8_TCC0WO3_OUT  MCHP_PINMUX(b, 8, 0x2d0, 13, periph)
/* pb8_tcc0wo4_out */
#define PB8_TCC0WO4_OUT  MCHP_PINMUX(b, 8, 0x2cc, 12, periph)
/* pb8_tcc0wo5_out */
#define PB8_TCC0WO5_OUT  MCHP_PINMUX(b, 8, 0x2d0, 12, periph)
/* pb8_tcc1wo0_out */
#define PB8_TCC1WO0_OUT  MCHP_PINMUX(b, 8, 0x2cc, 14, periph)
/* pb8_tcc1wo1_out */
#define PB8_TCC1WO1_OUT  MCHP_PINMUX(b, 8, 0x2d0, 14, periph)
/* pb8_tcc1wo2_out */
#define PB8_TCC1WO2_OUT  MCHP_PINMUX(b, 8, 0x2cc, 16, periph)
/* pb8_tcc1wo3_out */
#define PB8_TCC1WO3_OUT  MCHP_PINMUX(b, 8, 0x2d0, 16, periph)
/* pb8_tcc1wo4_out */
#define PB8_TCC1WO4_OUT  MCHP_PINMUX(b, 8, 0x2cc, 15, periph)
/* pb8_tcc1wo5_out */
#define PB8_TCC1WO5_OUT  MCHP_PINMUX(b, 8, 0x2d0, 15, periph)
/* pb8_tcc2wo0_out */
#define PB8_TCC2WO0_OUT  MCHP_PINMUX(b, 8, 0x2cc, 17, periph)
/* pb8_tcc2wo1_out */
#define PB8_TCC2WO1_OUT  MCHP_PINMUX(b, 8, 0x2d0, 17, periph)
/* pb9_cclin1_in */
#define PB9_CCLIN1_IN    MCHP_PINMUX(b, 9, 0x9c, 6, periph)
/* pb9_cclin2_in */
#define PB9_CCLIN2_IN    MCHP_PINMUX(b, 9, 0xa0, 13, periph)
/* pb9_cclin4_in */
#define PB9_CCLIN4_IN    MCHP_PINMUX(b, 9, 0xa8, 6, periph)
/* pb9_cclin5_in */
#define PB9_CCLIN5_IN    MCHP_PINMUX(b, 9, 0xac, 13, periph)
/* pb9_cclout0_out */
#define PB9_CCLOUT0_OUT  MCHP_PINMUX(b, 9, 0x2d8, 28, periph)
/* pb9_cclout1_out */
#define PB9_CCLOUT1_OUT  MCHP_PINMUX(b, 9, 0x2d4, 28, periph)
/* pb9_extint1_in */
#define PB9_EXTINT1_IN   MCHP_PINMUX(b, 9, 0x4, 6, periph)
/* pb9_extint2_in */
#define PB9_EXTINT2_IN   MCHP_PINMUX(b, 9, 0x8, 13, periph)
/* pb9_qcs_out */
#define PB9_QCS_OUT      MCHP_PINMUX(b, 9, 0x2d4, 24, periph)
/* pb9_qd0_out */
#define PB9_QD0_OUT      MCHP_PINMUX(b, 9, 0x2d4, 25, periph)
/* pb9_qd1_out */
#define PB9_QD1_OUT      MCHP_PINMUX(b, 9, 0x2d8, 25, periph)
/* pb9_qd2_in */
#define PB9_QD2_IN       MCHP_PINMUX(b, 9, 0x8c, 6, periph)
/* pb9_qd2_out */
#define PB9_QD2_OUT      MCHP_PINMUX(b, 9, 0x2d4, 27, periph)
/* pb9_qd3_in */
#define PB9_QD3_IN       MCHP_PINMUX(b, 9, 0x90, 13, periph)
/* pb9_qd3_out */
#define PB9_QD3_OUT      MCHP_PINMUX(b, 9, 0x2d4, 26, periph)
/* pb9_qsck_out */
#define PB9_QSCK_OUT     MCHP_PINMUX(b, 9, 0x2d4, 23, periph)
/* pb9_refo2_out */
#define PB9_REFO2_OUT    MCHP_PINMUX(b, 9, 0x2d4, 19, periph)
/* pb9_refo3_out */
#define PB9_REFO3_OUT    MCHP_PINMUX(b, 9, 0x2d8, 19, periph)
/* pb9_scom0p0_in */
#define PB9_SCOM0P0_IN   MCHP_PINMUX(b, 9, 0x40, 6, periph)
/* pb9_scom0p0_out */
#define PB9_SCOM0P0_OUT  MCHP_PINMUX(b, 9, 0x2d4, 1, periph)
/* pb9_scom0p1_in */
#define PB9_SCOM0P1_IN   MCHP_PINMUX(b, 9, 0x44, 13, periph)
/* pb9_scom0p1_out */
#define PB9_SCOM0P1_OUT  MCHP_PINMUX(b, 9, 0x2d8, 1, periph)
/* pb9_scom0p2_out */
#define PB9_SCOM0P2_OUT  MCHP_PINMUX(b, 9, 0x2d4, 3, periph)
/* pb9_scom0p3_out */
#define PB9_SCOM0P3_OUT  MCHP_PINMUX(b, 9, 0x2d4, 2, periph)
/* pb9_scom1p0_in */
#define PB9_SCOM1P0_IN   MCHP_PINMUX(b, 9, 0x50, 13, periph)
/* pb9_scom1p0_out */
#define PB9_SCOM1P0_OUT  MCHP_PINMUX(b, 9, 0x2d8, 5, periph)
/* pb9_scom1p1_out */
#define PB9_SCOM1P1_OUT  MCHP_PINMUX(b, 9, 0x2d4, 4, periph)
/* pb9_scom1p2_out */
#define PB9_SCOM1P2_OUT  MCHP_PINMUX(b, 9, 0x2d4, 6, periph)
/* pb9_scom1p3_in */
#define PB9_SCOM1P3_IN   MCHP_PINMUX(b, 9, 0x5c, 6, periph)
/* pb9_scom1p3_out */
#define PB9_SCOM1P3_OUT  MCHP_PINMUX(b, 9, 0x2d4, 5, periph)
/* pb9_scom2p1_out */
#define PB9_SCOM2P1_OUT  MCHP_PINMUX(b, 9, 0x2d4, 7, periph)
/* pb9_scom2p2_in */
#define PB9_SCOM2P2_IN   MCHP_PINMUX(b, 9, 0x68, 6, periph)
/* pb9_scom2p2_out */
#define PB9_SCOM2P2_OUT  MCHP_PINMUX(b, 9, 0x2d4, 8, periph)
/* pb9_scom2p3_in */
#define PB9_SCOM2P3_IN   MCHP_PINMUX(b, 9, 0x6c, 13, periph)
/* pb9_scom2p3_out */
#define PB9_SCOM2P3_OUT  MCHP_PINMUX(b, 9, 0x2d8, 8, periph)
/* pb9_scom3p0_out */
#define PB9_SCOM3P0_OUT  MCHP_PINMUX(b, 9, 0x2d4, 10, periph)
/* pb9_scom3p1_in */
#define PB9_SCOM3P1_IN   MCHP_PINMUX(b, 9, 0x74, 6, periph)
/* pb9_scom3p1_out */
#define PB9_SCOM3P1_OUT  MCHP_PINMUX(b, 9, 0x2d4, 9, periph)
/* pb9_scom3p2_in */
#define PB9_SCOM3P2_IN   MCHP_PINMUX(b, 9, 0x78, 13, periph)
/* pb9_scom3p2_out */
#define PB9_SCOM3P2_OUT  MCHP_PINMUX(b, 9, 0x2d8, 9, periph)
/* pb9_tc0wo0g2_in */
#define PB9_TC0WO0G2_IN  MCHP_PINMUX(b, 9, 0xb4, 6, periph)
/* pb9_tc0wo0_out */
#define PB9_TC0WO0_OUT   MCHP_PINMUX(b, 9, 0x2d8, 18, periph)
/* pb9_tc0wo1g3_in */
#define PB9_TC0WO1G3_IN  MCHP_PINMUX(b, 9, 0xb8, 13, periph)
/* pb9_tc0wo1_out */
#define PB9_TC0WO1_OUT   MCHP_PINMUX(b, 9, 0x2d4, 18, periph)
/* pb9_tc1wo0_out */
#define PB9_TC1WO0_OUT   MCHP_PINMUX(b, 9, 0x2d8, 20, periph)
/* pb9_tc1wo1g2_in */
#define PB9_TC1WO1G2_IN  MCHP_PINMUX(b, 9, 0xc4, 6, periph)
/* pb9_tc1wo1_out */
#define PB9_TC1WO1_OUT   MCHP_PINMUX(b, 9, 0x2d4, 20, periph)
/* pb9_tc2wo0g3_in */
#define PB9_TC2WO0G3_IN  MCHP_PINMUX(b, 9, 0xcc, 13, periph)
/* pb9_tc2wo0_out */
#define PB9_TC2WO0_OUT   MCHP_PINMUX(b, 9, 0x2d8, 21, periph)
/* pb9_tc2wo1g2_in */
#define PB9_TC2WO1G2_IN  MCHP_PINMUX(b, 9, 0xd0, 6, periph)
/* pb9_tc2wo1_out */
#define PB9_TC2WO1_OUT   MCHP_PINMUX(b, 9, 0x2d4, 21, periph)
/* pb9_tc3wo0g3_in */
#define PB9_TC3WO0G3_IN  MCHP_PINMUX(b, 9, 0xdc, 13, periph)
/* pb9_tc3wo0_out */
#define PB9_TC3WO0_OUT   MCHP_PINMUX(b, 9, 0x2d8, 22, periph)
/* pb9_tc3wo1g2_in */
#define PB9_TC3WO1G2_IN  MCHP_PINMUX(b, 9, 0xe0, 6, periph)
/* pb9_tc3wo1_out */
#define PB9_TC3WO1_OUT   MCHP_PINMUX(b, 9, 0x2d4, 22, periph)
/* pb9_tcc0wo0_out */
#define PB9_TCC0WO0_OUT  MCHP_PINMUX(b, 9, 0x2d8, 12, periph)
/* pb9_tcc0wo1_out */
#define PB9_TCC0WO1_OUT  MCHP_PINMUX(b, 9, 0x2d4, 11, periph)
/* pb9_tcc0wo2_out */
#define PB9_TCC0WO2_OUT  MCHP_PINMUX(b, 9, 0x2d8, 11, periph)
/* pb9_tcc0wo3_out */
#define PB9_TCC0WO3_OUT  MCHP_PINMUX(b, 9, 0x2d4, 13, periph)
/* pb9_tcc0wo4_out */
#define PB9_TCC0WO4_OUT  MCHP_PINMUX(b, 9, 0x2d8, 13, periph)
/* pb9_tcc0wo5_out */
#define PB9_TCC0WO5_OUT  MCHP_PINMUX(b, 9, 0x2d4, 12, periph)
/* pb9_tcc1wo0_out */
#define PB9_TCC1WO0_OUT  MCHP_PINMUX(b, 9, 0x2d8, 15, periph)
/* pb9_tcc1wo1_out */
#define PB9_TCC1WO1_OUT  MCHP_PINMUX(b, 9, 0x2d4, 14, periph)
/* pb9_tcc1wo2_out */
#define PB9_TCC1WO2_OUT  MCHP_PINMUX(b, 9, 0x2d8, 14, periph)
/* pb9_tcc1wo3_out */
#define PB9_TCC1WO3_OUT  MCHP_PINMUX(b, 9, 0x2d4, 16, periph)
/* pb9_tcc1wo4_out */
#define PB9_TCC1WO4_OUT  MCHP_PINMUX(b, 9, 0x2d8, 16, periph)
/* pb9_tcc1wo5_out */
#define PB9_TCC1WO5_OUT  MCHP_PINMUX(b, 9, 0x2d4, 15, periph)
/* pb9_tcc2wo0_out */
#define PB9_TCC2WO0_OUT  MCHP_PINMUX(b, 9, 0x2d8, 17, periph)
/* pb9_tcc2wo1_out */
#define PB9_TCC2WO1_OUT  MCHP_PINMUX(b, 9, 0x2d4, 17, periph)
/* pb10_cclin2_in */
#define PB10_CCLIN2_IN   MCHP_PINMUX(b, 10, 0xa0, 6, periph)
/* pb10_cclin5_in */
#define PB10_CCLIN5_IN   MCHP_PINMUX(b, 10, 0xac, 6, periph)
/* pb10_cclout0_out */
#define PB10_CCLOUT0_OUT MCHP_PINMUX(b, 10, 0x2dc, 28, periph)
/* pb10_cclout1_out */
#define PB10_CCLOUT1_OUT MCHP_PINMUX(b, 10, 0x2e0, 28, periph)
/* pb10_extint2_in */
#define PB10_EXTINT2_IN  MCHP_PINMUX(b, 10, 0x8, 6, periph)
/* pb10_extint3_in */
#define PB10_EXTINT3_IN  MCHP_PINMUX(b, 10, 0xc, 13, periph)
/* pb10_nmi_in */
#define PB10_NMI_IN      MCHP_PINMUX(b, 10, 0x3c, 13, periph)
/* pb10_qcs_out */
#define PB10_QCS_OUT     MCHP_PINMUX(b, 10, 0x2dc, 24, periph)
/* pb10_qd0_in */
#define PB10_QD0_IN      MCHP_PINMUX(b, 10, 0x84, 13, periph)
/* pb10_qd0_out */
#define PB10_QD0_OUT     MCHP_PINMUX(b, 10, 0x2dc, 26, periph)
/* pb10_qd1_out */
#define PB10_QD1_OUT     MCHP_PINMUX(b, 10, 0x2dc, 25, periph)
/* pb10_qd2_out */
#define PB10_QD2_OUT     MCHP_PINMUX(b, 10, 0x2e0, 25, periph)
/* pb10_qd3_in */
#define PB10_QD3_IN      MCHP_PINMUX(b, 10, 0x90, 6, periph)
/* pb10_qd3_out */
#define PB10_QD3_OUT     MCHP_PINMUX(b, 10, 0x2dc, 27, periph)
/* pb10_qsck_out */
#define PB10_QSCK_OUT    MCHP_PINMUX(b, 10, 0x2dc, 23, periph)
/* pb10_refo3_out */
#define PB10_REFO3_OUT   MCHP_PINMUX(b, 10, 0x2dc, 19, periph)
/* pb10_refo4_out */
#define PB10_REFO4_OUT   MCHP_PINMUX(b, 10, 0x2e0, 19, periph)
/* pb10_scom0p0_out */
#define PB10_SCOM0P0_OUT MCHP_PINMUX(b, 10, 0x2dc, 2, periph)
/* pb10_scom0p1_in */
#define PB10_SCOM0P1_IN  MCHP_PINMUX(b, 10, 0x44, 6, periph)
/* pb10_scom0p1_out */
#define PB10_SCOM0P1_OUT MCHP_PINMUX(b, 10, 0x2dc, 1, periph)
/* pb10_scom0p2_in */
#define PB10_SCOM0P2_IN  MCHP_PINMUX(b, 10, 0x48, 13, periph)
/* pb10_scom0p2_out */
#define PB10_SCOM0P2_OUT MCHP_PINMUX(b, 10, 0x2e0, 1, periph)
/* pb10_scom0p3_out */
#define PB10_SCOM0P3_OUT MCHP_PINMUX(b, 10, 0x2dc, 3, periph)
/* pb10_scom1p0_in */
#define PB10_SCOM1P0_IN  MCHP_PINMUX(b, 10, 0x50, 6, periph)
/* pb10_scom1p0_out */
#define PB10_SCOM1P0_OUT MCHP_PINMUX(b, 10, 0x2dc, 5, periph)
/* pb10_scom1p1_in */
#define PB10_SCOM1P1_IN  MCHP_PINMUX(b, 10, 0x54, 13, periph)
/* pb10_scom1p1_out */
#define PB10_SCOM1P1_OUT MCHP_PINMUX(b, 10, 0x2e0, 5, periph)
/* pb10_scom1p2_out */
#define PB10_SCOM1P2_OUT MCHP_PINMUX(b, 10, 0x2dc, 4, periph)
/* pb10_scom1p3_out */
#define PB10_SCOM1P3_OUT MCHP_PINMUX(b, 10, 0x2dc, 6, periph)
/* pb10_scom2p0_in */
#define PB10_SCOM2P0_IN  MCHP_PINMUX(b, 10, 0x60, 13, periph)
/* pb10_scom2p0_out */
#define PB10_SCOM2P0_OUT MCHP_PINMUX(b, 10, 0x2e0, 8, periph)
/* pb10_scom2p2_out */
#define PB10_SCOM2P2_OUT MCHP_PINMUX(b, 10, 0x2dc, 7, periph)
/* pb10_scom2p3_in */
#define PB10_SCOM2P3_IN  MCHP_PINMUX(b, 10, 0x6c, 6, periph)
/* pb10_scom2p3_out */
#define PB10_SCOM2P3_OUT MCHP_PINMUX(b, 10, 0x2dc, 8, periph)
/* pb10_scom3p1_out */
#define PB10_SCOM3P1_OUT MCHP_PINMUX(b, 10, 0x2dc, 10, periph)
/* pb10_scom3p2_in */
#define PB10_SCOM3P2_IN  MCHP_PINMUX(b, 10, 0x78, 6, periph)
/* pb10_scom3p2_out */
#define PB10_SCOM3P2_OUT MCHP_PINMUX(b, 10, 0x2dc, 9, periph)
/* pb10_scom3p3_in */
#define PB10_SCOM3P3_IN  MCHP_PINMUX(b, 10, 0x7c, 13, periph)
/* pb10_scom3p3_out */
#define PB10_SCOM3P3_OUT MCHP_PINMUX(b, 10, 0x2e0, 9, periph)
/* pb10_tc0wo0_out */
#define PB10_TC0WO0_OUT  MCHP_PINMUX(b, 10, 0x2dc, 18, periph)
/* pb10_tc0wo1g3_in */
#define PB10_TC0WO1G3_IN MCHP_PINMUX(b, 10, 0xb8, 6, periph)
/* pb10_tc0wo1g4_in */
#define PB10_TC0WO1G4_IN MCHP_PINMUX(b, 10, 0xbc, 13, periph)
/* pb10_tc1wo0_out */
#define PB10_TC1WO0_OUT  MCHP_PINMUX(b, 10, 0x2dc, 20, periph)
/* pb10_tc1wo1_out */
#define PB10_TC1WO1_OUT  MCHP_PINMUX(b, 10, 0x2e0, 20, periph)
/* pb10_tc2wo0g3_in */
#define PB10_TC2WO0G3_IN MCHP_PINMUX(b, 10, 0xcc, 6, periph)
/* pb10_tc2wo0_out */
#define PB10_TC2WO0_OUT  MCHP_PINMUX(b, 10, 0x2dc, 21, periph)
/* pb10_tc2wo1g4_in */
#define PB10_TC2WO1G4_IN MCHP_PINMUX(b, 10, 0xd4, 13, periph)
/* pb10_tc2wo1_out */
#define PB10_TC2WO1_OUT  MCHP_PINMUX(b, 10, 0x2e0, 21, periph)
/* pb10_tc3wo0g3_in */
#define PB10_TC3WO0G3_IN MCHP_PINMUX(b, 10, 0xdc, 6, periph)
/* pb10_tc3wo0_out */
#define PB10_TC3WO0_OUT  MCHP_PINMUX(b, 10, 0x2dc, 22, periph)
/* pb10_tc3wo1g4_in */
#define PB10_TC3WO1G4_IN MCHP_PINMUX(b, 10, 0xe4, 13, periph)
/* pb10_tc3wo1_out */
#define PB10_TC3WO1_OUT  MCHP_PINMUX(b, 10, 0x2e0, 22, periph)
/* pb10_tcc0wo0_out */
#define PB10_TCC0WO0_OUT MCHP_PINMUX(b, 10, 0x2dc, 12, periph)
/* pb10_tcc0wo1_out */
#define PB10_TCC0WO1_OUT MCHP_PINMUX(b, 10, 0x2e0, 12, periph)
/* pb10_tcc0wo2_out */
#define PB10_TCC0WO2_OUT MCHP_PINMUX(b, 10, 0x2dc, 11, periph)
/* pb10_tcc0wo3_out */
#define PB10_TCC0WO3_OUT MCHP_PINMUX(b, 10, 0x2e0, 11, periph)
/* pb10_tcc0wo4_out */
#define PB10_TCC0WO4_OUT MCHP_PINMUX(b, 10, 0x2dc, 13, periph)
/* pb10_tcc0wo5_out */
