zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz25/pic32cx1012bz25048-pinctrl.h
#define PB10_TCC0WO5_OUT MCHP_PINMUX(b, 10, 0x2e0, 13, periph)
/* pb10_tcc1wo0_out */
#define PB10_TCC1WO0_OUT MCHP_PINMUX(b, 10, 0x2dc, 15, periph)
/* pb10_tcc1wo1_out */
#define PB10_TCC1WO1_OUT MCHP_PINMUX(b, 10, 0x2e0, 15, periph)
/* pb10_tcc1wo2_out */
#define PB10_TCC1WO2_OUT MCHP_PINMUX(b, 10, 0x2dc, 14, periph)
/* pb10_tcc1wo3_out */
#define PB10_TCC1WO3_OUT MCHP_PINMUX(b, 10, 0x2e0, 14, periph)
/* pb10_tcc1wo4_out */
#define PB10_TCC1WO4_OUT MCHP_PINMUX(b, 10, 0x2dc, 16, periph)
/* pb10_tcc1wo5_out */
#define PB10_TCC1WO5_OUT MCHP_PINMUX(b, 10, 0x2e0, 16, periph)
/* pb10_tcc2wo0_out */
#define PB10_TCC2WO0_OUT MCHP_PINMUX(b, 10, 0x2dc, 17, periph)
/* pb10_tcc2wo1_out */
#define PB10_TCC2WO1_OUT MCHP_PINMUX(b, 10, 0x2e0, 17, periph)
/* pb11_cclin0_in */
#define PB11_CCLIN0_IN   MCHP_PINMUX(b, 11, 0x98, 14, periph)
/* pb11_cclin3_in */
#define PB11_CCLIN3_IN   MCHP_PINMUX(b, 11, 0xa4, 14, periph)
/* pb11_cclout0_out */
#define PB11_CCLOUT0_OUT MCHP_PINMUX(b, 11, 0x2e4, 28, periph)
/* pb11_cclout1_out */
#define PB11_CCLOUT1_OUT MCHP_PINMUX(b, 11, 0x2e8, 28, periph)
/* pb11_extint0_in */
#define PB11_EXTINT0_IN  MCHP_PINMUX(b, 11, 0x0, 14, periph)
/* pb11_extint3_in */
#define PB11_EXTINT3_IN  MCHP_PINMUX(b, 11, 0xc, 6, periph)
/* pb11_nmi_in */
#define PB11_NMI_IN      MCHP_PINMUX(b, 11, 0x3c, 6, periph)
/* pb11_qcs_out */
#define PB11_QCS_OUT     MCHP_PINMUX(b, 11, 0x2e4, 24, periph)
/* pb11_qd0_in */
#define PB11_QD0_IN      MCHP_PINMUX(b, 11, 0x84, 6, periph)
/* pb11_qd0_out */
#define PB11_QD0_OUT     MCHP_PINMUX(b, 11, 0x2e8, 27, periph)
/* pb11_qd1_in */
#define PB11_QD1_IN      MCHP_PINMUX(b, 11, 0x88, 14, periph)
/* pb11_qd1_out */
#define PB11_QD1_OUT     MCHP_PINMUX(b, 11, 0x2e4, 27, periph)
/* pb11_qd2_out */
#define PB11_QD2_OUT     MCHP_PINMUX(b, 11, 0x2e4, 26, periph)
/* pb11_qd3_out */
#define PB11_QD3_OUT     MCHP_PINMUX(b, 11, 0x2e4, 25, periph)
/* pb11_qsck_in */
#define PB11_QSCK_IN     MCHP_PINMUX(b, 11, 0x80, 14, periph)
/* pb11_qsck_out */
#define PB11_QSCK_OUT    MCHP_PINMUX(b, 11, 0x2e4, 23, periph)
/* pb11_refi_in */
#define PB11_REFI_IN     MCHP_PINMUX(b, 11, 0x94, 14, periph)
/* pb11_refo1_out */
#define PB11_REFO1_OUT   MCHP_PINMUX(b, 11, 0x2e4, 19, periph)
/* pb11_refo4_out */
#define PB11_REFO4_OUT   MCHP_PINMUX(b, 11, 0x2e8, 19, periph)
/* pb11_scom0p0_out */
#define PB11_SCOM0P0_OUT MCHP_PINMUX(b, 11, 0x2e8, 3, periph)
/* pb11_scom0p1_out */
#define PB11_SCOM0P1_OUT MCHP_PINMUX(b, 11, 0x2e4, 3, periph)
/* pb11_scom0p2_in */
#define PB11_SCOM0P2_IN  MCHP_PINMUX(b, 11, 0x48, 6, periph)
/* pb11_scom0p2_out */
#define PB11_SCOM0P2_OUT MCHP_PINMUX(b, 11, 0x2e4, 2, periph)
/* pb11_scom0p3_in */
#define PB11_SCOM0P3_IN  MCHP_PINMUX(b, 11, 0x4c, 14, periph)
/* pb11_scom0p3_out */
#define PB11_SCOM0P3_OUT MCHP_PINMUX(b, 11, 0x2e4, 1, periph)
/* pb11_scom1p0_out */
#define PB11_SCOM1P0_OUT MCHP_PINMUX(b, 11, 0x2e4, 4, periph)
/* pb11_scom1p1_in */
#define PB11_SCOM1P1_IN  MCHP_PINMUX(b, 11, 0x54, 6, periph)
/* pb11_scom1p1_out */
#define PB11_SCOM1P1_OUT MCHP_PINMUX(b, 11, 0x2e4, 6, periph)
/* pb11_scom1p2_in */
#define PB11_SCOM1P2_IN  MCHP_PINMUX(b, 11, 0x58, 14, periph)
/* pb11_scom1p2_out */
#define PB11_SCOM1P2_OUT MCHP_PINMUX(b, 11, 0x2e4, 5, periph)
/* pb11_scom1p3_out */
#define PB11_SCOM1P3_OUT MCHP_PINMUX(b, 11, 0x2e8, 4, periph)
/* pb11_scom2p0_in */
#define PB11_SCOM2P0_IN  MCHP_PINMUX(b, 11, 0x60, 6, periph)
/* pb11_scom2p0_out */
#define PB11_SCOM2P0_OUT MCHP_PINMUX(b, 11, 0x2e4, 7, periph)
/* pb11_scom2p1_in */
#define PB11_SCOM2P1_IN  MCHP_PINMUX(b, 11, 0x64, 14, periph)
/* pb11_scom2p1_out */
#define PB11_SCOM2P1_OUT MCHP_PINMUX(b, 11, 0x2e4, 8, periph)
/* pb11_scom2p3_out */
#define PB11_SCOM2P3_OUT MCHP_PINMUX(b, 11, 0x2e8, 7, periph)
/* pb11_scom3p0_in */
#define PB11_SCOM3P0_IN  MCHP_PINMUX(b, 11, 0x70, 14, periph)
/* pb11_scom3p0_out */
#define PB11_SCOM3P0_OUT MCHP_PINMUX(b, 11, 0x2e4, 9, periph)
/* pb11_scom3p2_out */
#define PB11_SCOM3P2_OUT MCHP_PINMUX(b, 11, 0x2e8, 10, periph)
/* pb11_scom3p3_in */
#define PB11_SCOM3P3_IN  MCHP_PINMUX(b, 11, 0x7c, 6, periph)
/* pb11_scom3p3_out */
#define PB11_SCOM3P3_OUT MCHP_PINMUX(b, 11, 0x2e4, 10, periph)
/* pb11_tc0wo0g1_in */
#define PB11_TC0WO0G1_IN MCHP_PINMUX(b, 11, 0xb0, 14, periph)
/* pb11_tc0wo0_out */
#define PB11_TC0WO0_OUT  MCHP_PINMUX(b, 11, 0x2e8, 18, periph)
/* pb11_tc0wo1g4_in */
#define PB11_TC0WO1G4_IN MCHP_PINMUX(b, 11, 0xbc, 6, periph)
/* pb11_tc0wo1_out */
#define PB11_TC0WO1_OUT  MCHP_PINMUX(b, 11, 0x2e4, 18, periph)
/* pb11_tc1wo0g1_in */
#define PB11_TC1WO0G1_IN MCHP_PINMUX(b, 11, 0xc0, 14, periph)
/* pb11_tc1wo0_out */
#define PB11_TC1WO0_OUT  MCHP_PINMUX(b, 11, 0x2e4, 20, periph)
/* pb11_tc1wo1_out */
#define PB11_TC1WO1_OUT  MCHP_PINMUX(b, 11, 0x2e8, 20, periph)
/* pb11_tc2wo0g1_in */
#define PB11_TC2WO0G1_IN MCHP_PINMUX(b, 11, 0xc8, 14, periph)
/* pb11_tc2wo0_out */
#define PB11_TC2WO0_OUT  MCHP_PINMUX(b, 11, 0x2e4, 21, periph)
/* pb11_tc2wo1g4_in */
#define PB11_TC2WO1G4_IN MCHP_PINMUX(b, 11, 0xd4, 6, periph)
/* pb11_tc2wo1_out */
#define PB11_TC2WO1_OUT  MCHP_PINMUX(b, 11, 0x2e8, 21, periph)
/* pb11_tc3wo0g1_in */
#define PB11_TC3WO0G1_IN MCHP_PINMUX(b, 11, 0xd8, 14, periph)
/* pb11_tc3wo0_out */
#define PB11_TC3WO0_OUT  MCHP_PINMUX(b, 11, 0x2e4, 22, periph)
/* pb11_tc3wo1g4_in */
#define PB11_TC3WO1G4_IN MCHP_PINMUX(b, 11, 0xe4, 6, periph)
/* pb11_tc3wo1_out */
#define PB11_TC3WO1_OUT  MCHP_PINMUX(b, 11, 0x2e8, 22, periph)
/* pb11_tcc0wo0_out */
#define PB11_TCC0WO0_OUT MCHP_PINMUX(b, 11, 0x2e4, 11, periph)
/* pb11_tcc0wo1_out */
#define PB11_TCC0WO1_OUT MCHP_PINMUX(b, 11, 0x2e8, 12, periph)
/* pb11_tcc0wo2_out */
#define PB11_TCC0WO2_OUT MCHP_PINMUX(b, 11, 0x2e4, 13, periph)
/* pb11_tcc0wo3_out */
#define PB11_TCC0WO3_OUT MCHP_PINMUX(b, 11, 0x2e8, 11, periph)
/* pb11_tcc0wo4_out */
#define PB11_TCC0WO4_OUT MCHP_PINMUX(b, 11, 0x2e4, 12, periph)
/* pb11_tcc0wo5_out */
#define PB11_TCC0WO5_OUT MCHP_PINMUX(b, 11, 0x2e8, 13, periph)
/* pb11_tcc1wo0_out */
#define PB11_TCC1WO0_OUT MCHP_PINMUX(b, 11, 0x2e4, 14, periph)
/* pb11_tcc1wo1_out */
#define PB11_TCC1WO1_OUT MCHP_PINMUX(b, 11, 0x2e8, 15, periph)
/* pb11_tcc1wo2_out */
#define PB11_TCC1WO2_OUT MCHP_PINMUX(b, 11, 0x2e4, 16, periph)
/* pb11_tcc1wo3_out */
#define PB11_TCC1WO3_OUT MCHP_PINMUX(b, 11, 0x2e8, 14, periph)
/* pb11_tcc1wo4_out */
#define PB11_TCC1WO4_OUT MCHP_PINMUX(b, 11, 0x2e4, 15, periph)
/* pb11_tcc1wo5_out */
#define PB11_TCC1WO5_OUT MCHP_PINMUX(b, 11, 0x2e8, 16, periph)
/* pb11_tcc2wo0_out */
#define PB11_TCC2WO0_OUT MCHP_PINMUX(b, 11, 0x2e4, 17, periph)
/* pb11_tcc2wo1_out */
#define PB11_TCC2WO1_OUT MCHP_PINMUX(b, 11, 0x2e8, 17, periph)
/* pb12_cclin0_in */
#define PB12_CCLIN0_IN   MCHP_PINMUX(b, 12, 0x98, 7, periph)
/* pb12_cclin1_in */
#define PB12_CCLIN1_IN   MCHP_PINMUX(b, 12, 0x9c, 14, periph)
/* pb12_cclin3_in */
#define PB12_CCLIN3_IN   MCHP_PINMUX(b, 12, 0xa4, 7, periph)
/* pb12_cclin4_in */
#define PB12_CCLIN4_IN   MCHP_PINMUX(b, 12, 0xa8, 14, periph)
/* pb12_cclout0_out */
#define PB12_CCLOUT0_OUT MCHP_PINMUX(b, 12, 0x2ec, 28, periph)
/* pb12_cclout1_out */
#define PB12_CCLOUT1_OUT MCHP_PINMUX(b, 12, 0x2f0, 28, periph)
/* pb12_extint0_in */
#define PB12_EXTINT0_IN  MCHP_PINMUX(b, 12, 0x0, 7, periph)
/* pb12_extint1_in */
#define PB12_EXTINT1_IN  MCHP_PINMUX(b, 12, 0x4, 14, periph)
/* pb12_qcs_out */
#define PB12_QCS_OUT     MCHP_PINMUX(b, 12, 0x2ec, 24, periph)
/* pb12_qd0_out */
#define PB12_QD0_OUT     MCHP_PINMUX(b, 12, 0x2f0, 25, periph)
/* pb12_qd1_in */
#define PB12_QD1_IN      MCHP_PINMUX(b, 12, 0x88, 7, periph)
/* pb12_qd1_out */
#define PB12_QD1_OUT     MCHP_PINMUX(b, 12, 0x2ec, 27, periph)
/* pb12_qd2_in */
#define PB12_QD2_IN      MCHP_PINMUX(b, 12, 0x8c, 14, periph)
/* pb12_qd2_out */
#define PB12_QD2_OUT     MCHP_PINMUX(b, 12, 0x2ec, 26, periph)
/* pb12_qd3_out */
#define PB12_QD3_OUT     MCHP_PINMUX(b, 12, 0x2ec, 25, periph)
/* pb12_qsck_in */
#define PB12_QSCK_IN     MCHP_PINMUX(b, 12, 0x80, 7, periph)
/* pb12_qsck_out */
#define PB12_QSCK_OUT    MCHP_PINMUX(b, 12, 0x2ec, 23, periph)
/* pb12_refi_in */
#define PB12_REFI_IN     MCHP_PINMUX(b, 12, 0x94, 7, periph)
/* pb12_refo1_out */
#define PB12_REFO1_OUT   MCHP_PINMUX(b, 12, 0x2ec, 19, periph)
/* pb12_refo2_out */
#define PB12_REFO2_OUT   MCHP_PINMUX(b, 12, 0x2f0, 19, periph)
/* pb12_scom0p0_in */
#define PB12_SCOM0P0_IN  MCHP_PINMUX(b, 12, 0x40, 14, periph)
/* pb12_scom0p0_out */
#define PB12_SCOM0P0_OUT MCHP_PINMUX(b, 12, 0x2f0, 1, periph)
/* pb12_scom0p1_out */
#define PB12_SCOM0P1_OUT MCHP_PINMUX(b, 12, 0x2ec, 3, periph)
/* pb12_scom0p2_out */
#define PB12_SCOM0P2_OUT MCHP_PINMUX(b, 12, 0x2ec, 2, periph)
/* pb12_scom0p3_in */
#define PB12_SCOM0P3_IN  MCHP_PINMUX(b, 12, 0x4c, 7, periph)
/* pb12_scom0p3_out */
#define PB12_SCOM0P3_OUT MCHP_PINMUX(b, 12, 0x2ec, 1, periph)
/* pb12_scom1p0_out */
#define PB12_SCOM1P0_OUT MCHP_PINMUX(b, 12, 0x2ec, 4, periph)
/* pb12_scom1p1_out */
#define PB12_SCOM1P1_OUT MCHP_PINMUX(b, 12, 0x2ec, 6, periph)
/* pb12_scom1p2_in */
#define PB12_SCOM1P2_IN  MCHP_PINMUX(b, 12, 0x58, 7, periph)
/* pb12_scom1p2_out */
#define PB12_SCOM1P2_OUT MCHP_PINMUX(b, 12, 0x2ec, 5, periph)
/* pb12_scom1p3_in */
#define PB12_SCOM1P3_IN  MCHP_PINMUX(b, 12, 0x5c, 14, periph)
/* pb12_scom1p3_out */
#define PB12_SCOM1P3_OUT MCHP_PINMUX(b, 12, 0x2f0, 5, periph)
/* pb12_scom2p0_out */
#define PB12_SCOM2P0_OUT MCHP_PINMUX(b, 12, 0x2ec, 7, periph)
/* pb12_scom2p1_in */
#define PB12_SCOM2P1_IN  MCHP_PINMUX(b, 12, 0x64, 7, periph)
/* pb12_scom2p1_out */
#define PB12_SCOM2P1_OUT MCHP_PINMUX(b, 12, 0x2ec, 8, periph)
/* pb12_scom2p2_in */
#define PB12_SCOM2P2_IN  MCHP_PINMUX(b, 12, 0x68, 14, periph)
/* pb12_scom2p2_out */
#define PB12_SCOM2P2_OUT MCHP_PINMUX(b, 12, 0x2f0, 8, periph)
/* pb12_scom3p0_in */
#define PB12_SCOM3P0_IN  MCHP_PINMUX(b, 12, 0x70, 7, periph)
/* pb12_scom3p0_out */
#define PB12_SCOM3P0_OUT MCHP_PINMUX(b, 12, 0x2ec, 9, periph)
/* pb12_scom3p1_in */
#define PB12_SCOM3P1_IN  MCHP_PINMUX(b, 12, 0x74, 14, periph)
/* pb12_scom3p1_out */
#define PB12_SCOM3P1_OUT MCHP_PINMUX(b, 12, 0x2f0, 9, periph)
/* pb12_scom3p3_out */
#define PB12_SCOM3P3_OUT MCHP_PINMUX(b, 12, 0x2ec, 10, periph)
/* pb12_tc0wo0g1_in */
#define PB12_TC0WO0G1_IN MCHP_PINMUX(b, 12, 0xb0, 7, periph)
/* pb12_tc0wo0g2_in */
#define PB12_TC0WO0G2_IN MCHP_PINMUX(b, 12, 0xb4, 14, periph)
/* pb12_tc0wo1_out */
#define PB12_TC0WO1_OUT  MCHP_PINMUX(b, 12, 0x2ec, 18, periph)
/* pb12_tc1wo0g1_in */
#define PB12_TC1WO0G1_IN MCHP_PINMUX(b, 12, 0xc0, 7, periph)
/* pb12_tc1wo0_out */
#define PB12_TC1WO0_OUT  MCHP_PINMUX(b, 12, 0x2ec, 20, periph)
/* pb12_tc1wo1g2_in */
#define PB12_TC1WO1G2_IN MCHP_PINMUX(b, 12, 0xc4, 14, periph)
/* pb12_tc1wo1_out */
#define PB12_TC1WO1_OUT  MCHP_PINMUX(b, 12, 0x2f0, 20, periph)
/* pb12_tc2wo0g1_in */
#define PB12_TC2WO0G1_IN MCHP_PINMUX(b, 12, 0xc8, 7, periph)
/* pb12_tc2wo0_out */
#define PB12_TC2WO0_OUT  MCHP_PINMUX(b, 12, 0x2ec, 21, periph)
/* pb12_tc2wo1g2_in */
#define PB12_TC2WO1G2_IN MCHP_PINMUX(b, 12, 0xd0, 14, periph)
/* pb12_tc2wo1_out */
#define PB12_TC2WO1_OUT  MCHP_PINMUX(b, 12, 0x2f0, 21, periph)
/* pb12_tc3wo0g1_in */
#define PB12_TC3WO0G1_IN MCHP_PINMUX(b, 12, 0xd8, 7, periph)
/* pb12_tc3wo0_out */
#define PB12_TC3WO0_OUT  MCHP_PINMUX(b, 12, 0x2ec, 22, periph)
/* pb12_tc3wo1g2_in */
#define PB12_TC3WO1G2_IN MCHP_PINMUX(b, 12, 0xe0, 14, periph)
/* pb12_tc3wo1_out */
#define PB12_TC3WO1_OUT  MCHP_PINMUX(b, 12, 0x2f0, 22, periph)
/* pb12_tcc0wo0_out */
#define PB12_TCC0WO0_OUT MCHP_PINMUX(b, 12, 0x2ec, 11, periph)
/* pb12_tcc0wo1_out */
#define PB12_TCC0WO1_OUT MCHP_PINMUX(b, 12, 0x2f0, 11, periph)
/* pb12_tcc0wo2_out */
#define PB12_TCC0WO2_OUT MCHP_PINMUX(b, 12, 0x2ec, 13, periph)
/* pb12_tcc0wo3_out */
#define PB12_TCC0WO3_OUT MCHP_PINMUX(b, 12, 0x2f0, 13, periph)
/* pb12_tcc0wo4_out */
#define PB12_TCC0WO4_OUT MCHP_PINMUX(b, 12, 0x2ec, 12, periph)
/* pb12_tcc0wo5_out */
#define PB12_TCC0WO5_OUT MCHP_PINMUX(b, 12, 0x2f0, 12, periph)
/* pb12_tcc1wo0_out */
#define PB12_TCC1WO0_OUT MCHP_PINMUX(b, 12, 0x2ec, 14, periph)
/* pb12_tcc1wo1_out */
#define PB12_TCC1WO1_OUT MCHP_PINMUX(b, 12, 0x2f0, 14, periph)
/* pb12_tcc1wo2_out */
#define PB12_TCC1WO2_OUT MCHP_PINMUX(b, 12, 0x2ec, 16, periph)
/* pb12_tcc1wo3_out */
#define PB12_TCC1WO3_OUT MCHP_PINMUX(b, 12, 0x2f0, 16, periph)
/* pb12_tcc1wo4_out */
#define PB12_TCC1WO4_OUT MCHP_PINMUX(b, 12, 0x2ec, 15, periph)
/* pb12_tcc1wo5_out */
#define PB12_TCC1WO5_OUT MCHP_PINMUX(b, 12, 0x2f0, 15, periph)
/* pb12_tcc2wo0_out */
#define PB12_TCC2WO0_OUT MCHP_PINMUX(b, 12, 0x2ec, 17, periph)
/* pb12_tcc2wo1_out */
#define PB12_TCC2WO1_OUT MCHP_PINMUX(b, 12, 0x2f0, 17, periph)
/* pb13_cclin1_in */
#define PB13_CCLIN1_IN   MCHP_PINMUX(b, 13, 0x9c, 7, periph)
/* pb13_cclin2_in */
#define PB13_CCLIN2_IN   MCHP_PINMUX(b, 13, 0xa0, 14, periph)
/* pb13_cclin4_in */
#define PB13_CCLIN4_IN   MCHP_PINMUX(b, 13, 0xa8, 7, periph)
/* pb13_cclin5_in */
#define PB13_CCLIN5_IN   MCHP_PINMUX(b, 13, 0xac, 14, periph)
/* pb13_cclout0_out */
#define PB13_CCLOUT0_OUT MCHP_PINMUX(b, 13, 0x2f8, 28, periph)
/* pb13_cclout1_out */
#define PB13_CCLOUT1_OUT MCHP_PINMUX(b, 13, 0x2f4, 28, periph)
/* pb13_extint1_in */
#define PB13_EXTINT1_IN  MCHP_PINMUX(b, 13, 0x4, 7, periph)
/* pb13_extint2_in */
#define PB13_EXTINT2_IN  MCHP_PINMUX(b, 13, 0x8, 14, periph)
/* pb13_qcs_out */
#define PB13_QCS_OUT     MCHP_PINMUX(b, 13, 0x2f4, 24, periph)
/* pb13_qd0_out */
#define PB13_QD0_OUT     MCHP_PINMUX(b, 13, 0x2f4, 25, periph)
/* pb13_qd1_out */
#define PB13_QD1_OUT     MCHP_PINMUX(b, 13, 0x2f8, 25, periph)
/* pb13_qd2_in */
#define PB13_QD2_IN      MCHP_PINMUX(b, 13, 0x8c, 7, periph)
/* pb13_qd2_out */
#define PB13_QD2_OUT     MCHP_PINMUX(b, 13, 0x2f4, 27, periph)
/* pb13_qd3_in */
#define PB13_QD3_IN      MCHP_PINMUX(b, 13, 0x90, 14, periph)
/* pb13_qd3_out */
#define PB13_QD3_OUT     MCHP_PINMUX(b, 13, 0x2f4, 26, periph)
/* pb13_qsck_out */
#define PB13_QSCK_OUT    MCHP_PINMUX(b, 13, 0x2f4, 23, periph)
/* pb13_refo2_out */
#define PB13_REFO2_OUT   MCHP_PINMUX(b, 13, 0x2f4, 19, periph)
/* pb13_refo3_out */
#define PB13_REFO3_OUT   MCHP_PINMUX(b, 13, 0x2f8, 19, periph)
/* pb13_scom0p0_in */
#define PB13_SCOM0P0_IN  MCHP_PINMUX(b, 13, 0x40, 7, periph)
/* pb13_scom0p0_out */
#define PB13_SCOM0P0_OUT MCHP_PINMUX(b, 13, 0x2f4, 1, periph)
/* pb13_scom0p1_in */
#define PB13_SCOM0P1_IN  MCHP_PINMUX(b, 13, 0x44, 14, periph)
/* pb13_scom0p1_out */
#define PB13_SCOM0P1_OUT MCHP_PINMUX(b, 13, 0x2f8, 1, periph)
/* pb13_scom0p2_out */
#define PB13_SCOM0P2_OUT MCHP_PINMUX(b, 13, 0x2f4, 3, periph)
/* pb13_scom0p3_out */
#define PB13_SCOM0P3_OUT MCHP_PINMUX(b, 13, 0x2f4, 2, periph)
/* pb13_scom1p0_in */
#define PB13_SCOM1P0_IN  MCHP_PINMUX(b, 13, 0x50, 14, periph)
/* pb13_scom1p0_out */
#define PB13_SCOM1P0_OUT MCHP_PINMUX(b, 13, 0x2f8, 5, periph)
/* pb13_scom1p1_out */
#define PB13_SCOM1P1_OUT MCHP_PINMUX(b, 13, 0x2f4, 4, periph)
/* pb13_scom1p2_out */
#define PB13_SCOM1P2_OUT MCHP_PINMUX(b, 13, 0x2f4, 6, periph)
/* pb13_scom1p3_in */
#define PB13_SCOM1P3_IN  MCHP_PINMUX(b, 13, 0x5c, 7, periph)
/* pb13_scom1p3_out */
#define PB13_SCOM1P3_OUT MCHP_PINMUX(b, 13, 0x2f4, 5, periph)
/* pb13_scom2p1_out */
#define PB13_SCOM2P1_OUT MCHP_PINMUX(b, 13, 0x2f4, 7, periph)
/* pb13_scom2p2_in */
#define PB13_SCOM2P2_IN  MCHP_PINMUX(b, 13, 0x68, 7, periph)
/* pb13_scom2p2_out */
#define PB13_SCOM2P2_OUT MCHP_PINMUX(b, 13, 0x2f4, 8, periph)
/* pb13_scom2p3_in */
#define PB13_SCOM2P3_IN  MCHP_PINMUX(b, 13, 0x6c, 14, periph)
/* pb13_scom2p3_out */
#define PB13_SCOM2P3_OUT MCHP_PINMUX(b, 13, 0x2f8, 8, periph)
/* pb13_scom3p0_out */
#define PB13_SCOM3P0_OUT MCHP_PINMUX(b, 13, 0x2f4, 10, periph)
/* pb13_scom3p1_in */
#define PB13_SCOM3P1_IN  MCHP_PINMUX(b, 13, 0x74, 7, periph)
/* pb13_scom3p1_out */
#define PB13_SCOM3P1_OUT MCHP_PINMUX(b, 13, 0x2f4, 9, periph)
/* pb13_scom3p2_in */
#define PB13_SCOM3P2_IN  MCHP_PINMUX(b, 13, 0x78, 14, periph)
/* pb13_scom3p2_out */
#define PB13_SCOM3P2_OUT MCHP_PINMUX(b, 13, 0x2f8, 9, periph)
/* pb13_tc0wo0g2_in */
#define PB13_TC0WO0G2_IN MCHP_PINMUX(b, 13, 0xb4, 7, periph)
/* pb13_tc0wo0_out */
#define PB13_TC0WO0_OUT  MCHP_PINMUX(b, 13, 0x2f8, 18, periph)
/* pb13_tc0wo1g3_in */
#define PB13_TC0WO1G3_IN MCHP_PINMUX(b, 13, 0xb8, 14, periph)
/* pb13_tc0wo1_out */
#define PB13_TC0WO1_OUT  MCHP_PINMUX(b, 13, 0x2f4, 18, periph)
/* pb13_tc1wo0_out */
#define PB13_TC1WO0_OUT  MCHP_PINMUX(b, 13, 0x2f8, 20, periph)
/* pb13_tc1wo1g2_in */
#define PB13_TC1WO1G2_IN MCHP_PINMUX(b, 13, 0xc4, 7, periph)
/* pb13_tc1wo1_out */
#define PB13_TC1WO1_OUT  MCHP_PINMUX(b, 13, 0x2f4, 20, periph)
/* pb13_tc2wo0g3_in */
#define PB13_TC2WO0G3_IN MCHP_PINMUX(b, 13, 0xcc, 14, periph)
/* pb13_tc2wo0_out */
#define PB13_TC2WO0_OUT  MCHP_PINMUX(b, 13, 0x2f8, 21, periph)
/* pb13_tc2wo1g2_in */
#define PB13_TC2WO1G2_IN MCHP_PINMUX(b, 13, 0xd0, 7, periph)
/* pb13_tc2wo1_out */
#define PB13_TC2WO1_OUT  MCHP_PINMUX(b, 13, 0x2f4, 21, periph)
/* pb13_tc3wo0g3_in */
#define PB13_TC3WO0G3_IN MCHP_PINMUX(b, 13, 0xdc, 14, periph)
/* pb13_tc3wo0_out */
#define PB13_TC3WO0_OUT  MCHP_PINMUX(b, 13, 0x2f8, 22, periph)
/* pb13_tc3wo1g2_in */
#define PB13_TC3WO1G2_IN MCHP_PINMUX(b, 13, 0xe0, 7, periph)
/* pb13_tc3wo1_out */
#define PB13_TC3WO1_OUT  MCHP_PINMUX(b, 13, 0x2f4, 22, periph)
/* pb13_tcc0wo0_out */
#define PB13_TCC0WO0_OUT MCHP_PINMUX(b, 13, 0x2f8, 12, periph)
/* pb13_tcc0wo1_out */
#define PB13_TCC0WO1_OUT MCHP_PINMUX(b, 13, 0x2f4, 11, periph)
/* pb13_tcc0wo2_out */
#define PB13_TCC0WO2_OUT MCHP_PINMUX(b, 13, 0x2f8, 11, periph)
/* pb13_tcc0wo3_out */
#define PB13_TCC0WO3_OUT MCHP_PINMUX(b, 13, 0x2f4, 13, periph)
/* pb13_tcc0wo4_out */
#define PB13_TCC0WO4_OUT MCHP_PINMUX(b, 13, 0x2f8, 13, periph)
/* pb13_tcc0wo5_out */
#define PB13_TCC0WO5_OUT MCHP_PINMUX(b, 13, 0x2f4, 12, periph)
/* pb13_tcc1wo0_out */
#define PB13_TCC1WO0_OUT MCHP_PINMUX(b, 13, 0x2f8, 15, periph)
/* pb13_tcc1wo1_out */
#define PB13_TCC1WO1_OUT MCHP_PINMUX(b, 13, 0x2f4, 14, periph)
/* pb13_tcc1wo2_out */
#define PB13_TCC1WO2_OUT MCHP_PINMUX(b, 13, 0x2f8, 14, periph)
/* pb13_tcc1wo3_out */
#define PB13_TCC1WO3_OUT MCHP_PINMUX(b, 13, 0x2f4, 16, periph)
/* pb13_tcc1wo4_out */
#define PB13_TCC1WO4_OUT MCHP_PINMUX(b, 13, 0x2f8, 16, periph)
/* pb13_tcc1wo5_out */
#define PB13_TCC1WO5_OUT MCHP_PINMUX(b, 13, 0x2f4, 15, periph)
/* pb13_tcc2wo0_out */
#define PB13_TCC2WO0_OUT MCHP_PINMUX(b, 13, 0x2f8, 17, periph)
/* pb13_tcc2wo1_out */
#define PB13_TCC2WO1_OUT MCHP_PINMUX(b, 13, 0x2f4, 17, periph)

#endif /* MICROCHIP_PIC32CX1012BZ25048_PINCTRL_H_ */
